[
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-272",
        "domain": "ontocompchem",
        "question": "Can you tell me the total enthalpy value for Ce?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ce\" .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-324",
        "domain": "ontokin",
        "question": "Looking for details about the transportation and thermodynamics of C9OOH5-3O2 in every reaction mechanism where it's present.",
        "query": {
            "sparql": "SELECT ?TransportModel ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"C9OOH5-3O2\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-166",
        "domain": "ontocompchem",
        "question": "What's the calculated total enthalpy of Br- using the UB3LYP theory level with the aug-cc-pVDZ basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Br-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-32",
        "domain": "ontocompchem",
        "question": "Can you tell me the LUMO+2 energy for Gd as calculated at PBE0 level with the use of STO-3G basis set?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Gd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-117",
        "domain": "ontocompchem",
        "question": "What are the calculated frequencies of Pm at the UB3LYP level with the 6-311G basis set?",
        "query": {
            "sparql": "SELECT ?Frequencies WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-582",
        "domain": "ontospecies",
        "question": "Can you find me chemical species that fall under the polyatomic entity category with a minimum of -1 hydrogen bond donors, over one hydrogen bond acceptors and a viscosity near about 338.15?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue >= -1 )\n  ?Species os:hasViscosity/os:value ?ViscosityValue .\n  FILTER ( ?ViscosityValue > 338.15*0.9 && ?ViscosityValue < 338.15*1.1 )\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue > 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-977",
        "domain": "ontospecies",
        "question": "I need to know the isoelectric point and XLOGP3 of C8H23N5.",
        "query": {
            "sparql": "SELECT ?IsoelectricPoint ?XLogP3 WHERE {\n  VALUES ?Species { \"C8H23N5\" }\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n  ?Species os:hasXLogP3 ?XLogP3 .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-880",
        "domain": "ontospecies",
        "question": "Can you find me any chemical species used as Hydraulic fluids with a bond stereocenter count greater than -1, an autoignition temperature below 626.065, and a polar surface area between 23.67 and 29?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"Hydraulic fluids\" .\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > -1 )\n  ?Species os:hasAutoignitionTemperature/os:value ?AutoignitionTemperatureValue .\n  FILTER ( ?AutoignitionTemperatureValue < 626.065 )\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue > 23.67 && ?PolarSurfaceAreaValue < 29 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-124",
        "domain": "ontocompchem",
        "question": "What is the zero point energy of Gd across all level of theory and basis set",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Gd\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-194",
        "domain": "ontocompchem",
        "question": "Can I find the Ir LUMO+2 energy using the STO-2G basis set for all theory levels?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ir\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-2G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-993",
        "domain": "ontospecies",
        "question": "Can you tell me the dissociation constants, heat of combustion and number of heavy atoms in N-[(1-ethylpyrrolidin-2-yl)methyl]-2-methoxy-5-sulfamoyl-benzamide?",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion ?HeavyAtomCount ?DissociationConstants WHERE {\n  VALUES ?Species { \"N-[(1-ethylpyrrolidin-2-yl)methyl]-2-methoxy-5-sulfamoyl-benzamide\" }\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-150",
        "domain": "ontospecies",
        "question": "Different terms used for C9H12, C19H21N5O4, and C4H10O2?",
        "query": {
            "sparql": "SELECT ?IdentifierName WHERE {\n  VALUES ?Species { \"C9H12\" \"C19H21N5O4\" \"C4H10O2\" }\n  ?Species ?hasIdentifierName ?IdentifierName .\n  ?IdentifierName a/rdfs:subClassOf os:Identifier .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-438",
        "domain": "ontocompchem",
        "question": "Looking for the calculated HOMO-2 energy for Pm at the G3 level with the 3-21G basis set applied.",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-274",
        "domain": "ontokin",
        "question": "Search for a chemical reaction where C11OOH1-OO3-2 is a reactant.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C11OOH1-OO3-2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-398",
        "domain": "ontospecies",
        "question": "What is the atom chiral count of [2-(4-tert-butylphenoxy)-1-methyl-ethyl] 2-chloroethyl sulfite and CC1=CC(=CC(=C1SC)C)OC(=O)NC and CCCCOC(=O)C1=CC=C(C=C1)N",
        "query": {
            "sparql": "SELECT ?AtomChiralCount WHERE {\n  VALUES ?Species { \"[2-(4-tert-butylphenoxy)-1-methyl-ethyl] 2-chloroethyl sulfite\" \"CC1=CC(=CC(=C1SC)C)OC(=O)NC\" \"CCCCOC(=O)C1=CC=C(C=C1)N\" }\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-203",
        "domain": "ontocompchem",
        "question": "Can you find the LUMO energy of Tm as determined by CCSD(T) theory, with either the STO-4G or 6-311+G basis set?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" \"6-311+G\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-79",
        "domain": "ontocompchem",
        "question": "Can you tell me the total enthalpy for N2?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"N2\" .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-351",
        "domain": "ontospecies",
        "question": "Chemical species with atom chiral count of -1 or more and a density of 0.8834?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue >= -1 )\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue = 0.8834 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-233",
        "domain": "ontospecies",
        "question": "I need to know the flash point of C1(=O)N(C(=O)N(C(=O)N1Cl)Cl)Cl.",
        "query": {
            "sparql": "SELECT ?FlashPoint WHERE {\n  VALUES ?Species { \"C1(=O)N(C(=O)N(C(=O)N1Cl)Cl)Cl\" }\n  ?Species os:hasFlashPoint ?FlashPoint .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-112",
        "domain": "ontokin",
        "question": "Can you show me the kinetic model for a chemical reaction producing IC16-OQOOH?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"IC16-OQOOH\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-78",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction that has product MDCY692O and has reactant MOKET65O and is involved in the mechanism found in https://doi.org/10.1002/kin.20603",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDCY692O\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MOKET65O\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-276",
        "domain": "ontospecies",
        "question": "Looking for information on the dissociation constants and number of chiral bonds in C6H9N3O3, fluoranthene, and InChI=1S/C2H4Cl2/c1-2(3)4/h2H,1H3.",
        "query": {
            "sparql": "SELECT ?DissociationConstants ?BondChiralCount WHERE {\n  VALUES ?Species { \"C6H9N3O3\" \"fluoranthene\" \"InChI=1S/C2H4Cl2/c1-2(3)4/h2H,1H3\" }\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-359",
        "domain": "ontokin",
        "question": "Can you show me the kinetic model for a reaction that produces C8OOH4-8O2 from MS2O and IC8ETERAC?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C8OOH4-8O2\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MS2O\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"IC8ETERAC\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-571",
        "domain": "ontospecies",
        "question": "What's the value of Henry's law constant for any chemical species having an isotope atom count below 1.0, its exact mass not within (204-250) range and its monoisotopic weight being equal or more than to 204?",
        "query": {
            "sparql": "SELECT ?HenrysLawConstant WHERE {\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue < 1.0 )\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue < 204 || ?ExactMassValue > 250 )\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue >= 204 )\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-339",
        "domain": "ontocompchem",
        "question": "I need information on the calculation of the energy for the lowest unoccupied molecular orbital and electronic energy of BP at the B3LYP level, considering all basis set.",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?SCFEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BP\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-930",
        "domain": "ontospecies",
        "question": "How many isotope atoms does InChI=1S/C9H10ClN5O2/c10-8-2-1-7(5-12-8)6-14-4-3-11-9(14)13-15(16)17/h1-2,5H,3-4,6H2,(H,11,13) have?",
        "query": {
            "sparql": "SELECT ?IsotopeAtomCount WHERE {\n  VALUES ?Species { \"InChI=1S/C9H10ClN5O2/c10-8-2-1-7(5-12-8)6-14-4-3-11-9(14)13-15(16)17/h1-2,5H,3-4,6H2,(H,11,13)\" }\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-268",
        "domain": "ontospecies",
        "question": "For 2,5-dimethyl-4-oxidanyl-furan-3-one and C22H26F3N3OS and InChI=1S/C7H16O4/c1-9-4-5-11-7-6-10-3-2-8/h8H,2-7H2,1H3, what is their tautomer count",
        "query": {
            "sparql": "SELECT ?TautomerCount WHERE {\n  VALUES ?Species { \"2,5-dimethyl-4-oxidanyl-furan-3-one\" \"C22H26F3N3OS\" \"InChI=1S/C7H16O4/c1-9-4-5-11-7-6-10-3-2-8/h8H,2-7H2,1H3\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-641",
        "domain": "ontospecies",
        "question": "For C2H4O, what is its boiling point",
        "query": {
            "sparql": "SELECT ?BoilingPoint WHERE {\n  VALUES ?Species { \"C2H4O\" }\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-205",
        "domain": "ontokin",
        "question": "C5H10OOH1-2 involved in which chemical reaction?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C5H10OOH1-2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-200",
        "domain": "ontospecies",
        "question": "For InChI=1S/C2HBr2N/c3-2(4)1-5/h2H, what are its various names",
        "query": {
            "sparql": "SELECT ?IdentifierName WHERE {\n  VALUES ?Species { \"InChI=1S/C2HBr2N/c3-2(4)1-5/h2H\" }\n  ?Species ?hasIdentifierName ?IdentifierName .\n  ?IdentifierName a/rdfs:subClassOf os:Identifier .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-49",
        "domain": "ontospecies",
        "question": "What is the IUPAC name of C1=CC=C(C=C1)CC2=C(C=CC(=C2)Cl)O",
        "query": {
            "sparql": "SELECT ?IUPACName WHERE {\n  VALUES ?Species { \"C1=CC=C(C=C1)CC2=C(C=CC(=C2)Cl)O\" }\n  ?Species os:hasIUPACName ?IUPACName .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-397",
        "domain": "ontospecies",
        "question": "For InChI=1S/C11H11N3O2S/c12-9-4-6-10(7-5-9)17(15,16)14-11-3-1-2-8-13-11/h1-8H,12H2,(H,13,14), what is its viscosity",
        "query": {
            "sparql": "SELECT ?Viscosity WHERE {\n  VALUES ?Species { \"InChI=1S/C11H11N3O2S/c12-9-4-6-10(7-5-9)17(15,16)14-11-3-1-2-8-13-11/h1-8H,12H2,(H,13,14)\" }\n  ?Species os:hasViscosity ?Viscosity .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-117",
        "domain": "ontokin",
        "question": "What's the kinetic model for this specific reaction H + H2O2 <=> H2 + HO2, referenced in this link https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + H2O2 <=> H2 + HO2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-137",
        "domain": "ontokin",
        "question": "Can I get some insight into the chemical reaction's kinetic model mentioned in this linked mechanism https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-227",
        "domain": "ontokin",
        "question": "Can you explain the kinetic model for the chemical reaction from this https://doi.org/10.1002/kin.20603 mechanism?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-471",
        "domain": "ontokin",
        "question": "For the chemical reaction H + O2 (+ O2) <=> HO2 (+ O2), what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + O2 (+ O2) <=> HO2 (+ O2)\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-388",
        "domain": "ontocompchem",
        "question": "What's the calculation for the HOMO energy of CH4 using the RB3LYP level and the 3-21G basis set?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CH4\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-371",
        "domain": "ontokin",
        "question": "I'm looking for reactions where C*CC*CCJ is a reactant. How many such reactions are there in the mechanism described at https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C*CC*CCJ\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-325",
        "domain": "ontocompchem",
        "question": "What is the total energy of Pu calculated using the cc-pVQZ basis set, specifying the level of theory at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-475",
        "domain": "ontospecies",
        "question": "For C17H18FN3O3, what is its chemical class",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel WHERE {\n  VALUES ?Species { \"C17H18FN3O3\" }\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-308",
        "domain": "ontocompchem",
        "question": "Can you tell me the energy levels for both LUMO and ground state in COS using the cc-pVDZ basis sets? Particularly, what level of theory was used in these calculations?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?ZeroPointEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"COS\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-356",
        "domain": "ontocompchem",
        "question": "Zero point energy of H2O2 using CC-pVQZ basis set",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BH3\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-704",
        "domain": "ontospecies",
        "question": "How many chiral bonds does InChI=1S/C5H10O2/c1-3-5(6)7-4-2/h3-4H2,1-2H3 have?",
        "query": {
            "sparql": "SELECT ?BondChiralCount WHERE {\n  VALUES ?Species { \"InChI=1S/C5H10O2/c1-3-5(6)7-4-2/h3-4H2,1-2H3\" }\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-665",
        "domain": "ontospecies",
        "question": "What is the rotatable bond count of the chemical species whose undefined atom stereocenter count is less than 1",
        "query": {
            "sparql": "SELECT ?RotatableBondCount WHERE {\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue < 1 )\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-505",
        "domain": "ontospecies",
        "question": "Find chemicals for Home Maintenance that have under two hydrogen bond donors, a Henry's law constant outside of 0 to 0.13597815000000002 range, zero undefined atom stereocenters and over 0.9 undef chiral bonds.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue < 2 )\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue < 0 || ?HenrysLawConstantValue > 0.13597815000000002 )\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue = 0.0 )\n  ?Species os:hasUse/rdfs:label \"Home Maintenance\" .\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue > 0.9 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-96",
        "domain": "ontospecies",
        "question": "What are the chemical species whose bond chiral undef count is greater than -1 and chemical classification is carbonyl compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue > -1 )\n  ?Species os:hasChemicalClass/rdfs:label \"carbonyl compound\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-69",
        "domain": "ontocompchem",
        "question": "I need to find out the energy of LUMO+2 and Ta computed with cc-pVDZ or 6-311G basis set.",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ta\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-787",
        "domain": "ontospecies",
        "question": "Need to find out the chemical species acting as human xenobiotic metabolite with nearly zero bond chiral count.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"human xenobiotic metabolite\" .\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > -0.1 && ?BondChiralCountValue < 0.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-885",
        "domain": "ontospecies",
        "question": "I'm looking for information on the standard enthalpy of formation and monoisotopic mass of C10H20O.",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation ?MonoIsotopicWeight WHERE {\n  VALUES ?Species { \"C10H20O\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-201",
        "domain": "ontocompchem",
        "question": "Find the RB3LYP level energy of Ag, basis set specified for calculation",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ag\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-194",
        "domain": "ontospecies",
        "question": "What's the sublimation enthalpy for 1-chloro-4-[2,2,2-trichloro-1-(4-chlorophenyl)ethyl]benzene and 2-benzofuran-1,3-dione?",
        "query": {
            "sparql": "SELECT ?EnthalpyOfSublimation WHERE {\n  VALUES ?Species { \"1-chloro-4-[2,2,2-trichloro-1-(4-chlorophenyl)ethyl]benzene\" \"2-benzofuran-1,3-dione\" }\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-145",
        "domain": "ontokin",
        "question": "Could you give me more details about the kinetics of the H + H2 + H <=> H2 + H2 reaction mechanism offered at www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + H2 + H <=> H2 + H2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    }
]