[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-214",
        "domain": "ontospecies",
        "question": "Need to search for Intermediates chemicals where the atom's chiral definition is more than -1, molecular weight falls within the range of 93 to 115, and both the definite and estimated counts of bond chirality are zero.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue > -1 )\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue > 93 && ?MolecularWeightValue < 115 )\n  ?Species os:hasUse/rdfs:label \"Intermediates\" .\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue = 0.0 )\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > -0.1 && ?BondChiralCountValue < 0.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-416",
        "domain": "ontospecies",
        "question": "What's the optical rotation value for C6H14O?",
        "query": {
            "sparql": "SELECT ?OpticalRotation WHERE {\n  VALUES ?Species { \"C6H14O\" }\n  ?Species os:hasOpticalRotation ?OpticalRotation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-1007",
        "domain": "ontospecies",
        "question": "What is the bond chiral count and charge of tris(fluoranyl)-lambda3-chlorane",
        "query": {
            "sparql": "SELECT ?BondChiralCount ?Charge WHERE {\n  VALUES ?Species { \"tris(fluoranyl)-lambda3-chlorane\" }\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n  ?Species os:hasCharge ?Charge .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-154",
        "domain": "ontocompchem",
        "question": "I need to know the SCF energy and the optimized geometry for Ag as determined by HF level, using either aug-cc-pVDZ, cc-pVQZ, or STO-5G basis set.",
        "query": {
            "sparql": "SELECT ?SCFEnergy ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ag\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" \"cc-pVQZ\" \"STO-5G\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-462",
        "domain": "ontokin",
        "question": "What's the reaction kinetics of H + HO2 = H2 + O2 in the process outlined at www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + HO2 = H2 + O2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-824",
        "domain": "ontospecies",
        "question": "Can you tell me the vapor pressure, flash point and XLogP3 values for CN(CC(=O)O)C(=N)N and 5-ethyl-5-pentan-2-yl-1,3-diazinane-2,4,6-trione?",
        "query": {
            "sparql": "SELECT ?VaporPressure ?FlashPoint ?XLogP3 WHERE {\n  VALUES ?Species { \"CN(CC(=O)O)C(=N)N\" \"5-ethyl-5-pentan-2-yl-1,3-diazinane-2,4,6-trione\" }\n  ?Species os:hasVaporPressure ?VaporPressure .\n  ?Species os:hasFlashPoint ?FlashPoint .\n  ?Species os:hasXLogP3 ?XLogP3 .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-299",
        "domain": "ontocompchem",
        "question": "Looking for the ground state energy values for F3N considering all theoretical levels and basis sets.",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F3N\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-239",
        "domain": "ontospecies",
        "question": "I need to find out the polar surface area of C1=CC(=CC=C1C(=O)O)Cl, can you help?",
        "query": {
            "sparql": "SELECT ?PolarSurfaceArea WHERE {\n  VALUES ?Species { \"C1=CC(=CC=C1C(=O)O)Cl\" }\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-243",
        "domain": "ontospecies",
        "question": "What is the polar surface area and Chemical Entities of Biological Interest ID of 6-amino-5-fluoro-1<I>H</I>-pyrimidin-2-one",
        "query": {
            "sparql": "SELECT ?PolarSurfaceArea ?ChebiID WHERE {\n  VALUES ?Species { \"6-amino-5-fluoro-1<I>H</I>-pyrimidin-2-one\" }\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n  ?Species os:hasChebiID ?ChebiID .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-840",
        "domain": "ontospecies",
        "question": "Find the vapor pressure for chemicals that are used in both Solvent applications and as Fuels and fuel additives, but have a polar surface area under 1",
        "query": {
            "sparql": "SELECT ?VaporPressure WHERE {\n  ?Species os:hasUse/rdfs:label \"Solvent\" .\n  ?Species os:hasUse/rdfs:label \"Fuels and fuel additives\" .\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue < 1 )\n  ?Species os:hasVaporPressure ?VaporPressure .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-491",
        "domain": "ontocompchem",
        "question": "What is the energy of lowest unoccupied molecular orbital of F2O calculated at the RB3LYP level",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F2O\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-1004",
        "domain": "ontospecies",
        "question": "Can you tell me the number of hydrogen bonds that InChI=1S/C21H21O4P/c1-16-4-10-19(11-5-16)23-26(22,24-20-12-6-17(2)7-13-20)25-21-14-8-18(3)9-15-21/h4-15H,1-3H3 and C8H11N can give?",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount WHERE {\n  VALUES ?Species { \"InChI=1S/C21H21O4P/c1-16-4-10-19(11-5-16)23-26(22,24-20-12-6-17(2)7-13-20)25-21-14-8-18(3)9-15-21/h4-15H,1-3H3\" \"C8H11N\" }\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-473",
        "domain": "ontospecies",
        "question": "Chemical classification of InChI=1S/C22H29FO5/c1-12-8-16-15-5-4-13-9-14(25)6-7-19(13,2)21(15,23)17(26)10-20(16,3)22(12,28)18(27)11-24/h6-7,9,12,15-17,24,26,28H,4-5,8,10-11H2,1-3H3/t12-,15+,16+,17+,19+,20+,21+,22+/m1/s1 and InChI=1S/C9H18/c1-8(2)9-6-4-3-5-7-9/h8-9H,3-7H2,1-2H3?",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel WHERE {\n  VALUES ?Species { \"InChI=1S/C22H29FO5/c1-12-8-16-15-5-4-13-9-14(25)6-7-19(13,2)21(15,23)17(26)10-20(16,3)22(12,28)18(27)11-24/h6-7,9,12,15-17,24,26,28H,4-5,8,10-11H2,1-3H3/t12-,15+,16+,17+,19+,20+,21+,22+/m1/s1\" \"InChI=1S/C9H18/c1-8(2)9-6-4-3-5-7-9/h8-9H,3-7H2,1-2H3\" }\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-184",
        "domain": "ontocompchem",
        "question": "Need to find the HOMO energy of Cl2 with specified basis set considered.",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cl2\" .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-239",
        "domain": "ontocompchem",
        "question": "Could you find data on Ac's ground state energy and the rotational constants when computed with HF level using CC-pVTZ or aug-cc-pVQZ basis?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ac\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" \"aug-cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-5",
        "domain": "ontospecies",
        "question": "I'm looking for chemicals where the Henry's law constant is under 66.42867, the bond stereocenter count doesn't exceed 1 and the autoignition temperature is lower than 770.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue < 66.42867 )\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue <= 1 )\n  ?Species os:hasAutoignitionTemperature/os:value ?AutoignitionTemperatureValue .\n  FILTER ( ?AutoignitionTemperatureValue < 770 )\n}"
        }
    }
]