[
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-107",
        "domain": "ontokin",
        "question": "I want to understand the transport model for the chemical species in the reaction mechanism mentioned in this paper https://doi.org/10.1002/kin.20026. Can you please help?",
        "query": {
            "sparql": "SELECT ?TransportModel WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-592",
        "domain": "ontospecies",
        "question": "Log P of a polyatomic entity that has a density equal to 0.98?",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue = 0.98 )\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-427",
        "domain": "ontocompchem",
        "question": "What is the energy of Cl2 calculated at the M06 level of theory",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cl2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-386",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction HO2 + HO2 <=> H2O2 + O2",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"HO2 + HO2 <=> H2O2 + O2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-291",
        "domain": "ontospecies",
        "question": "What's the count of rotatable bonds in InChI=1S/C7H8O/c1-6-2-4-7(8)5-3-6/h2-5,8H,1H3 and InChI=1S/C27H46O/c1-18(2)7-6-8-19(3)23-11-12-24-22-10-9-20-17-21(28)13-15-26(20,4)25(22)14-16-27(23,24)5/h9,18-19,21-25,28H,6-8,10-17H2,1-5H3/t19-,21+,22+,23-,24+,25+,26+,27-/m1/s1?",
        "query": {
            "sparql": "SELECT ?RotatableBondCount WHERE {\n  VALUES ?Species { \"InChI=1S/C7H8O/c1-6-2-4-7(8)5-3-6/h2-5,8H,1H3\" \"InChI=1S/C27H46O/c1-18(2)7-6-8-19(3)23-11-12-24-22-10-9-20-17-21(28)13-15-26(20,4)25(22)14-16-27(23,24)5/h9,18-19,21-25,28H,6-8,10-17H2,1-5H3/t19-,21+,22+,23-,24+,25+,26+,27-/m1/s1\" }\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-589",
        "domain": "ontospecies",
        "question": "I'm looking for Organophosphates, Other class chemicals that have a polar surface area of 55.8 and an atom stereocenter count around zero but not exceeding one.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue < 1 )\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue = 55.8 )\n  ?Species os:hasChemicalClass/rdfs:label \"Organophosphates, Other\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-121",
        "domain": "ontokin",
        "question": "Which kinetic model corresponds to a chemical reaction producing C12OOH1-3?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C12OOH1-3\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-672",
        "domain": "ontospecies",
        "question": "I'm looking for Deodorizer chemical species with an atom stereocenter count not exceeding 1, about 0.8408 solubility, and an atom chiral count under 3.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue <= 1 )\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue > 0.8408*0.9 && ?SolubilityValue < 0.8408*1.1 )\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue < 3 )\n  ?Species os:hasUse/rdfs:label \"Deodorizer\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-359",
        "domain": "ontospecies",
        "question": "I'm looking for the ChEBI ID of a heteroorganic entity that is also a human metabolite, with an atom chiral undef count not equal to -1 or 1 and having less than 12.100000000000001 hydrogen bond acceptors.",
        "query": {
            "sparql": "SELECT ?ChebiID WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n  ?Species os:hasUse/rdfs:label \"human metabolite\" .\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue < -1 || ?AtomChiralUndefCountValue > 1 )\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue < 12.100000000000001 )\n  ?Species os:hasChebiID ?ChebiID .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-134",
        "domain": "ontokin",
        "question": "What's the kinetic model for a chemical reaction where C11H23O2-3 reacts to produce C8OOH3-4 and C10KET1-1-2, as mentioned on www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C8OOH3-4\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C11H23O2-3\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C10KET1-1-2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-135",
        "domain": "ontokin",
        "question": "What does the kinetic model look like for the chemical equation O2 + H <=> O + OH?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"O2 + H <=> O + OH\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-126",
        "domain": "ontocompchem",
        "question": "What is the HOMO-1 energy of Ti calculated using the cc-pVQZ basis set, specifying the level of theory at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ti\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-178",
        "domain": "ontokin",
        "question": "Can you show me the kinetic model for the reaction where C7H12-3 reacts to form C12H24O7-8-2 according to the source https://doi.org/10.1002/kin.20026?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7H12-3\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C12H24O7-8-2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-191",
        "domain": "ontospecies",
        "question": "Need to find out the melting points of these substances: C18H24O3, C12H11N7, C20H30O6.",
        "query": {
            "sparql": "SELECT ?MeltingPoint WHERE {\n  VALUES ?Species { \"C18H24O3\" \"C12H11N7\" \"C20H30O6\" }\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-454",
        "domain": "ontokin",
        "question": "Can you show me the kinetic model for a chemical reaction producing MS5OOH?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MS5OOH\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-282",
        "domain": "ontospecies",
        "question": "Can you tell me the number of undefined atom stereocenters in both InChI=1S/C4H6O3/c1-3(5)7-4(2)6/h1-2H3 and C18H39N?",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount WHERE {\n  VALUES ?Species { \"InChI=1S/C4H6O3/c1-3(5)7-4(2)6/h1-2H3\" \"C18H39N\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-273",
        "domain": "ontospecies",
        "question": "How many isotope atoms does InChI=1S/C4H8N2S4.Zn/c7-3(8)5-1-2-6-4(9)10;/h1-2H2,(H2,5,7,8)(H2,6,9,10);/q;+2/p-2 have?",
        "query": {
            "sparql": "SELECT ?IsotopeAtomCount WHERE {\n  VALUES ?Species { \"InChI=1S/C4H8N2S4.Zn/c7-3(8)5-1-2-6-4(9)10;/h1-2H2,(H2,5,7,8)(H2,6,9,10);/q;+2/p-2\" }\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-129",
        "domain": "ontospecies",
        "question": "Looking for chemical species with a LogP value less than 0 or more than 1, at least 3 hydrogen bond acceptors, and a boiling point of 548.235 or higher",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue < 0 || ?LogPValue > 1 )\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue >= 3 )\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue >= 548.235 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-33",
        "domain": "ontocompchem",
        "question": "Using M06 level of theory with the cc-pVQZ basis set, what is the zero point energy of HNO?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HNO\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-24",
        "domain": "ontokin",
        "question": "Can you show me the reaction mechanism including these reactions: O + H2O2 <=> HO2 + OH and O + H2 <=> H + OH?",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"O + H2O2 <=> HO2 + OH\" .\n  ?Mechanism okin:hasReaction/okin:hasEquation \"O + H2 <=> H + OH\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-232",
        "domain": "ontokin",
        "question": "What's the kinetic model for the chemical reaction OH + H + M <=> H2O + M?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"OH + H + M <=> H2O + M\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-225",
        "domain": "ontokin",
        "question": "What's the kinetic model for a chemical reaction producing DIBZFUR?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"DIBZFUR\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-966",
        "domain": "ontospecies",
        "question": "I'm looking for aromatic compounds with an atom chiral count less than -1.0 or more than 1.0, and an exact mass that's over 449.75403 but under 550.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue < -1.0 || ?AtomChiralCountValue > 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"aromatic compound\" .\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 449.75403 && ?ExactMassValue < 550 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-158",
        "domain": "ontospecies",
        "question": "Can you tell me the optical rotation for InChI=1S/C12H18N2O4/c1-17-8-3-4-11(18-2)9(5-8)10(15)7-14-12(16)6-13/h3-5,10,15H,6-7,13H2,1-2H3,(H,14,16) and (methylthio)methane?",
        "query": {
            "sparql": "SELECT ?OpticalRotation WHERE {\n  VALUES ?Species { \"InChI=1S/C12H18N2O4/c1-17-8-3-4-11(18-2)9(5-8)10(15)7-14-12(16)6-13/h3-5,10,15H,6-7,13H2,1-2H3,(H,14,16)\" \"(methylthio)methane\" }\n  ?Species os:hasOpticalRotation ?OpticalRotation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-851",
        "domain": "ontospecies",
        "question": "Can you tell me the molecular weight, charge, and number of hydrogen bond donors in C10H15N and 5-hydroxy-2-(hydroxymethyl)pyran-4-one?",
        "query": {
            "sparql": "SELECT ?Charge ?MolecularWeight ?HydrogenBondDonorCount WHERE {\n  VALUES ?Species { \"C10H15N\" \"5-hydroxy-2-(hydroxymethyl)pyran-4-one\" }\n  ?Species os:hasCharge ?Charge .\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-233",
        "domain": "ontocompchem",
        "question": "How to calculate the total enthalpy of Ru using UB3LYP level of theory and the CC-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ru\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-895",
        "domain": "ontospecies",
        "question": "For C16H13ClN2O2, what is its Log S",
        "query": {
            "sparql": "SELECT ?LogS WHERE {\n  VALUES ?Species { \"C16H13ClN2O2\" }\n  ?Species os:hasLogS ?LogS .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-392",
        "domain": "ontocompchem",
        "question": "Can you help me find the total enthalpy, geometry, and LUMO+2 energy of HN3 using the 6-311+G basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy ?OptimizedGeometry ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HN3\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311+G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-94",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species utilized as a pH regulating agent.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"pH regulating agent\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-817",
        "domain": "ontospecies",
        "question": "I need information on the number of hydrogen bond donors, atom chiral def count, and PubChem CID for both CCCOC(=O)Cl and CN(C)C(=S)S.",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount ?AtomChiralDefCount ?CID WHERE {\n  VALUES ?Species { \"CCCOC(=O)Cl\" \"CN(C)C(=S)S\" }\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n  ?Species os:hasCID ?CID .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-196",
        "domain": "ontocompchem",
        "question": "LUMO+2 energy value for Ar across all theory levels?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ar\" .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-147",
        "domain": "ontokin",
        "question": "For the chemical reaction that has product IC5H7, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"IC5H7\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-235",
        "domain": "ontospecies",
        "question": "Looking for the empirical formula of an organohalogen and nitrogen molecule with its mono isotopic weight falling between 223-272.843703.",
        "query": {
            "sparql": "SELECT ?EmpiricalFormula WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 223 && ?MonoIsotopicWeightValue < 272.843703 )\n  ?Species os:hasChemicalClass/rdfs:label \"organohalogen compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"nitrogen molecular entity\" .\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-179",
        "domain": "ontospecies",
        "question": "Looking for Intermediates with a minimum exact mass of 99.033102, flash point near 438.15, ionization potential at least 1.14635736e-18 and function as Photosensitive chemicals.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"Intermediates\" .\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue >= 99.033102 )\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue > 438.15*0.9 && ?FlashPointValue < 438.15*1.1 )\n  ?Species os:hasIonizationPotential/os:value ?IonizationPotentialValue .\n  FILTER ( ?IonizationPotentialValue >= 1.14635736e-18 )\n  ?Species os:hasUse/rdfs:label \"Photosensitive chemicals\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-554",
        "domain": "ontospecies",
        "question": "I need to find out 4-methylpyrocatechol's boiling point and its ChEBI ID.",
        "query": {
            "sparql": "SELECT ?ChebiID ?BoilingPoint WHERE {\n  VALUES ?Species { \"4-methylpyrocatechol\" }\n  ?Species os:hasChebiID ?ChebiID .\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-246",
        "domain": "ontospecies",
        "question": "What are the chemical species whose Caco-2 permeability is bigger than -6 and rotatable bond count is not greater than 6 and heavy atom count is not less than 18.0",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCaco2Permeability/os:value ?Caco2PermeabilityValue .\n  FILTER ( ?Caco2PermeabilityValue > -6 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue <= 6 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue >= 18.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-419",
        "domain": "ontospecies",
        "question": "Can you tell me about the hydrophobicity of 6,6-dimethyl-2-methylidene-bicyclo[3.1.1]heptane and InChI=1S/C7H6Cl2/c1-5-2-3-6(8)4-7(5)9/h2-4H,1H3?",
        "query": {
            "sparql": "SELECT ?Hydrophobicity WHERE {\n  VALUES ?Species { \"6,6-dimethyl-2-methylidene-bicyclo[3.1.1]heptane\" \"InChI=1S/C7H6Cl2/c1-5-2-3-6(8)4-7(5)9/h2-4H,1H3\" }\n  ?Species os:hasHydrophobicity ?Hydrophobicity .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-396",
        "domain": "ontocompchem",
        "question": "I'm looking for the energy values of SLUMO, HOMO-2, and the next-to-highest occupied molecular orbital of N2 when calculated with either the 4-31G or cc-pVDZ basis sets across all theoretical levels. Can you provide this information?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?HOMOMinus1Energy ?HOMOMinus2Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"N2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"4-31G\" \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-31",
        "domain": "ontokin",
        "question": "Can you provide kinetic model for the chemical reaction H + H + H2 <=> H2 + H2?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + H + H2 <=> H2 + H2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-812",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is organic acid and application is cyclooxygenase 2 inhibitor and log P is inside the range (0, 1)",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic acid\" .\n  ?Species os:hasUse/rdfs:label \"cyclooxygenase 2 inhibitor\" .\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue > 0 && ?LogPValue < 1 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-452",
        "domain": "ontokin",
        "question": "Searching for the kinetic model related to a chemical reaction containing the reactant PC7H13OOH-O.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"PC7H13OOH-O\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-718",
        "domain": "ontospecies",
        "question": "Can you tell me the standard enthalpy of formation for C(C(CO)([N+](=O)[O-])Br)O?",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"C(C(CO)([N+](=O)[O-])Br)O\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-736",
        "domain": "ontospecies",
        "question": "Looking for chemical species classified as molecular entity and fall under the classes Other Classes and Toxic Gases & Vapors with no more than 1.1 covalent units.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"Other Classes\" .\n  ?Species os:hasChemicalClass/rdfs:label \"Toxic Gases & Vapors\" .\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue <= 1.1 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-292",
        "domain": "ontocompchem",
        "question": "What's the Gibbs free energy of Md when computed at the M06 level? Please include the basis set used for the calculations.",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Md\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-437",
        "domain": "ontocompchem",
        "question": "How to find cc-pVTZ basis set calculations for rotational constants and total enthalpy of HO2?",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HO2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-392",
        "domain": "ontokin",
        "question": "Can you tell me the number of chemical species involved in the reaction mechanism detailed in https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT (COUNT(?Species) AS ?SpeciesCount) WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-470",
        "domain": "ontocompchem",
        "question": "What is the electronic energy and molecular structure of N2O calculated at the B3LYP level using the 3-21G basis set",
        "query": {
            "sparql": "SELECT ?SCFEnergy ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"N2O\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-382",
        "domain": "ontospecies",
        "question": "Can you tell me the count of hydrogen bond donors in C12H10Cl2Si?",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount WHERE {\n  VALUES ?Species { \"C12H10Cl2Si\" }\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-108",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is chalcogen molecular entity and melting point is = 305.15",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"chalcogen molecular entity\" .\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue = 305.15 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-433",
        "domain": "ontokin",
        "question": "I'm looking for the chemical reaction that uses C7H15-R3 as a reactant and produces C11OOH4-2F and PXC6H13.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7H15-R3\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C11OOH4-2F\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"PXC6H13\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-816",
        "domain": "ontospecies",
        "question": "For C2H6O2 and 1-[2-(dimethylamino)-1-(4-methoxyphenyl)ethyl]cyclohexan-1-ol, what is their isotope atom count",
        "query": {
            "sparql": "SELECT ?IsotopeAtomCount WHERE {\n  VALUES ?Species { \"C2H6O2\" \"1-[2-(dimethylamino)-1-(4-methoxyphenyl)ethyl]cyclohexan-1-ol\" }\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-493",
        "domain": "ontokin",
        "question": "I'm looking for the specific chemical reaction with IC5H11CO as a reactant mentioned in https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"IC5H11CO\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-404",
        "domain": "ontocompchem",
        "question": "What is the HOMO-2 energy of Th calculated using the cc-pVDZ or 6-311G basis set across all level of theory",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Th\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    }
]