[
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-170",
        "domain": "ontokin",
        "question": "Can you tell me the count of chemical reactions associated with the mechanism mentioned in this link https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-270",
        "domain": "ontocompchem",
        "question": "What is the energy of next-to-highest occupied molecular orbital of CN- calculated using the cc-pVTZ or 6-311G basis set across all level of theory",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CN-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVTZ\" \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-353",
        "domain": "ontocompchem",
        "question": "What is the HOMO-1 energy of Rh calculated using the STO-3G basis set",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Rh\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-273",
        "domain": "ontocompchem",
        "question": "What's the HOMO-1 and SLUMO energy along with the geometry of Pd based on the level of theory used in the calculations?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?LUMOPlus1Energy ?OptimizedGeometry ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pd\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-69",
        "domain": "ontospecies",
        "question": "Can you tell me the hydrogen bond acceptors, hashed InChI, and enthalpy of sublimation for InChI=1S/C5H5N5/c6-4-3-5(9-1-7-3)10-2-8-4/h1-2H,(H3,6,7,8,9,10)?",
        "query": {
            "sparql": "SELECT ?HydrogenBondAcceptorCount ?InChIKey ?EnthalpyOfSublimation WHERE {\n  VALUES ?Species { \"InChI=1S/C5H5N5/c6-4-3-5(9-1-7-3)10-2-8-4/h1-2H,(H3,6,7,8,9,10)\" }\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n  ?Species os:hasInChIKey ?InChIKey .\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-331",
        "domain": "ontocompchem",
        "question": "What is the SLUMO energy and total enthalpy of Dy calculated at the M06-2X level of theory",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Dy\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-167",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction H + H + H <=> H2 + H involved in the mechanism found in https://doi.org/10.1016/j.combustflame.2007.10.024",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + H + H <=> H2 + H\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-240",
        "domain": "ontocompchem",
        "question": "Can you tell me about the ground state energy and the energy levels of the lowest unoccupied and highest occupied molecular orbitals for CSi?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LUMOEnergy ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CSi\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-343",
        "domain": "ontocompchem",
        "question": "Can you show me the best geometry for HNO?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HNO\" .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-632",
        "domain": "ontospecies",
        "question": "Can you find chemical species with an undefined bond stereocenter count of approximately 0.0, playing the roles of both hapten and Home Maintenance?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue > -0.1 && ?BondChiralUndefCountValue < 0.1 )\n  ?Species os:hasUse/rdfs:label \"hapten\" .\n  ?Species os:hasUse/rdfs:label \"Home Maintenance\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-548",
        "domain": "ontospecies",
        "question": "I'm looking for the melting point of InChI=1S/C13H12O2/c14-12-5-1-10(2-6-12)9-11-3-7-13(15)8-4-11/h1-8,14-15H,9H2.",
        "query": {
            "sparql": "SELECT ?MeltingPoint WHERE {\n  VALUES ?Species { \"InChI=1S/C13H12O2/c14-12-5-1-10(2-6-12)9-11-3-7-13(15)8-4-11/h1-8,14-15H,9H2\" }\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-557",
        "domain": "ontospecies",
        "question": "What is the PubChem CID and flash point of InChI=1S/C21H26ClN3OS/c22-17-6-7-21-19(16-17)25(18-4-1-2-5-20(18)27-21)9-3-8-23-10-12-24(13-11-23)14-15-26/h1-2,4-7,16,26H,3,8-15H2",
        "query": {
            "sparql": "SELECT ?CID ?FlashPoint WHERE {\n  VALUES ?Species { \"InChI=1S/C21H26ClN3OS/c22-17-6-7-21-19(16-17)25(18-4-1-2-5-20(18)27-21)9-3-8-23-10-12-24(13-11-23)14-15-26/h1-2,4-7,16,26H,3,8-15H2\" }\n  ?Species os:hasCID ?CID .\n  ?Species os:hasFlashPoint ?FlashPoint .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-277",
        "domain": "ontokin",
        "question": "Looking for the specific thermodynamic model of the chemical species in the reaction mechanism on this website www.osti.gov/servlets/purl/90098-26Ev73/webviewable/.",
        "query": {
            "sparql": "SELECT ?ThermoModel WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-210",
        "domain": "ontocompchem",
        "question": "Can you show me the values for HOMO energy and electronic energy for Md?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Md\" .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-256",
        "domain": "ontospecies",
        "question": "Can you tell me the values of monoisotopic mass, viscosity and Henry's law constant of C19H27NO3?",
        "query": {
            "sparql": "SELECT ?MonoIsotopicWeight ?Viscosity ?HenrysLawConstant WHERE {\n  VALUES ?Species { \"C19H27NO3\" }\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n  ?Species os:hasViscosity ?Viscosity .\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-379",
        "domain": "ontocompchem",
        "question": "Looking for information on the HOMO energy and LUMO+2 energy for COS calculated using CCSD(T). What basis set was utilized for the calculations?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?LUMOPlus2Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"COS\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-18",
        "domain": "ontospecies",
        "question": "Can you tell me the logP value for InChI=1S/C7H6O3/c8-6-3-1-5(2-4-6)7(9)10/h1-4,8H,(H,9,10)?",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  VALUES ?Species { \"InChI=1S/C7H6O3/c8-6-3-1-5(2-4-6)7(9)10/h1-4,8H,(H,9,10)\" }\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-18",
        "domain": "ontokin",
        "question": "Can you find the description of a chemical process in https://doi.org/10.1002/kin.20603 where C12OOH2-3O2 is converted into C11H23OO-2-2?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C12OOH2-3O2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C11H23OO-2-2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-57",
        "domain": "ontospecies",
        "question": "What's the chemical structure of (5-chloropiazthiol-4-yl)-(2-imidazolin-2-yl)amine?",
        "query": {
            "sparql": "SELECT ?MolecularFormula WHERE {\n  VALUES ?Species { \"(5-chloropiazthiol-4-yl)-(2-imidazolin-2-yl)amine\" }\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-393",
        "domain": "ontospecies",
        "question": "What are the chemical species whose vapor pressure is inside the range (42236.53200000001, 51622.42800000001) and density is not less than 0.6075 and exact mass is around 73.08915",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue > 42236.53200000001 && ?VaporPressureValue < 51622.42800000001 )\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue >= 0.6075 )\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 73.08915*0.9 && ?ExactMassValue < 73.08915*1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-401",
        "domain": "ontospecies",
        "question": "Can you show me the organic molecular entities with an atom chiral count less than -1.0 or more than 1?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue < -1.0 || ?AtomChiralCountValue > 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-303",
        "domain": "ontospecies",
        "question": "Can you help me find out the ChEBI ID for an entity classified as both an organohalogen compound and a quinolines as well as being part of the class of compounds known ascyclic compounds? It should have over 19 but under 24.200000000000003 non-hydrogen atoms, with its collision cross section not less than 1.59120000000000e-18.",
        "query": {
            "sparql": "SELECT ?ChebiID WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organohalogen compound\" .\n  ?Species os:hasCollisionCrossSection/os:value ?CollisionCrossSectionValue .\n  FILTER ( ?CollisionCrossSectionValue >= 1.5912000000000002e-18 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 19 && ?HeavyAtomCountValue < 24.200000000000003 )\n  ?Species os:hasChemicalClass/rdfs:label \"quinolines\" .\n  ?Species os:hasChemicalClass/rdfs:label \"cyclic compound\" .\n  ?Species os:hasChebiID ?ChebiID .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-102",
        "domain": "ontocompchem",
        "question": "How to determine Kr SCF energy using 6-311G, cc-pVTZ, or STO-2G as basis sets at M06 theory level?",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Kr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" \"cc-pVTZ\" \"STO-2G\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-937",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that belong to the organooxygen compound class, fall under the Pyrethrins/Pyrethroids classification, have a polar surface area less than 53 or more than 65.23, a bond chiral def count above -1 and at least -1 hydrogen bond donors.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organooxygen compound\" .\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue < 53 || ?PolarSurfaceAreaValue > 65.23 )\n  ?Species os:hasChemicalClass/rdfs:label \"Pyrethrins/Pyrethroids\" .\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -1 )\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue >= -1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-925",
        "domain": "ontospecies",
        "question": "How do you classify C4H6O5 and C7H14O in terms of chemistry?",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel WHERE {\n  VALUES ?Species { \"C4H6O5\" \"C7H14O\" }\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-114",
        "domain": "ontocompchem",
        "question": "I'm looking for the optimized geometry for BP using the CCSD(T) theory level and the CC-pVTZ basis set.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BP\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-163",
        "domain": "ontospecies",
        "question": "Need information on the chemical species utilized as plant metabolites.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"plant metabolite\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-569",
        "domain": "ontospecies",
        "question": "For InChI=1S/C8H6O4/c9-7(10)5-3-1-2-4-6(5)8(11)12/h1-4H,(H,9,10)(H,11,12), what is its hydrophobicity and vapor pressure and XLogP3",
        "query": {
            "sparql": "SELECT ?Hydrophobicity ?VaporPressure ?XLogP3 WHERE {\n  VALUES ?Species { \"InChI=1S/C8H6O4/c9-7(10)5-3-1-2-4-6(5)8(11)12/h1-4H,(H,9,10)(H,11,12)\" }\n  ?Species os:hasHydrophobicity ?Hydrophobicity .\n  ?Species os:hasVaporPressure ?VaporPressure .\n  ?Species os:hasXLogP3 ?XLogP3 .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-311",
        "domain": "ontospecies",
        "question": "Search for chemical species that fall under the polyatomic entity category.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-278",
        "domain": "ontocompchem",
        "question": "Can you show me the optimized geometry and energy calculation of the second least occupied molecular orbital in Tm using the M06-2X level theory approach?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-90",
        "domain": "ontospecies",
        "question": "I'm looking for the number of 3-(3-hydroxy-3-oxopropylsulfanyl)propanoic acid's undefined atom stereocenters, can you help?",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount WHERE {\n  VALUES ?Species { \"3-(3-hydroxy-3-oxopropylsulfanyl)propanoic acid\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-106",
        "domain": "ontocompchem",
        "question": "Can you find the LUMO energy and the highest occupied molecular orbital energy for Xe based on the RB3LYP level of theory?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?HOMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Xe\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-967",
        "domain": "ontospecies",
        "question": "Heat of vaporization for chemicals with Log P close to 0.082, approximately nine heavy atom count and greater than four hydrogen bond acceptors?",
        "query": {
            "sparql": "SELECT ?HeatOfVaporization WHERE {\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue > 0.082*0.9 && ?LogPValue < 0.082*1.1 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 9.0*0.9 && ?HeavyAtomCountValue < 9.0*1.1 )\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue > 4 )\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-97",
        "domain": "ontospecies",
        "question": "What is the hashed InChI of CCCCCCCCCC1=CC=C(C=C1)O",
        "query": {
            "sparql": "SELECT ?InChIKey WHERE {\n  VALUES ?Species { \"CCCCCCCCCC1=CC=C(C=C1)O\" }\n  ?Species os:hasInChIKey ?InChIKey .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-917",
        "domain": "ontospecies",
        "question": "Need to find out how dense C4H11N is in its vapor state.",
        "query": {
            "sparql": "SELECT ?VaporDensity WHERE {\n  VALUES ?Species { \"C4H11N\" }\n  ?Species os:hasVaporDensity ?VaporDensity .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-269",
        "domain": "ontospecies",
        "question": "Looking for information on the bond chiral count and vapor density of InChI=1S/C9H8O2/c10-9-6-5-7-3-1-2-4-8(7)11-9/h1-4H,5-6H2 and CCCCCCCCCCCCCCCCO.",
        "query": {
            "sparql": "SELECT ?VaporDensity ?BondChiralCount WHERE {\n  VALUES ?Species { \"InChI=1S/C9H8O2/c10-9-6-5-7-3-1-2-4-8(7)11-9/h1-4H,5-6H2\" \"CCCCCCCCCCCCCCCCO\" }\n  ?Species os:hasVaporDensity ?VaporDensity .\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-198",
        "domain": "ontospecies",
        "question": "Looking for information on the purpose and surface tension of chemical species that have a mass equal to or exceeding 63.",
        "query": {
            "sparql": "SELECT ?UseLabel ?SurfaceTension WHERE {\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue >= 63 )\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-95",
        "domain": "ontospecies",
        "question": "I'm trying to find out the total number of tautomers for 2-(diethylamino)ethanol.",
        "query": {
            "sparql": "SELECT ?TautomerCount WHERE {\n  VALUES ?Species { \"2-(diethylamino)ethanol\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-153",
        "domain": "ontocompchem",
        "question": "Can you tell me the energy of the BF3 molecule's lowest unoccupied molecular orbital calculated with the PM6 method using either the cc-pVQZ or 6-311G basis set?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BF3\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-253",
        "domain": "ontocompchem",
        "question": "I need to find out the optimized geometry for Er. What level of theory and basis set were the calculations performed at?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Er\" .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-125",
        "domain": "ontospecies",
        "question": "Can you tell me the number of hydrogen bond donors in an organochlorine compound that has a surface tension exactly equal to 0.005?",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount WHERE {\n  ?Species os:hasSurfaceTension/os:value ?SurfaceTensionValue .\n  FILTER ( ?SurfaceTensionValue = 0.005 )\n  ?Species os:hasChemicalClass/rdfs:label \"organochlorine compound\" .\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-399",
        "domain": "ontokin",
        "question": "I need to understand the kinetic model of a chemical reaction with B2E2M1OJ as a reactant.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"B2E2M1OJ\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-35",
        "domain": "ontospecies",
        "question": "What is the isoelectric point and number of covalent units and PubChem CID of the chemical species whose molecular mass is outside the range (357.75, 438)",
        "query": {
            "sparql": "SELECT ?IsoelectricPoint ?CovalentUnitCount ?CID WHERE {\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue < 357.75 || ?MolecularWeightValue > 438 )\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n  ?Species os:hasCovalentUnitCount ?CovalentUnitCount .\n  ?Species os:hasCID ?CID .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-47",
        "domain": "ontocompchem",
        "question": "When using the PM6 method, what are the calculated values for the Gibbs free energy, NHOMO energy, and total energy of Pr? What basis set is used?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?HOMOMinus1Energy ?TotalEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-482",
        "domain": "ontospecies",
        "question": "Can you find the molecular formula for a chemical substance with a logP value less than 2.3980000000000006 and around 2.18?",
        "query": {
            "sparql": "SELECT ?MolecularFormula WHERE {\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue > 2.18*0.9 && ?LogPValue < 2.18*1.1 )\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-711",
        "domain": "ontospecies",
        "question": "Looking for the number of hydrogen bond donors in COC(=O)C1=CC=CC=C1N and its standard enthalpy of formation.",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"COC(=O)C1=CC=CC=C1N\" }\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-320",
        "domain": "ontokin",
        "question": "I'm looking for the chemical equation that uses MH3OXO5D as a reactant and produces PX10-5C10H19 and C12KET11-9-2.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"PX10-5C10H19\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C12KET11-9-2\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MH3OXO5D\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-200",
        "domain": "ontokin",
        "question": "Could you show me the kinetic model of the chemical reaction O + HO2 <=> OH + O2 as detailed in this paper https://doi.org/10.1002/kin.20026?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"O + HO2 <=> OH + O2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-340",
        "domain": "ontocompchem",
        "question": "Can you find the rotational constants for Rn considering a specific basis set?",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Rn\" .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-58",
        "domain": "ontocompchem",
        "question": "What is the total energy of BH3 calculated at the RB3LYP level of theory using the 3-21G or STO-2G or CC-pVQZ basis set",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BH3\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" \"STO-2G\" \"CC-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    }
]