[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-942",
        "domain": "ontospecies",
        "question": "What's the collision cross section of NO?",
        "query": {
            "sparql": "SELECT ?CollisionCrossSection WHERE {\n  VALUES ?Species { \"NO\" }\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-806",
        "domain": "ontospecies",
        "question": "Optical rotation, Henry's law constant, and exact mass of CC1=CC2=C(C=C1C)N(C3=NC(=O)NC(=O)C3=N2)CC(C(C(CO)O)O)O",
        "query": {
            "sparql": "SELECT ?OpticalRotation ?HenrysLawConstant ?ExactMass WHERE {\n  VALUES ?Species { \"CC1=CC2=C(C=C1C)N(C3=NC(=O)NC(=O)C3=N2)CC(C(C(CO)O)O)O\" }\n  ?Species os:hasOpticalRotation ?OpticalRotation .\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n  ?Species os:hasExactMass ?ExactMass .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-180",
        "domain": "ontospecies",
        "question": "Can you help me find any Halogenated Aliphatics, Unsaturated chemical species that meet these criteria: monoisotopic mass >= 68.407182; number of hydrogen bond acceptors < 1; defined atom stereocenter count <=1; heavy atom count >3; and covalent unit count >0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue >= 68.407182 )\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue < 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"Halogenated Aliphatics, Unsaturated\" .\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue <= 1 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 3 )\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue > 0 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-512",
        "domain": "ontokin",
        "question": "Can you find all the chemical reactions producing C5H11COC2H4CHO and using PHNTHROXY-9 as a reactant from this specific mechanism detailed in https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C5H11COC2H4CHO\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"PHNTHROXY-9\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-511",
        "domain": "ontospecies",
        "question": "I'm looking for antiseptic drugs from the benzenoid aromatic compound class with a hydrogen bond donor count in the range of 0.9 to 1.1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"benzenoid aromatic compound\" .\n  ?Species os:hasUse/rdfs:label \"antiseptic drug\" .\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue > 0.9 && ?HydrogenBondDonorCountValue < 1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-43",
        "domain": "ontospecies",
        "question": "Which chemical species have a monoisotopic weight below 158.42059200000003, density of at least 1350, and are applied as both Finishing agents and inhibitors of EC 1.13.11.33 (arachidonate 15-lipoxygenase)?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue < 158.42059200000003 )\n  ?Species os:hasUse/rdfs:label \"Finishing agents\" .\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue >= 1350 )\n  ?Species os:hasUse/rdfs:label \"EC 1.13.11.33 (arachidonate 15-lipoxygenase) inhibitor\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-140",
        "domain": "ontospecies",
        "question": "Searching for chemical species from the Other Insecticides class having an XLogP3 of less than 0.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value < 0 )\n  ?Species os:hasChemicalClass/rdfs:label \"Other Insecticides\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-191",
        "domain": "ontocompchem",
        "question": "I'm looking for the energy of the highest occupied molecular orbital for FH calculated using B3LYP methodology with the 6-311G or aug-cc-pVDZ basis set.",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"FH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" \"aug-cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-43",
        "domain": "ontokin",
        "question": "Looking for a chemical reaction where the reactants are MDCY905O and ISO11 and the products are N2H3 and PX9-3C9H17.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"N2H3\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDCY905O\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"PX9-3C9H17\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"ISO11\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-771",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that belong to the carbon group molecular entity class?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carbon group molecular entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-758",
        "domain": "ontospecies",
        "question": "What are the chemical species whose monoisotopic weight is greater than or equal to 133 and bond chiral def count is higher than -1",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue >= 133 )\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-259",
        "domain": "ontospecies",
        "question": "I'm looking for organic molecular entity chemical species with nearly zero hydrogen bond donors and a charge below 1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue > -0.1 && ?HydrogenBondDonorCountValue < 0.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue < 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-434",
        "domain": "ontospecies",
        "question": "What are the chemical species whose autoignition temperature is greater than or equal to 722 and atom chiral undef count is approximately 0.0 and vapor density is approximately 4.7 and XLogP3 is higher than 1",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAutoignitionTemperature/os:value ?AutoignitionTemperatureValue .\n  FILTER ( ?AutoignitionTemperatureValue >= 722 )\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue > -0.1 && ?AtomChiralUndefCountValue < 0.1 )\n  ?Species os:hasVaporDensity/os:value ?VaporDensityValue .\n  FILTER ( ?VaporDensityValue > 4.7*0.9 && ?VaporDensityValue < 4.7*1.1 )\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value > 1 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-318",
        "domain": "ontocompchem",
        "question": "What is the molecular structure of Cl2",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cl2\" .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-15",
        "domain": "ontocompchem",
        "question": "What is the energy of Pu calculated using the STO-6G basis set",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-368",
        "domain": "ontokin",
        "question": "Show me the chemical reaction in which NC12-OOQOOH and DMM3BOOH interact to produce C12OOH10-2H as cited on the webpage www.osti.gov/servlets/purl/90098-26Ev73/webviewable/.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"NC12-OOQOOH\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C12OOH10-2H\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"DMM3BOOH\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-532",
        "domain": "ontospecies",
        "question": "What is the covalent unit count of bis(bromanyl)methane",
        "query": {
            "sparql": "SELECT ?CovalentUnitCount WHERE {\n  VALUES ?Species { \"bis(bromanyl)methane\" }\n  ?Species os:hasCovalentUnitCount ?CovalentUnitCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-735",
        "domain": "ontospecies",
        "question": "SMILES and number of rotatable bonds in C9H8O4 and C14H30O",
        "query": {
            "sparql": "SELECT ?SMILES ?RotatableBondCount WHERE {\n  VALUES ?Species { \"C9H8O4\" \"C14H30O\" }\n  ?Species os:hasSMILES ?SMILES .\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-225",
        "domain": "ontocompchem",
        "question": "What is the LUMO+2 energy of Am calculated using the cc-pVDZ or STO-6G basis set",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Am\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-5",
        "domain": "ontokin",
        "question": "Show me the reaction that transforms C7H15O2-P4 and MBKET23O into MB3JOH4.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MB3JOH4\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7H15O2-P4\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MBKET23O\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-281",
        "domain": "ontocompchem",
        "question": "What is the rotational constants of Cu calculated at the PBE0 level using the aug-cc-pVDZ basis set",
        "query": {
            "sparql": "SELECT ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-155",
        "domain": "ontokin",
        "question": "I'm looking for the mechanism of a chemical reaction that includes C12OOH2-2E.",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"C12OOH2-2E\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-744",
        "domain": "ontospecies",
        "question": "Can you tell me the standard formation enthalpy for both C1=CC=C2C(=C1)C=CC3=C2C=CC4=CC=CC=C43 and C1COC(=O)O1?",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"C1=CC=C2C(=C1)C=CC3=C2C=CC4=CC=CC=C43\" \"C1COC(=O)O1\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-284",
        "domain": "ontokin",
        "question": "Can you show me the chemical reaction involving DMF as a reactant and CH3OCHOCHO and CH2OH as products according to the mechanism shown on the page https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"DMF\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"CH3OCHOCHO\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"CH2OH\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-391",
        "domain": "ontospecies",
        "question": "Can you tell me about the surface tension, flash point, and mono isotopic weight of C10H14O and InChI=1S/COS/c2-1-3?",
        "query": {
            "sparql": "SELECT ?SurfaceTension ?FlashPoint ?MonoIsotopicWeight WHERE {\n  VALUES ?Species { \"C10H14O\" \"InChI=1S/COS/c2-1-3\" }\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n  ?Species os:hasFlashPoint ?FlashPoint .\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-255",
        "domain": "ontocompchem",
        "question": "Can you find the energy level for the lowest unoccupied molecular orbital of Tc when calculated with a aug-cc-pVQZ basis set?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tc\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-441",
        "domain": "ontospecies",
        "question": "Need info on a chemical: it has an undefined stereo center count between -1 to +1, more than 0.9 rotatable bonds; specifically need its IUPAC name, exact mass & hydrogen donor counts.",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount ?ExactMass ?IUPACName WHERE {\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue > -1.0 && ?BondChiralUndefCountValue < 1.0 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue > 0.9 )\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n  ?Species os:hasExactMass ?ExactMass .\n  ?Species os:hasIUPACName ?IUPACName .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-210",
        "domain": "ontokin",
        "question": "I'm looking for the specific chemical species in the reaction mechanism from this article https://doi.org/10.1016/j.combustflame.2007.10.024, can you help?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-36",
        "domain": "ontocompchem",
        "question": "Can you find the calculation of SLUMO energy for CHN based on B3LYP theory level and STO-6G basis set?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CHN\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-110",
        "domain": "ontocompchem",
        "question": "I need to know the geometry of Ce calculated with a given basis set.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ce\" .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-968",
        "domain": "ontospecies",
        "question": "Can you tell me how soluble 1,5,7,8,9,10,10-heptakis(chloranyl)tricyclo[5.2.1.02,6]deca-3,8-diene is?",
        "query": {
            "sparql": "SELECT ?Solubility WHERE {\n  VALUES ?Species { \"1,5,7,8,9,10,10-heptakis(chloranyl)tricyclo[5.2.1.02,6]deca-3,8-diene\" }\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-181",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has reactant MN7OXO4J",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MN7OXO4J\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-75",
        "domain": "ontokin",
        "question": "Can you explain the kinetic model for the chemical reaction O + O + M = O2 + M?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"O + O + M = O2 + M\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-39",
        "domain": "ontokin",
        "question": "Explain the process of MDCY58-7 transport in all its associated reaction mechanisms.",
        "query": {
            "sparql": "SELECT ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"MDCY58-7\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-461",
        "domain": "ontospecies",
        "question": "I need to know the number of chiral bonds present in a C6H4N2O5 molecule.",
        "query": {
            "sparql": "SELECT ?BondChiralCount WHERE {\n  VALUES ?Species { \"C6H4N2O5\" }\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-83",
        "domain": "ontospecies",
        "question": "Can you tell me the empirical formulas for C1(=C(C(=O)C(=C(C1=O)Cl)Cl)Cl)Cl, 2-chloro-N-phenyl-N-propan-2-ylacetamide, and C1=CC(=CC=C1C(=O)O)N?",
        "query": {
            "sparql": "SELECT ?EmpiricalFormula WHERE {\n  VALUES ?Species { \"C1(=C(C(=O)C(=C(C1=O)Cl)Cl)Cl)Cl\" \"2-chloro-N-phenyl-N-propan-2-ylacetamide\" \"C1=CC(=CC=C1C(=O)O)N\" }\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-107",
        "domain": "ontocompchem",
        "question": "I'm searching for the highest occupied molecular orbital's energy and optimal geometry for CO2 using the B3LYP theory level and STO-3G basis set.",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CO2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-845",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is polyatomic entity and chemical class is molecular entity and collision cross section is lower than 1.6677000000000002e-18 or > 2.0383e-18 and chemical class is cyclic compound and chemical classification is organic molecular entity and heavy atom count is less than 28",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n  ?Species os:hasCollisionCrossSection/os:value ?CollisionCrossSectionValue .\n  FILTER ( ?CollisionCrossSectionValue < 1.6677000000000002e-18 || ?CollisionCrossSectionValue > 2.0383e-18 )\n  ?Species os:hasChemicalClass/rdfs:label \"cyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue < 28 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-696",
        "domain": "ontospecies",
        "question": "I'm looking for the quantity of covalent units contained in a molecule of C12H12N2O3.",
        "query": {
            "sparql": "SELECT ?CovalentUnitCount WHERE {\n  VALUES ?Species { \"C12H12N2O3\" }\n  ?Species os:hasCovalentUnitCount ?CovalentUnitCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-65",
        "domain": "ontospecies",
        "question": "What is the atom stereocenter count and dissociation constants and boiling point of <I>N</I>-pentylpentan-1-amine and C32H31BrN2O2 and C3H6N6",
        "query": {
            "sparql": "SELECT ?AtomChiralCount ?DissociationConstants ?BoilingPoint WHERE {\n  VALUES ?Species { \"<I>N</I>-pentylpentan-1-amine\" \"C32H31BrN2O2\" \"C3H6N6\" }\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-965",
        "domain": "ontospecies",
        "question": "What are the chemical species whose heavy atom count is inside the range (5.4, 7)",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 5.4 && ?HeavyAtomCountValue < 7 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-40",
        "domain": "ontospecies",
        "question": "What are the chemical species whose compound complexity is < 362.7 or > 443.3 and charge is bigger than -1 and lower than 1",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue < 362.7 || ?CompoundComplexityValue > 443.3 )\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -1 && ?ChargeValue < 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-573",
        "domain": "ontospecies",
        "question": "How many stereocenters does C1=CC(=CC=C1N)S(=O)(=O)O have?",
        "query": {
            "sparql": "SELECT ?AtomChiralCount WHERE {\n  VALUES ?Species { \"C1=CC(=CC=C1N)S(=O)(=O)O\" }\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-186",
        "domain": "ontocompchem",
        "question": "What is the total Gibbs free energy of Cd calculated at the B3LYP level of theory",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-80",
        "domain": "ontospecies",
        "question": "What's the empirical formula for a chemical species with a solubility of 0 or higher?",
        "query": {
            "sparql": "SELECT ?EmpiricalFormula WHERE {\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue >= 0 )\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-496",
        "domain": "ontokin",
        "question": "Could you help me find the thermodynamic model and transport model for the chemical species involved in the reaction mechanism detailed in this study https://doi.org/10.1002/kin.20026?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?TransportModel WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-345",
        "domain": "ontocompchem",
        "question": "I'm looking for the LUMO energy of Lu when computed at the M06 level of theory across every basis set. Can you help?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Lu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-345",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction H + H2O2 = HO2 + H2",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + H2O2 = HO2 + H2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-770",
        "domain": "ontospecies",
        "question": "Can you find the autoignition temperature and number of isotopes for a hydrogen molecular entity that has over 8.1 atoms that aren't hydrogen?",
        "query": {
            "sparql": "SELECT ?AutoignitionTemperature ?IsotopeAtomCount WHERE {\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 8.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"hydrogen molecular entity\" .\n  ?Species os:hasAutoignitionTemperature ?AutoignitionTemperature .\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-493",
        "domain": "ontocompchem",
        "question": "Information on the frequencies, geometry, and zero point energy of F2O at the PBE0 level using the STO-4G basis set please.",
        "query": {
            "sparql": "SELECT ?Frequencies ?ZeroPointEnergy ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F2O\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-724",
        "domain": "ontospecies",
        "question": "What's the purpose of C7H14O3 and InChI=1S/C12H24O11/c13-1-4(16)7(18)11(5(17)2-14)23-12-10(21)9(20)8(19)6(3-15)22-12/h4-21H,1-3H2/t4-,5+,6+,7+,8+,9-,10+,11+,12+/m0/s1, their IUPAC International Chemical Identifier, and Henry's law constant?",
        "query": {
            "sparql": "SELECT ?UseLabel ?InChI ?HenrysLawConstant WHERE {\n  VALUES ?Species { \"C7H14O3\" \"InChI=1S/C12H24O11/c13-1-4(16)7(18)11(5(17)2-14)23-12-10(21)9(20)8(19)6(3-15)22-12/h4-21H,1-3H2/t4-,5+,6+,7+,8+,9-,10+,11+,12+/m0/s1\" }\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n  ?Species os:hasInChI ?InChI .\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-6",
        "domain": "ontokin",
        "question": "For the chemical reaction that has product C10H20-2, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C10H20-2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    }
]