[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-820",
        "domain": "ontospecies",
        "question": "Can you provide me with the number of isotope atoms, PubChem Compound IDs and defined atom stereocenter counts for C11H15NO3, CCCCCCCCCCCCCCCCCC, and C1C(COC1(CN2C=NC=N2)C3=C(C=C(C=C3)Cl)Cl)Br?",
        "query": {
            "sparql": "SELECT ?IsotopeAtomCount ?CID ?AtomChiralDefCount WHERE {\n  VALUES ?Species { \"C11H15NO3\" \"CCCCCCCCCCCCCCCCCC\" \"C1C(COC1(CN2C=NC=N2)C3=C(C=C(C=C3)Cl)Cl)Br\" }\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n  ?Species os:hasCID ?CID .\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-202",
        "domain": "ontospecies",
        "question": "For CCC(Cl)Cl, what is its number of tautomers and hashed InChI and solubility",
        "query": {
            "sparql": "SELECT ?TautomerCount ?InChIKey ?Solubility WHERE {\n  VALUES ?Species { \"CCC(Cl)Cl\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n  ?Species os:hasInChIKey ?InChIKey .\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-323",
        "domain": "ontospecies",
        "question": "Need to know the IUPAC name for a chemical species classified as heteromonocyclic compound and having almost no charge.",
        "query": {
            "sparql": "SELECT ?IUPACName WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -0.1 && ?ChargeValue < 0.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"heteromonocyclic compound\" .\n  ?Species os:hasIUPACName ?IUPACName .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-385",
        "domain": "ontokin",
        "question": "What's the specific chemical reaction using C12OOH8OO10-2 as a reactant talked about in https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C12OOH8OO10-2\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-121",
        "domain": "ontocompchem",
        "question": "What is the SLUMO energy of HO2 across all basis set",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HO2\" .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-996",
        "domain": "ontospecies",
        "question": "I need to find out about the chemical species which are classified as both an oxygen molecular entity and an ether, do not have their chiral atom count within -1.0 to 1.0, and also have a bond stereocenter count of exactly 0.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue < -1.0 || ?AtomChiralCountValue > 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"oxygen molecular entity\" .\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue = 0.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"ether\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-298",
        "domain": "ontospecies",
        "question": "I'm searching for information on (2S)-2-amino-3-methyl-butanoic acid's vapor pressure, can you help?",
        "query": {
            "sparql": "SELECT ?VaporPressure WHERE {\n  VALUES ?Species { \"(2S)-2-amino-3-methyl-butanoic acid\" }\n  ?Species os:hasVaporPressure ?VaporPressure .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-962",
        "domain": "ontospecies",
        "question": "Need to find out how viscous InChI=1S/C18H19NO3/c1-19-8-7-18-11-4-6-14(21-2)17(18)22-16-13(20)5-3-10(15(16)18)9-12(11)19/h3-6,12,17,20H,7-9H2,1-2H3/t12-,17+,18+/m1/s1 is.",
        "query": {
            "sparql": "SELECT ?Viscosity WHERE {\n  VALUES ?Species { \"InChI=1S/C18H19NO3/c1-19-8-7-18-11-4-6-14(21-2)17(18)22-16-13(20)5-3-10(15(16)18)9-12(11)19/h3-6,12,17,20H,7-9H2,1-2H3/t12-,17+,18+/m1/s1\" }\n  ?Species os:hasViscosity ?Viscosity .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-943",
        "domain": "ontospecies",
        "question": "Search for chemical species with an atom chiral undef count greater than -1 but less than 1, a rotatable bond count under 4, a density between 810.0 and 991, and a charge close to zero.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue > -1 && ?AtomChiralUndefCountValue < 1 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue < 4 )\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue > 810.0 && ?DensityValue < 991 )\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -0.1 && ?ChargeValue < 0.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-961",
        "domain": "ontospecies",
        "question": "What are the chemical species whose isotope atom count is lower than 1 and role is environmental contaminant and chemical class is carbon group molecular entity and polar surface area is outside the range (18, 23) and chemical classification is organic aromatic compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue < 1 )\n  ?Species os:hasUse/rdfs:label \"environmental contaminant\" .\n  ?Species os:hasChemicalClass/rdfs:label \"carbon group molecular entity\" .\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue < 18 || ?PolarSurfaceAreaValue > 23 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic aromatic compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-427",
        "domain": "ontospecies",
        "question": "Can you tell me about the solubility of C=CCN=C=S?",
        "query": {
            "sparql": "SELECT ?Solubility WHERE {\n  VALUES ?Species { \"C=CCN=C=S\" }\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-417",
        "domain": "ontospecies",
        "question": "Can you tell me the molecular formula and Log P value for C9H10?",
        "query": {
            "sparql": "SELECT ?MolecularFormula ?LogP WHERE {\n  VALUES ?Species { \"C9H10\" }\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-461",
        "domain": "ontocompchem",
        "question": "Could you find out the electronic energy, total energy and rotational constants associated with F-?",
        "query": {
            "sparql": "SELECT ?SCFEnergy ?TotalEnergy ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F-\" .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-320",
        "domain": "ontospecies",
        "question": "For the chemical species whose role is Auto Products and atom chiral count is inside the range (-1, 1.0) and vapor pressure is < 451 or higher than 551.4213980000001, what is its defined atom stereocenter count",
        "query": {
            "sparql": "SELECT ?AtomChiralDefCount WHERE {\n  ?Species os:hasUse/rdfs:label \"Auto Products\" .\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue > -1 && ?AtomChiralCountValue < 1.0 )\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue < 451 || ?VaporPressureValue > 551.4213980000001 )\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-988",
        "domain": "ontospecies",
        "question": "What's the LogS value for C1=CC=C(C(=C1)C(=O)O)O and InChI=1S/C18H12/c1-2-7-15-12-18-16(11-14(15)6-1)10-9-13-5-3-4-8-17(13)18/h1-12H?",
        "query": {
            "sparql": "SELECT ?LogS WHERE {\n  VALUES ?Species { \"C1=CC=C(C(=C1)C(=O)O)O\" \"InChI=1S/C18H12/c1-2-7-15-12-18-16(11-14(15)6-1)10-9-13-5-3-4-8-17(13)18/h1-12H\" }\n  ?Species os:hasLogS ?LogS .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-281",
        "domain": "ontokin",
        "question": "Which chemical reactions result in MNKET85O?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MNKET85O\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-661",
        "domain": "ontospecies",
        "question": "I'm looking for information on the dissociation constants, vapor pressure, and ionization potential for C3H4N2.",
        "query": {
            "sparql": "SELECT ?DissociationConstants ?VaporPressure ?IonizationPotential WHERE {\n  VALUES ?Species { \"C3H4N2\" }\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n  ?Species os:hasVaporPressure ?VaporPressure .\n  ?Species os:hasIonizationPotential ?IonizationPotential .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-157",
        "domain": "ontokin",
        "question": "Looking for the kinetic model related to the H2 + O <=> OH + H chemical reaction.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2 + O <=> OH + H\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-183",
        "domain": "ontocompchem",
        "question": "Could you provide me with the calculated ground state energy of the molecule H2 using basis set CC-pVTZ as per all theory levels?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ac\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-732",
        "domain": "ontospecies",
        "question": "What's the charge of C21H23ClFNO2 and C18H10?",
        "query": {
            "sparql": "SELECT ?Charge WHERE {\n  VALUES ?Species { \"C21H23ClFNO2\" \"C18H10\" }\n  ?Species os:hasCharge ?Charge .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-272",
        "domain": "ontospecies",
        "question": "What are the chemical species whose collision cross section is greater than 1.1493000000000001e-18 and less than 1 and XLOGP3 is > 3.51",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCollisionCrossSection/os:value ?CollisionCrossSectionValue .\n  FILTER ( ?CollisionCrossSectionValue > 1.1493000000000001e-18 && ?CollisionCrossSectionValue < 1 )\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value > 3.51 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-134",
        "domain": "ontocompchem",
        "question": "What is the HOMO-2 energy of ClH calculated using the CC-pVTZ basis set, specifying the level of theory at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-411",
        "domain": "ontocompchem",
        "question": "I need info on the Rh molecule's structure spanning all theory levels and basis sets.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Rh\" .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-96",
        "domain": "ontocompchem",
        "question": "Can I find the LUMO+2 energy for CS2 using the UB3LYP theoretical model?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CS2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-65",
        "domain": "ontokin",
        "question": "Can you provide information on chemical reactions involving MD5D10J as a reactant?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD5D10J\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-426",
        "domain": "ontospecies",
        "question": "Can you tell me the quantity of atoms in C[C@]12CC[C@H]3[C@H]([C@@H]1CCC2=O)CCC4=C3C=CC(=C4)O that are not hydrogen?",
        "query": {
            "sparql": "SELECT ?HeavyAtomCount WHERE {\n  VALUES ?Species { \"C[C@]12CC[C@H]3[C@H]([C@@H]1CCC2=O)CCC4=C3C=CC(=C4)O\" }\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-290",
        "domain": "ontocompchem",
        "question": "Can you help me find the ground state energy of an Xe according to the 3-21G basis set while maintaining the level of theory in the calculations?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Xe\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-688",
        "domain": "ontospecies",
        "question": "Looking for details on the bond stereocenter count and surface tension of 1-(2-oxidanylpropoxy)propan-2-ol, 1,6-diisocyanatohexane, and molecular chlorine.",
        "query": {
            "sparql": "SELECT ?SurfaceTension ?BondChiralDefCount WHERE {\n  VALUES ?Species { \"1-(2-oxidanylpropoxy)propan-2-ol\" \"1,6-diisocyanatohexane\" \"molecular chlorine\" }\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n  ?Species os:hasBondChiralDefCount ?BondChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-0",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that belong to the chalcogen molecular entity class?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"chalcogen molecular entity\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-20",
        "domain": "ontokin",
        "question": "Can you show me a chemical reaction where the final product is CY7810J?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"CY7810J\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-751",
        "domain": "ontospecies",
        "question": "What's the boiling point and Log S for InChI=1S/C22H42O4/c1-5-9-13-19(7-3)17-25-21(23)15-11-12-16-22(24)26-18-20(8-4)14-10-6-2/h19-20H,5-18H2,1-4H3?",
        "query": {
            "sparql": "SELECT ?BoilingPoint ?LogS WHERE {\n  VALUES ?Species { \"InChI=1S/C22H42O4/c1-5-9-13-19(7-3)17-25-21(23)15-11-12-16-22(24)26-18-20(8-4)14-10-6-2/h19-20H,5-18H2,1-4H3\" }\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n  ?Species os:hasLogS ?LogS .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-221",
        "domain": "ontokin",
        "question": "Can you provide details on the thermodynamic and transport model for CY568JA across various reaction mechanisms?",
        "query": {
            "sparql": "SELECT ?TransportModel ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"CY568JA\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-15",
        "domain": "ontokin",
        "question": "How many chemical reaction that has reactant C6H111O2-5 and is involved in the mechanism found in https://doi.org/10.1016/j.combustflame.2007.10.024 and has product NEOC5H11CO and has reactant C2H4O1,2",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C6H111O2-5\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"NEOC5H11CO\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C2H4O1,2\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-509",
        "domain": "ontokin",
        "question": "Looking for the specific chemical reaction producing NC8KET32O described in the article found here: https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"NC8KET32O\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-426",
        "domain": "ontokin",
        "question": "Looking for information on transport and thermodynamic models used in reaction mechanisms involving MNDIOXO89.",
        "query": {
            "sparql": "SELECT ?TransportModel ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"MNDIOXO89\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-819",
        "domain": "ontospecies",
        "question": "Can you tell me about the uses of lepidine?",
        "query": {
            "sparql": "SELECT ?UseLabel WHERE {\n  VALUES ?Species { \"lepidine\" }\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-464",
        "domain": "ontospecies",
        "question": "For COC1=CC(=CC(=C1OC)OC)CC2=CN=C(N=C2N)N and 2-methyl-1-phenyl-propan-2-amine and InChI=1S/C5H10O/c1-2-4-6-5-3-1/h1-5H2, what is their atom chiral def count and chemical classification and standard enthalpy of formation",
        "query": {
            "sparql": "SELECT ?AtomChiralDefCount ?ChemicalClassLabel ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"COC1=CC(=CC(=C1OC)OC)CC2=CN=C(N=C2N)N\" \"2-methyl-1-phenyl-propan-2-amine\" \"InChI=1S/C5H10O/c1-2-4-6-5-3-1/h1-5H2\" }\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-351",
        "domain": "ontokin",
        "question": "I'm looking for the reaction mechanism involving PX1-3C8H15 and MD9DKET74.",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"PX1-3C8H15\" .\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"MD9DKET74\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-54",
        "domain": "ontocompchem",
        "question": "Can you tell me the highest energy level of molecular orbitals in Cr and its zero-point energy as calculated with the CC-pVDZ basis set? I'm also curious about the theory level used for these calculations.",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?ZeroPointEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-747",
        "domain": "ontospecies",
        "question": "Looking for information on the chemical class and charge of phosphoric acid tris(2-chloroethyl) ester, also need its ChEBI ID.",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel ?Charge ?ChebiID WHERE {\n  VALUES ?Species { \"phosphoric acid tris(2-chloroethyl) ester\" }\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n  ?Species os:hasCharge ?Charge .\n  ?Species os:hasChebiID ?ChebiID .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-345",
        "domain": "ontospecies",
        "question": "For m-anisidine and C4H8O2, what is their exact mass",
        "query": {
            "sparql": "SELECT ?ExactMass WHERE {\n  VALUES ?Species { \"m-anisidine\" \"C4H8O2\" }\n  ?Species os:hasExactMass ?ExactMass .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-65",
        "domain": "ontocompchem",
        "question": "I'm looking for the total enthalpy of Pu that has been calculated at the B3LYP level of theory with the use of 3-21G basis set.",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-691",
        "domain": "ontospecies",
        "question": "What chemical entities are considered metabolites?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"metabolite\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-132",
        "domain": "ontospecies",
        "question": "Find me any chemical compounds that have a bond stereocenter count of greater than -1, but their melting point doesn't exceed 238.425 degrees.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > -1 )\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue <= 238.425 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-66",
        "domain": "ontocompchem",
        "question": "What is the rotational constants of Ne",
        "query": {
            "sparql": "SELECT ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ne\" .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-138",
        "domain": "ontokin",
        "question": "Can you explain the reaction mechanism involving MD59D3J?",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"MD59D3J\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-159",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that act as environmental contaminant?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"environmental contaminant\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-403",
        "domain": "ontocompchem",
        "question": "Could you provide information on the total Gibbs free energy and molecular arrangement of Pd for all levels of theory and basis sets?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?OptimizedGeometry ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pd\" .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-171",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that are both an aromatic ether and a heteroorganic entity, also their compound complexity should be under 148.5.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"aromatic ether\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue < 148.5 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-245",
        "domain": "ontospecies",
        "question": "Can I find out the values of Henry's law constant, boiling point, and enthalpy of sublimation for a chemical species that has nearly 1.0 in atom chiral undef count and close to zero charge?",
        "query": {
            "sparql": "SELECT ?HenrysLawConstant ?BoilingPoint ?EnthalpyOfSublimation WHERE {\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue > 1.0*0.9 && ?AtomChiralUndefCountValue < 1.0*1.1 )\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -0.1 && ?ChargeValue < 0.1 )\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-989",
        "domain": "ontospecies",
        "question": "What's the flash point for 3-(4-chlorophenyl)-<I>N</I>,<I>N</I>-dimethyl-3-pyridin-2-ylpropan-1-amine?",
        "query": {
            "sparql": "SELECT ?FlashPoint WHERE {\n  VALUES ?Species { \"3-(4-chlorophenyl)-<I>N</I>,<I>N</I>-dimethyl-3-pyridin-2-ylpropan-1-amine\" }\n  ?Species os:hasFlashPoint ?FlashPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-216",
        "domain": "ontospecies",
        "question": "Can you find information on how soluble C1=CC=C(C=C1)C=CC=O is?",
        "query": {
            "sparql": "SELECT ?Solubility WHERE {\n  VALUES ?Species { \"C1=CC=C(C=C1)C=CC=O\" }\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-442",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that have a polar surface area approximately equal to 60.4.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue > 60.4*0.9 && ?PolarSurfaceAreaValue < 60.4*1.1 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-306",
        "domain": "ontokin",
        "question": "Searching for the kinetic model of a chemical reaction with DMM2BOOH and MD9OOH5J, as referred to in the study accessible from https://doi.org/10.1002/kin.20603.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"DMM2BOOH\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD9OOH5J\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    }
]