[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-533",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is pnictogen molecular entity and chemical classification is main group molecular entity",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"pnictogen molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"main group molecular entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-347",
        "domain": "ontospecies",
        "question": "I'm searching for chemicals with a hydrogen bond donor count not in the range of -1 to 1.0, classified as both p-menth-4(8)-en-3-one and p-block molecular entity, with an atom chiral count no less than zero and Henry's law constant of maximum 7.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue < -1 || ?HydrogenBondDonorCountValue > 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"p-menth-4(8)-en-3-one\" .\n  ?Species os:hasChemicalClass/rdfs:label \"p-block molecular entity\" .\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue >= 0 )\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue <= 7 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-487",
        "domain": "ontocompchem",
        "question": "Can I find the total Gibbs free energy and LUMO energy for Pd using the STO-5G basis set across various theoretical levels?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?LUMOEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-5G\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-219",
        "domain": "ontocompchem",
        "question": "What is the HOMO-2 energy and total Gibbs free energy of Ne calculated using the aug-cc-pVTZ basis set, specifying the level of theory at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?TotalGibbsFreeEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ne\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-93",
        "domain": "ontocompchem",
        "question": "Can you help me find the total Gibbs free energy for Kr as calculated by the B3LYP level of theory and applying the CC-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Kr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-36",
        "domain": "ontospecies",
        "question": "Chemical species with an undefined bond stereocenter count between -1.0 and 1.0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue > -1.0 && ?BondChiralUndefCountValue < 1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-451",
        "domain": "ontospecies",
        "question": "I need to find out the melting point, number of atom stereocenters, and heat of vaporization for both C6H12N2S4 and CCC1(C(=O)NCNC1=O)C2=CC=CC=C2.",
        "query": {
            "sparql": "SELECT ?MeltingPoint ?AtomChiralCount ?HeatOfVaporization WHERE {\n  VALUES ?Species { \"C6H12N2S4\" \"CCC1(C(=O)NCNC1=O)C2=CC=CC=C2\" }\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-482",
        "domain": "ontokin",
        "question": "I'm trying to understand the kinetic model of a chemical reaction involving BC6H13O2 as a reactant and MD6D6J as a product.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD6D6J\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"BC6H13O2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-275",
        "domain": "ontocompchem",
        "question": "Looking for the value of highest occupied molecular orbital energy of ClI using a certain basis set.",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClI\" .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-555",
        "domain": "ontospecies",
        "question": "For C8H18O3 and 3-(2-chloro-5,6-dihydrobenzo[b][1]benzazepin-11-yl)-N,N-dimethyl-1-propanamine and C1=CC=C(C=C1)N2C(=O)C(=C(C=N2)N)Cl, what is their hydrogen bond acceptor count",
        "query": {
            "sparql": "SELECT ?HydrogenBondAcceptorCount WHERE {\n  VALUES ?Species { \"C8H18O3\" \"3-(2-chloro-5,6-dihydrobenzo[b][1]benzazepin-11-yl)-N,N-dimethyl-1-propanamine\" \"C1=CC=C(C=C1)N2C(=O)C(=C(C=N2)N)Cl\" }\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-878",
        "domain": "ontospecies",
        "question": "Show me the chemical species with an approximate isotope count of zero, a molecular weight not exceeding 151 and having fewer than one defined atom stereocenter.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue > -0.1 && ?IsotopeAtomCountValue < 0.1 )\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue <= 151 )\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue < 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-552",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species classified as lipid.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"lipid\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-430",
        "domain": "ontocompchem",
        "question": "Looking for the energy and geometric details of the highest occupied molecular orbital within Br- across all basis sets.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?HOMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Br-\" .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-19",
        "domain": "ontospecies",
        "question": "Need details about the autoignition temperature and flash point for CCOC(=O)C(=O)OCC.",
        "query": {
            "sparql": "SELECT ?AutoignitionTemperature ?FlashPoint WHERE {\n  VALUES ?Species { \"CCOC(=O)C(=O)OCC\" }\n  ?Species os:hasAutoignitionTemperature ?AutoignitionTemperature .\n  ?Species os:hasFlashPoint ?FlashPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-892",
        "domain": "ontospecies",
        "question": "For the chemical species whose boiling point is lower than 726 and chemical class is ester and Henry's law constant is < 1, what is its heat of vaporization",
        "query": {
            "sparql": "SELECT ?HeatOfVaporization WHERE {\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue < 726 )\n  ?Species os:hasChemicalClass/rdfs:label \"ester\" .\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue < 1 )\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-271",
        "domain": "ontokin",
        "question": "What's the kinetic model for the chemical reaction H2 + O <=> H + OH?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2 + O <=> H + OH\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-139",
        "domain": "ontocompchem",
        "question": "What is the electronic energy of CF4 calculated at the M06-2X level of theory",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CF4\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-225",
        "domain": "ontospecies",
        "question": "For 1-vinylpyrrolidin-2-one, what are its different properties",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"1-vinylpyrrolidin-2-one\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-72",
        "domain": "ontocompchem",
        "question": "Could you show me the NHOMO energy value for O2 that was determined utilizing the aug-cc-pVDZ basis set?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"O2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-791",
        "domain": "ontospecies",
        "question": "What are the SMILES strings and tautomer counts for CN1CCN2C(C1)C3=CC=CC=C3CC4=C2N=CC=C4 and InChI=1S/C6H2Cl4/c7-3-1-4(8)6(10)5(9)2-3/h1-2H?",
        "query": {
            "sparql": "SELECT ?SMILES ?TautomerCount WHERE {\n  VALUES ?Species { \"CN1CCN2C(C1)C3=CC=CC=C3CC4=C2N=CC=C4\" \"InChI=1S/C6H2Cl4/c7-3-1-4(8)6(10)5(9)2-3/h1-2H\" }\n  ?Species os:hasSMILES ?SMILES .\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-206",
        "domain": "ontospecies",
        "question": "I need to find out about the rotatable bond count in C1=CC=C(C=C1)C(Cl)(Cl)Cl as well as its dissociation constants.",
        "query": {
            "sparql": "SELECT ?RotatableBondCount ?DissociationConstants WHERE {\n  VALUES ?Species { \"C1=CC=C(C=C1)C(Cl)(Cl)Cl\" }\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-119",
        "domain": "ontocompchem",
        "question": "I'm looking for the calculated frequencies of F2 at the UB3LYP level using a cc-pVDZ basis set, where would I find that?",
        "query": {
            "sparql": "SELECT ?Frequencies WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-250",
        "domain": "ontokin",
        "question": "How does the kinetic model work for the chemical reaction HE + H2 = H + HE + H?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"HE + H2 = H + HE + H\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-209",
        "domain": "ontocompchem",
        "question": "What is the HOMO-2 energy of Ar across all level of theory",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ar\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-975",
        "domain": "ontospecies",
        "question": "Searching for the enthalpy of sublimation for a chemical species with an exact mass greater than 194.29929 but less than 238, having covalent units either less than 0.9 or more than 2, and classified as chemical entity, carbon group molecular entity, carbocyclic compound and heteroorganic entity.",
        "query": {
            "sparql": "SELECT ?EnthalpyOfSublimation WHERE {\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 194.29929 && ?ExactMassValue < 238 )\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue < 0.9 || ?CovalentUnitCountValue > 2 )\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"carbon group molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"carbocyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-152",
        "domain": "ontospecies",
        "question": "Can you tell me the InChI for InChI=1S/C6H5NO3/c8-6-3-1-2-5(4-6)7(9)10/h1-4,8H, C5H12O4, and 2-oxidanylidenepropanal?",
        "query": {
            "sparql": "SELECT ?InChI WHERE {\n  VALUES ?Species { \"InChI=1S/C6H5NO3/c8-6-3-1-2-5(4-6)7(9)10/h1-4,8H\" \"C5H12O4\" \"2-oxidanylidenepropanal\" }\n  ?Species os:hasInChI ?InChI .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-705",
        "domain": "ontospecies",
        "question": "Can you tell me the standard heat of formation for these substances: InChI=1S/C3H7ClO2/c4-1-3(6)2-5/h3,5-6H,1-2H2, CC(C(=O)O)Cl, and bromoethene?",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"InChI=1S/C3H7ClO2/c4-1-3(6)2-5/h3,5-6H,1-2H2\" \"CC(C(=O)O)Cl\" \"bromoethene\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-93",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is organic hydride and isotope atom count is <= 1",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic hydride\" .\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue <= 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-597",
        "domain": "ontospecies",
        "question": "I need to know the different characteristics of CCCC(=O)C, COC1=C(C=C2C(=C1)CC(C2=O)CC3CCN(CC3)CC4=CC=CC=C4)OC and diethyl 2-dimethoxyphosphinothioylsulfanylbutanedioate.",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"CCCC(=O)C\" \"COC1=C(C=C2C(=C1)CC(C2=O)CC3CCN(CC3)CC4=CC=CC=C4)OC\" \"diethyl 2-dimethoxyphosphinothioylsulfanylbutanedioate\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-328",
        "domain": "ontokin",
        "question": "I need the kinetic model for the chemical process that starts with MDDIPX25J6 and ends with AC6H12OOH-EO2. Can you help?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDDIPX25J6\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"AC6H12OOH-EO2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-585",
        "domain": "ontospecies",
        "question": "Need to know the values of optical rotation, XLogP3 and Henry's law constant for C5H10O2.",
        "query": {
            "sparql": "SELECT ?OpticalRotation ?HenrysLawConstant ?XLogP3 WHERE {\n  VALUES ?Species { \"C5H10O2\" }\n  ?Species os:hasOpticalRotation ?OpticalRotation .\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n  ?Species os:hasXLogP3 ?XLogP3 .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-71",
        "domain": "ontokin",
        "question": "Show me a chemical reaction that uses C2H5NO as a reactant.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C2H5NO\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-248",
        "domain": "ontokin",
        "question": "I'm looking for the count of chemical reactions that result in C3H3OHCHO1-2OOH as per the study in this link https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C3H3OHCHO1-2OOH\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-468",
        "domain": "ontocompchem",
        "question": "I need the SCF energy of Ir that's calculated at PM6 level of theory and across all basis sets.",
        "query": {
            "sparql": "SELECT ?SCFEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ir\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-481",
        "domain": "ontocompchem",
        "question": "I want to find out the calculated optimized geometry of Pr using the B3LYP level of theory and the STO-5G basis set.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-5G\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-397",
        "domain": "ontokin",
        "question": "For the chemical reaction that has product S2XC8H17 and has reactant C4H8OOH1-3 and is involved in the mechanism found in https://doi.org/10.1002/kin.20603, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"S2XC8H17\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C4H8OOH1-3\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-481",
        "domain": "ontokin",
        "question": "What is the chemical reaction that is involved in the mechanism found in https://doi.org/10.1002/kin.20026 and has product MBKET32 and has reactant C10H21-1",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MBKET32\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C10H21-1\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-256",
        "domain": "ontocompchem",
        "question": "How can I get the total energy of H2 at RB3LYP level for every basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?SCFEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-559",
        "domain": "ontospecies",
        "question": "For C1CS1 and InChI=1S/C15H12N2O/c16-15(18)17-13-7-3-1-5-11(13)9-10-12-6-2-4-8-14(12)17/h1-10H,(H2,16,18), what is their IUPAC International Chemical Identifier",
        "query": {
            "sparql": "SELECT ?InChI WHERE {\n  VALUES ?Species { \"C1CS1\" \"InChI=1S/C15H12N2O/c16-15(18)17-13-7-3-1-5-11(13)9-10-12-6-2-4-8-14(12)17/h1-10H,(H2,16,18)\" }\n  ?Species os:hasInChI ?InChI .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-907",
        "domain": "ontospecies",
        "question": "Need info on rotatable bond count and vapor pressure in InChI=1S/C6H6O3S/c7-10(8,9)6-4-2-1-3-5-6/h1-5H,(H,7,8,9) and InChI=1S/C32H66/c1-3-5-7-9-11-13-15-17-19-21-23-25-27-29-31-32-30-28-26-24-22-20-18-16-14-12-10-8-6-4-2/h3-32H2,1-2H3.",
        "query": {
            "sparql": "SELECT ?RotatableBondCount ?VaporPressure WHERE {\n  VALUES ?Species { \"InChI=1S/C6H6O3S/c7-10(8,9)6-4-2-1-3-5-6/h1-5H,(H,7,8,9)\" \"InChI=1S/C32H66/c1-3-5-7-9-11-13-15-17-19-21-23-25-27-29-31-32-30-28-26-24-22-20-18-16-14-12-10-8-6-4-2/h3-32H2,1-2H3\" }\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n  ?Species os:hasVaporPressure ?VaporPressure .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-882",
        "domain": "ontospecies",
        "question": "Tell me about the complexity of these compounds: CC1=C(S(=O)(=O)CCO1)C(=O)NC2=CC=CC=C2, InChI=1S/C7H6N2O4/c1-5-2-6(8(10)11)4-7(3-5)9(12)13/h2-4H,1H3 and 1-hexanethiol.",
        "query": {
            "sparql": "SELECT ?CompoundComplexity WHERE {\n  VALUES ?Species { \"CC1=C(S(=O)(=O)CCO1)C(=O)NC2=CC=CC=C2\" \"InChI=1S/C7H6N2O4/c1-5-2-6(8(10)11)4-7(3-5)9(12)13/h2-4H,1H3\" \"1-hexanethiol\" }\n  ?Species os:hasCompoundComplexity ?CompoundComplexity .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-75",
        "domain": "ontospecies",
        "question": "Find chemicals that are both organic hydride and polyatomic entity, have an atom stereocenter count outside -1 to 1 range, accept fewer than one hydrogen bond, contain over 27.9 atoms excluding hydrogen, and have a mass less than or equal to 480.1508800000001.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic hydride\" .\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue < -1 || ?AtomChiralCountValue > 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue < 1 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 27.900000000000002 )\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue <= 480.1508800000001 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-184",
        "domain": "ontospecies",
        "question": "I'm looking for information on the Caco-2 permeability for InChI=1S/C5H10O/c1-3-5(6)4-2/h3-4H2,1-2H3.",
        "query": {
            "sparql": "SELECT ?Caco2Permeability WHERE {\n  VALUES ?Species { \"InChI=1S/C5H10O/c1-3-5(6)4-2/h3-4H2,1-2H3\" }\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-329",
        "domain": "ontokin",
        "question": "What's the kinetic model for the chemical reaction HO2 + HO2 <=> H2O2 + O2 mentioned on this site www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"HO2 + HO2 <=> H2O2 + O2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-662",
        "domain": "ontospecies",
        "question": "What are the chemical species whose isotope atom count is lower than -1 or bigger than 1.0 and bond chiral undef count is <= 1.0 and polar surface area is = 9.2 and molecular weight is approximately 53.996",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue < -1 || ?IsotopeAtomCountValue > 1.0 )\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue <= 1.0 )\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue = 9.2 )\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue > 53.996*0.9 && ?MolecularWeightValue < 53.996*1.1 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-441",
        "domain": "ontocompchem",
        "question": "Searching for the frequencies for La at the UB3LYP computation level.",
        "query": {
            "sparql": "SELECT ?Frequencies WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"La\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-422",
        "domain": "ontospecies",
        "question": "I'm looking for the heat of combustion values for both InChI=1S/C4H9Br/c1-3-4(2)5/h4H,3H2,1-2H3 and InChI=1S/C10H7Cl/c11-10-6-5-8-3-1-2-4-9(8)7-10/h1-7H.",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion WHERE {\n  VALUES ?Species { \"InChI=1S/C4H9Br/c1-3-4(2)5/h4H,3H2,1-2H3\" \"InChI=1S/C10H7Cl/c11-10-6-5-8-3-1-2-4-9(8)7-10/h1-7H\" }\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-4",
        "domain": "ontospecies",
        "question": "Can you give me a list of different identifiers for 1,1,3,3-tetramethylurea?",
        "query": {
            "sparql": "SELECT ?IdentifierName WHERE {\n  VALUES ?Species { \"1,1,3,3-tetramethylurea\" }\n  ?Species ?hasIdentifierName ?IdentifierName .\n  ?IdentifierName a/rdfs:subClassOf os:Identifier .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-757",
        "domain": "ontospecies",
        "question": "What are the chemical species whose covalent unit count is > 0.9 and less than 2 and role is plant metabolite",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue > 0.9 && ?CovalentUnitCountValue < 2 )\n  ?Species os:hasUse/rdfs:label \"plant metabolite\" .\n}"
        }
    }
]