[
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-287",
        "domain": "ontocompchem",
        "question": "Can you tell me the values for the energy of the highest occupied molecular orbital, total Gibbs free energy, and the energy of the lowest unoccupied molecular orbital for I2 when calculated at the G3 level with a STO-6G basis set?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?TotalGibbsFreeEnergy ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"I2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-803",
        "domain": "ontospecies",
        "question": "Can you give me information about the chemical type, enthalpy of sublimation, and density for InChI=1S/C10H16/c1-8(2)10-6-4-9(3)5-7-10/h4,10H,1,5-7H2,2-3H3?",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel ?EnthalpyOfSublimation ?Density WHERE {\n  VALUES ?Species { \"InChI=1S/C10H16/c1-8(2)10-6-4-9(3)5-7-10/h4,10H,1,5-7H2,2-3H3\" }\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n  ?Species os:hasDensity ?Density .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-471",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species with the classifications of carbon oxoacid and lipid, a polar surface area of at least 33.57, and a bond stereocenter count in the range of (0.9, 1.1).",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carbon oxoacid\" .\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue >= 33.57 )\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > 0.9 && ?BondChiralCountValue < 1.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"lipid\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-497",
        "domain": "ontospecies",
        "question": "Can you tell me the solubility of an organic molecular entity, specifically Alcohols (<C12), with a compound complexity of 61.9 and a viscosity between 0 and 0.01199?",
        "query": {
            "sparql": "SELECT ?Solubility WHERE {\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue = 61.9 )\n  ?Species os:hasViscosity/os:value ?ViscosityValue .\n  FILTER ( ?ViscosityValue > 0 && ?ViscosityValue < 0.01199 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"Alcohols (<C12)\" .\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-405",
        "domain": "ontocompchem",
        "question": "Can you tell me the values for HOMO-2, HOMO and NHOMO energies for Mn when it's evaluated at the RB3LYP level with the 6-311+G basis set?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?HOMOEnergy ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mn\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311+G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-22",
        "domain": "ontospecies",
        "question": "What are the chemical species whose bond chiral def count is < 1.0 and bond stereocenter count is smaller than -1.0 or higher than 1 and Log P is outside the range (3.4019999999999997, 4.158)",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue < 1.0 )\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue < -1.0 || ?BondChiralCountValue > 1 )\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue < 3.4019999999999997 || ?LogPValue > 4.158 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-485",
        "domain": "ontocompchem",
        "question": "What's the energy level of HOMO-2 for H2S according to a specific theory and basis set?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2S\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-203",
        "domain": "ontospecies",
        "question": "I need to know the exact mass, density and ChEBI ID of C7H15NO3.",
        "query": {
            "sparql": "SELECT ?Density ?ChebiID ?ExactMass WHERE {\n  VALUES ?Species { \"C7H15NO3\" }\n  ?Species os:hasDensity ?Density .\n  ?Species os:hasChebiID ?ChebiID .\n  ?Species os:hasExactMass ?ExactMass .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-490",
        "domain": "ontospecies",
        "question": "Can you list the Mycotoxins with an isotope atom count between -1.0 and 1, and no more than 14 hydrogen bond acceptors?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue > -1.0 && ?IsotopeAtomCountValue < 1 )\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue <= 14 )\n  ?Species os:hasChemicalClass/rdfs:label \"Mycotoxins\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-401",
        "domain": "ontokin",
        "question": "I want to find out what the kinetic model is for a chemical reaction where C4H3O and BAOJ3D are the reactants and C5H9O1-3 is the product, as outlined in this link: https://doi.org/10.1002/kin.20603.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C4H3O\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C5H9O1-3\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"BAOJ3D\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-279",
        "domain": "ontospecies",
        "question": "For C3H2Br2N2O and InChI=1S/C5H9NO/c1-6-4-2-3-5(6)7/h2-4H2,1H3, what is their XLogP3",
        "query": {
            "sparql": "SELECT ?XLogP3 WHERE {\n  VALUES ?Species { \"C3H2Br2N2O\" \"InChI=1S/C5H9NO/c1-6-4-2-3-5(6)7/h2-4H2,1H3\" }\n  ?Species os:hasXLogP3 ?XLogP3 .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-284",
        "domain": "ontospecies",
        "question": "I'm trying to find out the number of heavy atoms present in 2-azanyl-4-methylsulfanyl-butanoic acid.",
        "query": {
            "sparql": "SELECT ?HeavyAtomCount WHERE {\n  VALUES ?Species { \"2-azanyl-4-methylsulfanyl-butanoic acid\" }\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-553",
        "domain": "ontospecies",
        "question": "Can you list the chemical species with a polar surface area of 30 or more?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue >= 30 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-320",
        "domain": "ontocompchem",
        "question": "I need to find CS2 rotational constants using UB3LYP level of theory and STO-3G set of basis.",
        "query": {
            "sparql": "SELECT ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CS2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-503",
        "domain": "ontospecies",
        "question": "For 2,2-bis(chloranyl)-1,1,1-tris(fluoranyl)ethane and InChI=1S/C3H6O/c1-3-4-2/h3H,1H2,2H3, what is their molecular mass",
        "query": {
            "sparql": "SELECT ?MolecularWeight WHERE {\n  VALUES ?Species { \"2,2-bis(chloranyl)-1,1,1-tris(fluoranyl)ethane\" \"InChI=1S/C3H6O/c1-3-4-2/h3H,1H2,2H3\" }\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-156",
        "domain": "ontocompchem",
        "question": "Calculating Cm frequencies at the G3 level with the STO-3G basis set, what are they?",
        "query": {
            "sparql": "SELECT ?Frequencies WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-242",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction that has product MB3OOH4O2",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MB3OOH4O2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-35",
        "domain": "ontocompchem",
        "question": "Can you show me the total energy calculations for Ce including the level of theory and basis set used?",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ce\" .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-863",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that fall under the categories of both aromatic and organohalogen compounds, and have a maximum atom chiral def count of 1.0.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"aromatic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organohalogen compound\" .\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue <= 1.0 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-213",
        "domain": "ontocompchem",
        "question": "What's the NHOMO energy level theory for Ne?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ne\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-266",
        "domain": "ontokin",
        "question": "Can you find the chemical reaction involving C8H16O2-6 that's part of the mechanism shown on www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C8H16O2-6\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-146",
        "domain": "ontokin",
        "question": "On the website www.osti.gov/servlets/purl/90098-26Ev73/webviewable/, how many reactions involve MH2D as a reactant and produce C7H15O2-P3?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C7H15O2-P3\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MH2D\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-460",
        "domain": "ontokin",
        "question": "I need the kinetic model of the OH + H + M <=> H2O + M reaction mentioned in www.osti.gov/servlets/purl/90098-26Ev73/webviewable/, can you help?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"OH + H + M <=> H2O + M\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-378",
        "domain": "ontocompchem",
        "question": "I need to find out the HF level calculated energy for LUMO+2 and the molecular structure of F4S.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F4S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-501",
        "domain": "ontospecies",
        "question": "How many hydrogen bond acceptors does C[C@@]12CC[C@H](C1(C)C)C[C@@H]2O have?",
        "query": {
            "sparql": "SELECT ?HydrogenBondAcceptorCount WHERE {\n  VALUES ?Species { \"C[C@@]12CC[C@H](C1(C)C)C[C@@H]2O\" }\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-908",
        "domain": "ontospecies",
        "question": "Can you find data on the flash point, ionization potential and density for chemical species in the triazoles class that don't have a melting point higher than 476?",
        "query": {
            "sparql": "SELECT ?FlashPoint ?IonizationPotential ?Density WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"triazoles\" .\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue <= 476 )\n  ?Species os:hasFlashPoint ?FlashPoint .\n  ?Species os:hasIonizationPotential ?IonizationPotential .\n  ?Species os:hasDensity ?Density .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-246",
        "domain": "ontokin",
        "question": "Could you help me find information on the kinetic model for the chemical reaction O + O + M = O2 + M as described in this article - https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"O + O + M = O2 + M\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-128",
        "domain": "ontospecies",
        "question": "For the chemical species whose Henry's law constant is bigger than 3282 and chemical classification is heteroorganic entity and chemical class is main group molecular entity and melting point is higher than 253.21500000000003 and compound complexity is = 177.0 and chemical classification is molecule, what is its polar surface area",
        "query": {
            "sparql": "SELECT ?PolarSurfaceArea WHERE {\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue > 3282 )\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"main group molecular entity\" .\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue > 253.21500000000003 )\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue = 177.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-438",
        "domain": "ontospecies",
        "question": "Looking for the surface tension and InChIKey of both InChI=1S/C21H25ClN2O3/c22-19-8-6-18(7-9-19)21(17-4-2-1-3-5-17)24-12-10-23(11-13-24)14-15-27-16-20(25)26/h1-9,21H,10-16H2,(H,25,26) and C10H10O4.",
        "query": {
            "sparql": "SELECT ?SurfaceTension ?InChIKey WHERE {\n  VALUES ?Species { \"InChI=1S/C21H25ClN2O3/c22-19-8-6-18(7-9-19)21(17-4-2-1-3-5-17)24-12-10-23(11-13-24)14-15-27-16-20(25)26/h1-9,21H,10-16H2,(H,25,26)\" \"C10H10O4\" }\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n  ?Species os:hasInChIKey ?InChIKey .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-465",
        "domain": "ontospecies",
        "question": "For InChI=1S/C8Cl4N2/c9-5-3(1-13)6(10)8(12)7(11)4(5)2-14 and InChI=1S/C7H8O2/c1-9-7-5-3-2-4-6(7)8/h2-5,8H,1H3, what is their density",
        "query": {
            "sparql": "SELECT ?Density WHERE {\n  VALUES ?Species { \"InChI=1S/C8Cl4N2/c9-5-3(1-13)6(10)8(12)7(11)4(5)2-14\" \"InChI=1S/C7H8O2/c1-9-7-5-3-2-4-6(7)8/h2-5,8H,1H3\" }\n  ?Species os:hasDensity ?Density .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-797",
        "domain": "ontospecies",
        "question": "Looking for organooxygen compounds and heteroorganic entities with more than -1 hydrogen bond donors and a maximum of 1 undefined atom chiral count.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue > -1 )\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue <= 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"organooxygen compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-753",
        "domain": "ontospecies",
        "question": "Can you tell me the surface tension and Henry's law constant for 2,2,4-trimethylpentane and InChI=1S/C9H12/c1-7-4-8(2)6-9(3)5-7/h4-6H,1-3H3?",
        "query": {
            "sparql": "SELECT ?HenrysLawConstant ?SurfaceTension WHERE {\n  VALUES ?Species { \"2,2,4-trimethylpentane\" \"InChI=1S/C9H12/c1-7-4-8(2)6-9(3)5-7/h4-6H,1-3H3\" }\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-37",
        "domain": "ontocompchem",
        "question": "What is the LUMO+2 energy and energy of next-to-highest occupied molecular orbital of Md, specifying the level of theory and basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?HOMOMinus1Energy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Md\" .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-251",
        "domain": "ontocompchem",
        "question": "I need to know F-'s total Gibbs free energy calculated using the HF level. Also, what was the particular basis set used in the calculations?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-159",
        "domain": "ontocompchem",
        "question": "Can you show me the energy of the top occupied molecular orbital for CH4 predicted at the G3 level with the cc-pVDZ basis set?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CH4\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-474",
        "domain": "ontospecies",
        "question": "What is the flash point and empirical formula of C8H18O and CH6N2 and 4-(1-methyl-1-phenyl-ethyl)phenol",
        "query": {
            "sparql": "SELECT ?FlashPoint ?EmpiricalFormula WHERE {\n  VALUES ?Species { \"C8H18O\" \"CH6N2\" \"4-(1-methyl-1-phenyl-ethyl)phenol\" }\n  ?Species os:hasFlashPoint ?FlashPoint .\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-165",
        "domain": "ontokin",
        "question": "Thermodynamic model for chemical species in reaction mechanism at www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?ThermoModel WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-2",
        "domain": "ontocompchem",
        "question": "Can you help me find the values for both the LUMO+2 energy and the total energy of Pu at all theoretical levels?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?TotalEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pu\" .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-799",
        "domain": "ontospecies",
        "question": "Chiral atom count in 2-[3-[4-(3-chlorophenyl)piperazino]propyl]-5-ethyl-4-(2-phenoxyethyl)-1,2,4-triazol-3-one and InChI=1S/C14H23O4P/c1-3-5-12-16-19(15,17-13-6-4-2)18-14-10-8-7-9-11-14/h7-11H,3-6,12-13H2,1-2H3?",
        "query": {
            "sparql": "SELECT ?AtomChiralCount WHERE {\n  VALUES ?Species { \"2-[3-[4-(3-chlorophenyl)piperazino]propyl]-5-ethyl-4-(2-phenoxyethyl)-1,2,4-triazol-3-one\" \"InChI=1S/C14H23O4P/c1-3-5-12-16-19(15,17-13-6-4-2)18-14-10-8-7-9-11-14/h7-11H,3-6,12-13H2,1-2H3\" }\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-17",
        "domain": "ontokin",
        "question": "In the equation H + O + M = OH + M, can you tell me the kinetic model?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + O + M = OH + M\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-62",
        "domain": "ontocompchem",
        "question": "What is the HOMO-2 energy and total energy of F6S calculated using the STO-3G or STO-5G basis set",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F6S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" \"STO-5G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-309",
        "domain": "ontokin",
        "question": "What is the reaction mechanism that invovles C9KET5-6-2",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"C9KET5-6-2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-127",
        "domain": "ontospecies",
        "question": "Looking for chemical species with dissociation constants less than 12 and atom stereocenter count between -1.0 and 1",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasDissociationConstants/os:value ?DissociationConstantsValue .\n  FILTER ( ?DissociationConstantsValue < 12 )\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue > -1.0 && ?AtomChiralCountValue < 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-309",
        "domain": "ontospecies",
        "question": "Looking for the count of hydrogen bond acceptors in C7H7Cl and I.",
        "query": {
            "sparql": "SELECT ?HydrogenBondAcceptorCount WHERE {\n  VALUES ?Species { \"C7H7Cl\" \"I\" }\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-367",
        "domain": "ontokin",
        "question": "Can you tell me about the chemical reaction in the study mentioned at this link https://doi.org/10.1002/kin.20026?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-280",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction that has reactant C11H23O-1-2 and is involved in the mechanism found in https://doi.org/10.1016/j.combustflame.2007.10.024",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C11H23O-1-2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-63",
        "domain": "ontocompchem",
        "question": "Can you show me the NHOMO energy values for CH4 using various basis sets?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CH4\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-423",
        "domain": "ontospecies",
        "question": "I need information on C8H12N2 and CC(=C)C(=O)OCCN(C)C's chemical classification, number of covalent bonds, and heat of combustion.",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel ?CovalentUnitCount ?HeatOfCombustion WHERE {\n  VALUES ?Species { \"C8H12N2\" \"CC(=C)C(=O)OCCN(C)C\" }\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n  ?Species os:hasCovalentUnitCount ?CovalentUnitCount .\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n}"
        }
    }
]