[
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-195",
        "domain": "ontocompchem",
        "question": "I'm looking for information regarding Ar's LUMO+1 and LUMO+2 energy, specifically using the correct level of theory for the calculations.",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?LUMOPlus2Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ar\" .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-263",
        "domain": "ontospecies",
        "question": "What's the amount of heat produced during InChI=1S/F2O2S/c1-5(2,3)4's combustion?",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion WHERE {\n  VALUES ?Species { \"InChI=1S/F2O2S/c1-5(2,3)4\" }\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-458",
        "domain": "ontocompchem",
        "question": "I need information on Cr's LUMO+2 energy calculated at B3LYP theory level with either the cc-pVDZ or STO-4G basis set.",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-283",
        "domain": "ontospecies",
        "question": "Can you tell me the standard enthalpy of formation for <I>N</I>-ethylidenehydroxylamine and C1=CC(=CC=C1[N+](=O)[O-])[N+](=O)[O-]?",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"<I>N</I>-ethylidenehydroxylamine\" \"C1=CC(=CC=C1[N+](=O)[O-])[N+](=O)[O-]\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-415",
        "domain": "ontokin",
        "question": "How many chemical species that appears in the reaction mechanism found in https://doi.org/10.1002/kin.20026",
        "query": {
            "sparql": "SELECT (COUNT(?Species) AS ?SpeciesCount) WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-293",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction that is involved in the mechanism found in www.osti.gov/servlets/purl/90098-26Ev73/webviewable/ and has product C11H23O-1 and has reactant BIN1A",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C11H23O-1\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"BIN1A\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-103",
        "domain": "ontospecies",
        "question": "For InChI=1S/C12H4Cl4O2/c13-5-1-9-10(2-6(5)14)18-12-4-8(16)7(15)3-11(12)17-9/h1-4H and InChI=1S/C6H14O2/c1-4-7-6(3)8-5-2/h6H,4-5H2,1-3H3 and C3H4Cl2F2O, what is their InChIKey",
        "query": {
            "sparql": "SELECT ?InChIKey WHERE {\n  VALUES ?Species { \"InChI=1S/C12H4Cl4O2/c13-5-1-9-10(2-6(5)14)18-12-4-8(16)7(15)3-11(12)17-9/h1-4H\" \"InChI=1S/C6H14O2/c1-4-7-6(3)8-5-2/h6H,4-5H2,1-3H3\" \"C3H4Cl2F2O\" }\n  ?Species os:hasInChIKey ?InChIKey .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-178",
        "domain": "ontospecies",
        "question": "I need to find out about the rotatable bond count and complexity level of C6H14 as a compound.",
        "query": {
            "sparql": "SELECT ?RotatableBondCount ?CompoundComplexity WHERE {\n  VALUES ?Species { \"C6H14\" }\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n  ?Species os:hasCompoundComplexity ?CompoundComplexity .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-909",
        "domain": "ontospecies",
        "question": "I need information on the collision cross section, undefined bond stereocenter count and hydrogen bond donor count of C(Br)(Br)(Br)Br.",
        "query": {
            "sparql": "SELECT ?CollisionCrossSection ?BondChiralUndefCount ?HydrogenBondDonorCount WHERE {\n  VALUES ?Species { \"C(Br)(Br)(Br)Br\" }\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-280",
        "domain": "ontospecies",
        "question": "What are the chemical species whose role is Process regulators",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"Process regulators\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-257",
        "domain": "ontokin",
        "question": "What's the kinetic model for the O + HO2 <=> OH + O2 chemical reaction?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"O + HO2 <=> OH + O2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-172",
        "domain": "ontospecies",
        "question": "For 2-isopropoxyethanol, what is its log P",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  VALUES ?Species { \"2-isopropoxyethanol\" }\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-499",
        "domain": "ontocompchem",
        "question": "What is the total energy of HO2 calculated at the G3 level of theory using the CC-pVQZ or STO-3G basis set",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HO2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVQZ\" \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-481",
        "domain": "ontospecies",
        "question": "Can you provide me with the polar surface area values for these alcohols: 2-<I>N</I>-<I>tert</I>-butyl-4-<I>N</I>-ethyl-6-methylsulfanyl-1,3,5-triazine-2,4-diamine, 2-ethyl-1-butanol and InChI=1S/C4H7Cl/c1-4(2)3-5/h3H,1-2H3?",
        "query": {
            "sparql": "SELECT ?PolarSurfaceArea WHERE {\n  VALUES ?Species { \"2-<I>N</I>-<I>tert</I>-butyl-4-<I>N</I>-ethyl-6-methylsulfanyl-1,3,5-triazine-2,4-diamine\" \"2-ethyl-1-butanol\" \"InChI=1S/C4H7Cl/c1-4(2)3-5/h3H,1-2H3\" }\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-503",
        "domain": "ontokin",
        "question": "Can you find a chemical reaction for me which uses C12OOH1-3O2 as a reactant?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C12OOH1-3O2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-350",
        "domain": "ontospecies",
        "question": "What are the chemical species whose atom stereocenter count is equal to 5.0 and charge is less than -1.0 or greater than 1.0 and collision cross section is inside the range (0, 1.8537200000000003e-18) and bond chiral count is approximately 0.0 and melting point is lower than 387.585 or > 474",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue = 5.0 )\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue < -1.0 || ?ChargeValue > 1.0 )\n  ?Species os:hasCollisionCrossSection/os:value ?CollisionCrossSectionValue .\n  FILTER ( ?CollisionCrossSectionValue > 0 && ?CollisionCrossSectionValue < 1.8537200000000003e-18 )\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > -0.1 && ?BondChiralCountValue < 0.1 )\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue < 387.585 || ?MeltingPointValue > 474 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-558",
        "domain": "ontospecies",
        "question": "I'm looking for the SMILES string of any carbon group molecular entity that has an optical rotation equal to or exceeding zero.",
        "query": {
            "sparql": "SELECT ?SMILES WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carbon group molecular entity\" .\n  ?Species os:hasOpticalRotation/os:value ?OpticalRotationValue .\n  FILTER ( ?OpticalRotationValue >= 0 )\n  ?Species os:hasSMILES ?SMILES .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-311",
        "domain": "ontokin",
        "question": "Can you show me the chemical reaction where MD5OXO7D is a reactant and MD9D3OOHMJ and C9OOH6-2D are products?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD9D3OOHMJ\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C9OOH6-2D\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD5OXO7D\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-407",
        "domain": "ontospecies",
        "question": "Can you list the chemical species with a charge greater than -1 but less than 1 and a boiling point either below 298 or above 366?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -1 && ?ChargeValue < 1 )\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue < 298 || ?BoilingPointValue > 366 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-469",
        "domain": "ontocompchem",
        "question": "Information wanted on the highest occupied molecular orbital energy of Mn.",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mn\" .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-177",
        "domain": "ontokin",
        "question": "Can you find the chemical reaction involving C7CY146 as a reactant?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7CY146\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-335",
        "domain": "ontocompchem",
        "question": "What's the calculated LUMO+2 energy for F2O at the PM6 level? I'm using the STO-3G or STO-4G basis set.",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F2O\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-516",
        "domain": "ontospecies",
        "question": "Can you tell me how soluble InChI=1S/C17H34O2/c1-4-5-6-7-8-9-10-11-12-13-14-15-17(18)19-16(2)3/h16H,4-15H2,1-3H3 is?",
        "query": {
            "sparql": "SELECT ?Solubility WHERE {\n  VALUES ?Species { \"InChI=1S/C17H34O2/c1-4-5-6-7-8-9-10-11-12-13-14-15-17(18)19-16(2)3/h16H,4-15H2,1-3H3\" }\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-302",
        "domain": "ontocompchem",
        "question": "Need to find out about Er frequencies based on a certain level of theory and basis set used for computations.",
        "query": {
            "sparql": "SELECT ?Frequencies ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Er\" .\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-2",
        "domain": "ontokin",
        "question": "I'm looking for the count of chemical reactions in https://doi.org/10.1002/kin.20603 where CH3COCH2CO and MP2DOH2 are the reactants and HE is the product.",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"CH3COCH2CO\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MP2DOH2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"HE\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-606",
        "domain": "ontospecies",
        "question": "How many rotatable bonds does [N+](=O)(O)[O-] have?",
        "query": {
            "sparql": "SELECT ?RotatableBondCount WHERE {\n  VALUES ?Species { \"[N+](=O)(O)[O-]\" }\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-386",
        "domain": "ontocompchem",
        "question": "Looking for the enthalpy total of CN-.",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CN-\" .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-399",
        "domain": "ontocompchem",
        "question": "What is the rotational constants of Er across all basis set",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Er\" .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-790",
        "domain": "ontospecies",
        "question": "I'm looking for thiazide classified chemicals that have a maximum of 7.7 hydrogen bond acceptors.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"thiazide\" .\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue <= 7.700000000000001 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-721",
        "domain": "ontospecies",
        "question": "I'm looking for information on the polar surface area of C3H4Cl2, can you help?",
        "query": {
            "sparql": "SELECT ?PolarSurfaceArea WHERE {\n  VALUES ?Species { \"C3H4Cl2\" }\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-198",
        "domain": "ontocompchem",
        "question": "What is the frequencies of Pa across all level of theory",
        "query": {
            "sparql": "SELECT ?Frequencies ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pa\" .\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-50",
        "domain": "ontokin",
        "question": "I'm looking for information on the thermodynamics and transport models of C12OOH8-2I in its reaction mechanisms.",
        "query": {
            "sparql": "SELECT ?ThermoModel ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"C12OOH8-2I\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-334",
        "domain": "ontocompchem",
        "question": "Can you tell me about calculating the frequency for ClI at the PM6 level?",
        "query": {
            "sparql": "SELECT ?Frequencies WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClI\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-261",
        "domain": "ontokin",
        "question": "For the chemical reaction H2O + H + H = H2 + H2O, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2O + H + H = H2 + H2O\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-449",
        "domain": "ontospecies",
        "question": "Which chemicals have a collision cross section below 1 and serve the role of being xenobiotic?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCollisionCrossSection/os:value ?CollisionCrossSectionValue .\n  FILTER ( ?CollisionCrossSectionValue < 1 )\n  ?Species os:hasUse/rdfs:label \"xenobiotic\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-833",
        "domain": "ontospecies",
        "question": "How many isotope atoms are there in InChI=1S/C6H10S/c1-3-5-7-6-4-2/h3-4H,1-2,5-6H2?",
        "query": {
            "sparql": "SELECT ?IsotopeAtomCount WHERE {\n  VALUES ?Species { \"InChI=1S/C6H10S/c1-3-5-7-6-4-2/h3-4H,1-2,5-6H2\" }\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-155",
        "domain": "ontospecies",
        "question": "Need to find out the vapor pressure of C([C@H]([C@H]([C@@H]([C@H](CO)O)O)O)O)O and what its SMILES string is.",
        "query": {
            "sparql": "SELECT ?VaporPressure ?SMILES WHERE {\n  VALUES ?Species { \"C([C@H]([C@H]([C@@H]([C@H](CO)O)O)O)O)O\" }\n  ?Species os:hasVaporPressure ?VaporPressure .\n  ?Species os:hasSMILES ?SMILES .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-454",
        "domain": "ontocompchem",
        "question": "I need to know the rotational constants of Rn, specifically calculated with the STO-3G basis set. Make sure the level of theoretical calculation is detailed.",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Rn\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-8",
        "domain": "ontokin",
        "question": "In the source www.osti.gov/servlets/purl/90098-26Ev73/webviewable/, what kind of chemical reaction generates CY485C as the product?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"CY485C\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-88",
        "domain": "ontokin",
        "question": "Can you show the kinetic model of a reaction where NC16H33-OO is used as a reactant?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"NC16H33-OO\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-483",
        "domain": "ontocompchem",
        "question": "I'm trying to find out the calculated LUMO energy for O3S at the RB3LYP level. Could you specify which basis set was used?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"O3S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-457",
        "domain": "ontospecies",
        "question": "I'm looking to find out the heat of combustion for CN(C)CCOCCN(C)C, can you help?",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion WHERE {\n  VALUES ?Species { \"CN(C)CCOCCN(C)C\" }\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-366",
        "domain": "ontospecies",
        "question": "I'm looking for the chemical species with an XLogP3 value over 2.3400000000000003 and a density under 1.1869, what's their Caco-2 permeability?",
        "query": {
            "sparql": "SELECT ?Caco2Permeability WHERE {\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value > 2.3400000000000003 )\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue < 1.1869 )\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-102",
        "domain": "ontokin",
        "question": "What's the number of chemical species in the reaction mechanism on this site www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT (COUNT(?Species) AS ?SpeciesCount) WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-88",
        "domain": "ontospecies",
        "question": "How many bond stereocenters does InChI=1S/C10H12N2O3S/c1-7(2)12-10(13)8-5-3-4-6-9(8)11-16(12,14)15/h3-7,11H,1-2H3 have?",
        "query": {
            "sparql": "SELECT ?BondChiralDefCount WHERE {\n  VALUES ?Species { \"InChI=1S/C10H12N2O3S/c1-7(2)12-10(13)8-5-3-4-6-9(8)11-16(12,14)15/h3-7,11H,1-2H3\" }\n  ?Species os:hasBondChiralDefCount ?BondChiralDefCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-176",
        "domain": "ontokin",
        "question": "Can you tell me what the kinetic model is for this reaction: H + O2 (+ M) = HO2 (+ M)?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + O2 (+ M) = HO2 (+ M)\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-327",
        "domain": "ontospecies",
        "question": "Can you tell me the count of CCC's tautomers?",
        "query": {
            "sparql": "SELECT ?TautomerCount WHERE {\n  VALUES ?Species { \"CCC\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-57",
        "domain": "ontocompchem",
        "question": "What is the resultant overall energy of Sb2, calculated by applying the STO-4G basis set? Please specify the theoretical level used in the calculations.",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Sb2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-265",
        "domain": "ontocompchem",
        "question": "What is the HOMO-1 energy of Pu calculated at the HF level of theory",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-44",
        "domain": "ontospecies",
        "question": "Can I get the values for Henry's law constant and heat of combustion along with the Chemical Entities of Biological Interest ID for C(#N)C#N?",
        "query": {
            "sparql": "SELECT ?HenrysLawConstant ?HeatOfCombustion ?ChebiID WHERE {\n  VALUES ?Species { \"C(#N)C#N\" }\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n  ?Species os:hasChebiID ?ChebiID .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-1",
        "domain": "ontospecies",
        "question": "I'm looking for the PubChem IDs of [2-butyl-5-chloro-3-[[4-[2-(2H-tetrazol-5-yl)phenyl]phenyl]methyl]-4-imidazolyl]methanol and C22H44O2.",
        "query": {
            "sparql": "SELECT ?CID WHERE {\n  VALUES ?Species { \"[2-butyl-5-chloro-3-[[4-[2-(2H-tetrazol-5-yl)phenyl]phenyl]methyl]-4-imidazolyl]methanol\" \"C22H44O2\" }\n  ?Species os:hasCID ?CID .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-354",
        "domain": "ontospecies",
        "question": "Can you find the PubChem Compound ID for 1-[2-(2-butoxyethoxy)ethoxy]butane and 3',6'-dihydroxyspiro[2-benzofuran-3,9'-xanthene]-1-one?",
        "query": {
            "sparql": "SELECT ?CID WHERE {\n  VALUES ?Species { \"1-[2-(2-butoxyethoxy)ethoxy]butane\" \"3',6'-dihydroxyspiro[2-benzofuran-3,9'-xanthene]-1-one\" }\n  ?Species os:hasCID ?CID .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-546",
        "domain": "ontospecies",
        "question": "I'm looking for the vapor density of <I>N</I>,<I>N</I>-dimethylnitrous amide.",
        "query": {
            "sparql": "SELECT ?VaporDensity WHERE {\n  VALUES ?Species { \"<I>N</I>,<I>N</I>-dimethylnitrous amide\" }\n  ?Species os:hasVaporDensity ?VaporDensity .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-244",
        "domain": "ontocompchem",
        "question": "What's the value of Am's rotational constants when computed using PM6 level and STO-5G basis set?",
        "query": {
            "sparql": "SELECT ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Am\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-5G\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-301",
        "domain": "ontokin",
        "question": "I'm trying to find the thermodynamic model and the model for transport for the chemical species in the reaction mechanism at this URL: https://doi.org/10.1016/j.combustflame.2007.10.024. Can you help?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?TransportModel WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-707",
        "domain": "ontospecies",
        "question": "Can you tell me the molecular formula, density and mono isotopic weight for 5-fluoro-1-[(2R,4S,5R)-4-hydroxy-5-methylol-tetrahydrofuran-2-yl]pyrimidine-2,4-quinone?",
        "query": {
            "sparql": "SELECT ?Density ?MonoIsotopicWeight ?MolecularFormula WHERE {\n  VALUES ?Species { \"5-fluoro-1-[(2R,4S,5R)-4-hydroxy-5-methylol-tetrahydrofuran-2-yl]pyrimidine-2,4-quinone\" }\n  ?Species os:hasDensity ?Density .\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n}"
        }
    }
]