[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-3",
        "domain": "ontospecies",
        "question": "Can you help me find the ChEBI IDs for InChI=1S/C10H18O/c1-9(2)8-4-6-10(3,11-9)7-5-8/h8H,4-7H2,1-3H3 and InChI=1S/C20H28O2/c1-15(8-6-9-16(2)14-19(21)22)11-12-18-17(3)10-7-13-20(18,4)5/h6,8-9,11-12,14H,7,10,13H2,1-5H3,(H,21,22)/b9-6+,12-11+,15-8+,16-14+?",
        "query": {
            "sparql": "SELECT ?ChebiID WHERE {\n  VALUES ?Species { \"InChI=1S/C10H18O/c1-9(2)8-4-6-10(3,11-9)7-5-8/h8H,4-7H2,1-3H3\" \"InChI=1S/C20H28O2/c1-15(8-6-9-16(2)14-19(21)22)11-12-18-17(3)10-7-13-20(18,4)5/h6,8-9,11-12,14H,7,10,13H2,1-5H3,(H,21,22)/b9-6+,12-11+,15-8+,16-14+\" }\n  ?Species os:hasChebiID ?ChebiID .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-489",
        "domain": "ontocompchem",
        "question": "Looking for the calculated zero point energy of Mo using STO-5G basis at a specific theory level.",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mo\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-5G\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-331",
        "domain": "ontokin",
        "question": "Can you tell me the number of chemical reactions mentioned in the mechanism in this source https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-354",
        "domain": "ontocompchem",
        "question": "Can you tell me the total energy of H3N?",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H3N\" .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-211",
        "domain": "ontokin",
        "question": "What is the transport model of CY235JA across all the reaction mechanisms in which it appears",
        "query": {
            "sparql": "SELECT ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"CY235JA\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-401",
        "domain": "ontocompchem",
        "question": "Can you find me information on the HOMO-1 energy and the highest occupied molecular orbital energy of H- using the M06 theory level?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-928",
        "domain": "ontospecies",
        "question": "What is the polar surface area and surface tension of 1-methyl-4-nitrobenzene",
        "query": {
            "sparql": "SELECT ?PolarSurfaceArea ?SurfaceTension WHERE {\n  VALUES ?Species { \"1-methyl-4-nitrobenzene\" }\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-916",
        "domain": "ontospecies",
        "question": "Can you list the nitroarene compounds with a vapor pressure of 20.0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue = 20.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"nitroarene\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-671",
        "domain": "ontospecies",
        "question": "Can you tell me the count of non-hydrogen atoms present in a 1,2-xylene molecule?",
        "query": {
            "sparql": "SELECT ?HeavyAtomCount WHERE {\n  VALUES ?Species { \"1,2-xylene\" }\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-987",
        "domain": "ontospecies",
        "question": "I need to find out the LogS for CN(C)CCC(C1=CC=C(C=C1)Br)C2=CC=CC=N2.",
        "query": {
            "sparql": "SELECT ?LogS WHERE {\n  VALUES ?Species { \"CN(C)CCC(C1=CC=C(C=C1)Br)C2=CC=CC=N2\" }\n  ?Species os:hasLogS ?LogS .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-166",
        "domain": "ontospecies",
        "question": "What's the molecular weight and number of undefined bond stereocenters and atom chiral undefs for an organic cyclic compound that falls under the diarylmethane class and is also a cyclic compound?",
        "query": {
            "sparql": "SELECT ?MolecularWeight ?BondChiralUndefCount ?AtomChiralUndefCount WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic cyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"diarylmethane\" .\n  ?Species os:hasChemicalClass/rdfs:label \"cyclic compound\" .\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-322",
        "domain": "ontocompchem",
        "question": "What is the NHOMO energy and HOMO energy of Cd calculated at the M06-2X level of theory using the aug-cc-pVTZ basis set",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-92",
        "domain": "ontokin",
        "question": "What type of chemical reaction produces CH3COCH2CO as a product?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"CH3COCH2CO\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-362",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction H + HO2 <=> H2O + O that is mentioned in https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + HO2 <=> H2O + O\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-123",
        "domain": "ontocompchem",
        "question": "I'm looking to find the most optimal geometry for Pa use with the 6-311G basis set, considering all theory levels.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pa\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-810",
        "domain": "ontospecies",
        "question": "Can you list the chemical species with a molecular weight less than or equal to 187.08800000000002?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue <= 187.08800000000002 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-188",
        "domain": "ontospecies",
        "question": "Can you list the chemical species classified as organic molecular entity and have a solubility of less than or equal to 0.1771?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue <= 0.1771 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-229",
        "domain": "ontokin",
        "question": "For DMM2_OOH3_OO7, what is its transport model and thermodynamic model across all the reaction mechanisms in which it appears",
        "query": {
            "sparql": "SELECT ?TransportModel ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"DMM2_OOH3_OO7\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-489",
        "domain": "ontospecies",
        "question": "What are the chemical species whose bond stereocenter count is lower than 1 and chemical class is cyclic compound and undefined atom stereocenter count is inside the range (-1, 1.0)",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue < 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"cyclic compound\" .\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue > -1 && ?AtomChiralUndefCountValue < 1.0 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-118",
        "domain": "ontokin",
        "question": "I need to find the quantity of chemical reactions using MF3D2J and MEK as reactants, producing MN6OXO5J listed in this mechanism https://doi.org/10.1002/kin.20026.",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MF3D2J\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MN6OXO5J\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MEK\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-637",
        "domain": "ontospecies",
        "question": "I'm looking for information on the optical rotation of C6H5Cl and CC1=C(C(=CC=C1)C)N.",
        "query": {
            "sparql": "SELECT ?OpticalRotation WHERE {\n  VALUES ?Species { \"C6H5Cl\" \"CC1=C(C(=CC=C1)C)N\" }\n  ?Species os:hasOpticalRotation ?OpticalRotation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-900",
        "domain": "ontospecies",
        "question": "Can you tell me the flash point for benzene-1,2-dicarboxylic acid didecyl ester?",
        "query": {
            "sparql": "SELECT ?FlashPoint WHERE {\n  VALUES ?Species { \"benzene-1,2-dicarboxylic acid didecyl ester\" }\n  ?Species os:hasFlashPoint ?FlashPoint .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-93",
        "domain": "ontokin",
        "question": "Can you show me the kinetic model of a chemical transformation turning C4H9S4XCC6H10 into MNKET46O?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C4H9S4XCC6H10\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MNKET46O\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-883",
        "domain": "ontospecies",
        "question": "How many chiral bonds does InChI=1S/C6H14S2/c1-3-5-7-8-6-4-2/h3-6H2,1-2H3 have?",
        "query": {
            "sparql": "SELECT ?BondChiralCount WHERE {\n  VALUES ?Species { \"InChI=1S/C6H14S2/c1-3-5-7-8-6-4-2/h3-6H2,1-2H3\" }\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-459",
        "domain": "ontokin",
        "question": "Looking for a chemical reaction where the outcome is C8OOH3-1.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C8OOH3-1\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-913",
        "domain": "ontospecies",
        "question": "For ethylbenzene, what is its enthalpy of sublimation",
        "query": {
            "sparql": "SELECT ?EnthalpyOfSublimation WHERE {\n  VALUES ?Species { \"ethylbenzene\" }\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-914",
        "domain": "ontospecies",
        "question": "What is the hydrophobicity of InChI=1S/C10H11N3O3S/c1-7-6-10(12-16-7)13-17(14,15)9-4-2-8(11)3-5-9/h2-6H,11H2,1H3,(H,12,13) and InChI=1S/C6H14/c1-4-6(3)5-2/h6H,4-5H2,1-3H3 and 1-butanol",
        "query": {
            "sparql": "SELECT ?Hydrophobicity WHERE {\n  VALUES ?Species { \"InChI=1S/C10H11N3O3S/c1-7-6-10(12-16-7)13-17(14,15)9-4-2-8(11)3-5-9/h2-6H,11H2,1H3,(H,12,13)\" \"InChI=1S/C6H14/c1-4-6(3)5-2/h6H,4-5H2,1-3H3\" \"1-butanol\" }\n  ?Species os:hasHydrophobicity ?Hydrophobicity .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-828",
        "domain": "ontospecies",
        "question": "I need to find out the number of chiral atoms in these substances: C1C=CC(=O)O1, CO and 1,3-dinitrobenzene.",
        "query": {
            "sparql": "SELECT ?AtomChiralDefCount WHERE {\n  VALUES ?Species { \"C1C=CC(=O)O1\" \"CO\" \"1,3-dinitrobenzene\" }\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-359",
        "domain": "ontocompchem",
        "question": "Can you find the calculated zero point energy for O2 using the UB3LYP level?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-131",
        "domain": "ontocompchem",
        "question": "What is the NHOMO energy of Th, specifying the level of theory at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Th\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-41",
        "domain": "ontospecies",
        "question": "What is the number of non-hydrogen atoms of C2H3ClO",
        "query": {
            "sparql": "SELECT ?HeavyAtomCount WHERE {\n  VALUES ?Species { \"C2H3ClO\" }\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-488",
        "domain": "ontokin",
        "question": "What is the kinetic model for a chemical reaction where CH3CH2NH is the reactant and CY1005 is the product?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CH3CH2NH\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"CY1005\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-586",
        "domain": "ontospecies",
        "question": "I'm looking for polyatomic entity type chemicals that have a density below 1.40151 and their logP is exactly 1.37, but not more than 1.5070000000000003.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue < 1.40151 )\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue <= 1.5070000000000003 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-468",
        "domain": "ontokin",
        "question": "Can you find the transport and thermodynamic model used for C6H11OOH1-5 in all its involved reactions?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"C6H11OOH1-5\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-173",
        "domain": "ontospecies",
        "question": "I need to know the distinct characteristics of both InChI=1S/C23H48/c1-3-5-7-9-11-13-15-17-19-21-23-22-20-18-16-14-12-10-8-6-4-2/h3-23H2,1-2H3 and C4H10O2.",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"InChI=1S/C23H48/c1-3-5-7-9-11-13-15-17-19-21-23-22-20-18-16-14-12-10-8-6-4-2/h3-23H2,1-2H3\" \"C4H10O2\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-921",
        "domain": "ontospecies",
        "question": "I need to find chemical species with a classification of chemical entity, in the class of carboxylic ester and a flash point below 321.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"carboxylic ester\" .\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue < 321 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-48",
        "domain": "ontocompchem",
        "question": "What is the HOMO energy of Sc, specifying the level of theory at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Sc\" .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-7",
        "domain": "ontokin",
        "question": "Can you help me find the chemical reaction involving C8H16O3-6 and MEMOOH2J forming C7H14OOH2-6O2 as described in the study https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C8H16O3-6\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MEMOOH2J\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C7H14OOH2-6O2\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-341",
        "domain": "ontocompchem",
        "question": "Can you give me information on the total Gibbs free energy of Tc over all theoretical levels and basis sets?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tc\" .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-456",
        "domain": "ontokin",
        "question": "For the chemical reaction that has reactant MDCY793O and has reactant NC8KET46O, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDCY793O\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"NC8KET46O\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-70",
        "domain": "ontocompchem",
        "question": "I need the total Gibbs free energy of Ne, how much is it when calculated with STO-3G basis set?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ne\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-326",
        "domain": "ontokin",
        "question": "What is the reaction mechanism that invovles the reaction H + O2 (+ H2) <=> HO2 (+ H2)",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H + O2 (+ H2) <=> HO2 (+ H2)\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-279",
        "domain": "ontokin",
        "question": "For CH3-3-C6H7-135, what is its transport model across all the reaction mechanisms in which it appears",
        "query": {
            "sparql": "SELECT ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"CH3-3-C6H7-135\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-204",
        "domain": "ontocompchem",
        "question": "What is the SLUMO energy of H3N calculated using the aug-cc-pVDZ or CC-pVQZ basis set",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H3N\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" \"CC-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-325",
        "domain": "ontospecies",
        "question": "Can you list the chemical species with boiling points below 408.020536?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue < 408.020536 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-339",
        "domain": "ontospecies",
        "question": "I'm looking for information on the various properties of C6H6N2O.",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"C6H6N2O\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-451",
        "domain": "ontocompchem",
        "question": "In the STO-3G basis set, what are the rotational constants, energy of LUMO+2, and HOMO energy for Pt?",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?LUMOPlus2Energy ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pt\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-934",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species classified as both a cyclic compound and a heterocyclic compound, specifically within the class of chloropyridine.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"cyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heterocyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"chloropyridine\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-464",
        "domain": "ontocompchem",
        "question": "What is the LUMO energy of Ar across all level of theory and basis set",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ar\" .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-376",
        "domain": "ontocompchem",
        "question": "What's the calculation of zero point and LUMO energies of ClI considering the level of theory?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LUMOEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClI\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-362",
        "domain": "ontocompchem",
        "question": "What's the total energy of Eu calculated using every level of theory?",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Eu\" .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-775",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that fall under the bisphenol class and are classified as organosulfur compound?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"bisphenol\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organosulfur compound\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-315",
        "domain": "ontokin",
        "question": "Can you provide the kinetic model of the chemical reaction where CH3OCH2OCH2OO is the reactant and AR is the product from this link https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"CH3OCH2OCH2OO\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"AR\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-674",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species where the number of atom stereocenters is not more than two.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue <= 2 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-337",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has product CH3NO and has reactant CCYCCOOC-T1",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"CH3NO\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"CCYCCOOC-T1\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-252",
        "domain": "ontokin",
        "question": "What is the reaction mechanism that invovles C7H14O-E35",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"C7H14O-E35\" .\n}"
        }
    }
]