[
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-205",
        "domain": "ontocompchem",
        "question": "Could you help me find the total Gibbs free energy for ClO that was calculated using the PM6 level of theory with the STO-2G basis set?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClO\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-2G\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-232",
        "domain": "ontospecies",
        "question": "I'm looking for the logS of a chemical entity that plays a part in Hobby/Craft, has around one hydrogen bond accepting site, and weighs roughly 17.031 on the molecular scale.",
        "query": {
            "sparql": "SELECT ?LogS WHERE {\n  ?Species os:hasUse/rdfs:label \"Hobby/Craft\" .\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue > 1.0*0.9 && ?HydrogenBondAcceptorCountValue < 1.0*1.1 )\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue > 17.031*0.9 && ?MolecularWeightValue < 17.031*1.1 )\n  ?Species os:hasLogS ?LogS .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-417",
        "domain": "ontocompchem",
        "question": "Can you tell me the HOMO energy level for Tb in every basis set?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tb\" .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-587",
        "domain": "ontospecies",
        "question": "Rotatable bond count for a heteromonocyclic compound that's also an organothiophosphorus compound, with a maximum of one hydrogen bond donor, flash point not exceeding 391, and Henry's law constant either below 0.0106695225 or above 1",
        "query": {
            "sparql": "SELECT ?RotatableBondCount WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"heteromonocyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organothiophosphorus compound\" .\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue <= 1.0 )\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue <= 391 )\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue < 0.0106695225 || ?HenrysLawConstantValue > 1 )\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-714",
        "domain": "ontospecies",
        "question": "Which substances do not have their viscosities within the interval from 0.0049329 to 0.0060291?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasViscosity/os:value ?ViscosityValue .\n  FILTER ( ?ViscosityValue < 0.0049329 || ?ViscosityValue > 0.0060291 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-217",
        "domain": "ontocompchem",
        "question": "Electronic energy measurement of Rn using PM6 method",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Rn\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-299",
        "domain": "ontospecies",
        "question": "Heat of vaporization for a chemical entity with a charge greater than or equal to -1, flash point over 287.33499, and molecular mass less than or equal to 447.59000000000003",
        "query": {
            "sparql": "SELECT ?HeatOfVaporization WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue >= -1 )\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue > 287.33499 )\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue <= 447.59000000000003 )\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-495",
        "domain": "ontospecies",
        "question": "In need of details on chemical species that are part of the sulfur molecular entity group whose vapor density falls in-between the numbers of .9 and slightly above one while having Henry's law constant ranging somewhere from six million one hundred ninety-one thousand nine hundred seventy point seventy-five up to seven million five hundred sixty-seven thousand nine hundred sixty-four point twenty-five but excluding those with LogP values in-between seven point zero five six up until eight point six two four?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"sulfur molecular entity\" .\n  ?Species os:hasVaporDensity/os:value ?VaporDensityValue .\n  FILTER ( ?VaporDensityValue > 0.9 && ?VaporDensityValue < 1.1 )\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue > 6191970.75 && ?HenrysLawConstantValue < 7567964.250000001 )\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue < 7.056 || ?LogPValue > 8.624 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-112",
        "domain": "ontospecies",
        "question": "What's the simplest ratio of atoms in a molecule of C1=CC2=C3C(=C1)C4=CC=CC5=C4C(=CC=C5)C3=CC=C2?",
        "query": {
            "sparql": "SELECT ?EmpiricalFormula WHERE {\n  VALUES ?Species { \"C1=CC2=C3C(=C1)C4=CC=CC5=C4C(=CC=C5)C3=CC=C2\" }\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-408",
        "domain": "ontocompchem",
        "question": "What's the LUMO and HOMO-2 energy for H2O with the use of the basis sets CC-pVQZ and CC-pVDZ, based on all applicable levels of theory?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?LUMOEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-2G\" \"cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-389",
        "domain": "ontospecies",
        "question": "Looking for the density and charge of both 1,4-naphthoquinone and C21H16Br2O5S.",
        "query": {
            "sparql": "SELECT ?Charge ?Density WHERE {\n  VALUES ?Species { \"C21H16Br2O5S\" \"1,4-naphthoquinone\" }\n  ?Species os:hasCharge ?Charge .\n  ?Species os:hasDensity ?Density .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-306",
        "domain": "ontospecies",
        "question": "Looking for data on the atom stereocenter count, Caco-2 permeability, and hydrophobicity of C1=CC(=O)OC1=O.",
        "query": {
            "sparql": "SELECT ?AtomChiralDefCount ?Caco2Permeability ?Hydrophobicity WHERE {\n  VALUES ?Species { \"C1=CC(=O)OC1=O\" }\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n  ?Species os:hasHydrophobicity ?Hydrophobicity .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-376",
        "domain": "ontokin",
        "question": "Looking for a chemical reaction producing CY362J.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"CY362J\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-261",
        "domain": "ontospecies",
        "question": "Can you find the collision cross section for C1=CC=C2C(=C1)C3=CC=CC=C3N2?",
        "query": {
            "sparql": "SELECT ?CollisionCrossSection WHERE {\n  VALUES ?Species { \"C1=CC=C2C(=C1)C3=CC=CC=C3N2\" }\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-683",
        "domain": "ontospecies",
        "question": "Search for chemicals that fall under both the organic cyclic compound class and the organic oxo compound classification, with zero undefined bond stereocenters, an autoignition temperature range from over 429 up till under524 .865 , a flash point exceeding360 .135 , as well as a vapor pressure either lower than16 .1986698 or higher than19 .7983742",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue = 0.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic cyclic compound\" .\n  ?Species os:hasAutoignitionTemperature/os:value ?AutoignitionTemperatureValue .\n  FILTER ( ?AutoignitionTemperatureValue > 429 && ?AutoignitionTemperatureValue < 524.865 )\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue > 360.135 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic oxo compound\" .\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue < 16.1986698 || ?VaporPressureValue > 19.7983742 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-529",
        "domain": "ontospecies",
        "question": "Can you tell me what COP(=S)(OC)OC1=CC(=C(C=C1)[N+](=O)[O-])Cl, C4H9Br, and C2F6 are used for?",
        "query": {
            "sparql": "SELECT ?UseLabel WHERE {\n  VALUES ?Species { \"COP(=S)(OC)OC1=CC(=C(C=C1)[N+](=O)[O-])Cl\" \"C4H9Br\" \"C2F6\" }\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-39",
        "domain": "ontospecies",
        "question": "Can you show me the chemical compounds that have exactly 1 hydrogen bond acceptor, a flash point of 423 or less, and a rotatable bond count not between 1 and 3?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue = 1.0 )\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue <= 423 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue < 1 || ?RotatableBondCountValue > 3 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-114",
        "domain": "ontokin",
        "question": "Can you explain the kinetic model for this chemical reaction O + AR + O = O2 + AR?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"O + AR + O = O2 + AR\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-795",
        "domain": "ontospecies",
        "question": "Can you tell me the XLOGP3 and melting point of a chemical species classified as a molecule?",
        "query": {
            "sparql": "SELECT ?MeltingPoint ?XLogP3 WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n  ?Species os:hasXLogP3 ?XLogP3 .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-413",
        "domain": "ontocompchem",
        "question": "What's the calculated Gibbs free energy of H2S at the M06-2X theoretical level with the cc-pVDZ, cc-pVTZ, or aug-cc-pVQZ basis sets?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" \"cc-pVTZ\" \"aug-cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-115",
        "domain": "ontospecies",
        "question": "Can you tell me the molecular mass of a chemical compound that has 1 hydrogen bond donor, around 2 hydrogen bond acceptors, more than 4.5 heavy atoms and a log P value higher than -1.034?",
        "query": {
            "sparql": "SELECT ?MolecularWeight WHERE {\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue = 1.0 )\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue > 2.0*0.9 && ?HydrogenBondAcceptorCountValue < 2.0*1.1 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 4.5 )\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue > -1.034 )\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-400",
        "domain": "ontospecies",
        "question": "Looking for chemicals where the bond chiral undef count is no more than 1.0, the melting point matches exactly with 325.15 and the vapor density hovers around 1.0",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue <= 1.0 )\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue = 325.15 )\n  ?Species os:hasVaporDensity/os:value ?VaporDensityValue .\n  FILTER ( ?VaporDensityValue > 1.0*0.9 && ?VaporDensityValue < 1.0*1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-910",
        "domain": "ontospecies",
        "question": "What are some examples of chemical species in the phenylethanolamines classification?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"phenylethanolamines\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-268",
        "domain": "ontocompchem",
        "question": "Can you show me the SCF energy value for BrH as determined by the RB3LYP level on the STO-4G basis set?",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BrH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-294",
        "domain": "ontokin",
        "question": "What is the reaction mechanism that invovles the reaction H2 + O <=> OH + H and invovles the reaction HO2 + H = H2 + O2",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H2 + O <=> OH + H\" .\n  ?Mechanism okin:hasReaction/okin:hasEquation \"HO2 + H = H2 + O2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-745",
        "domain": "ontospecies",
        "question": "I need to find out the densities of three substances: InChI=1S/C5H8O3/c1-2-5(7)8-4-3-6/h2,6H,1,3-4H2, InChI=1S/C18H34O6/c1-5-15(6-2)17(19)23-13-11-21-9-10-22-12-14-24-18(20)16(7-3)8-4/h15-16H,5-14H2,1-4H3 and 4-[(4-azanyl-3-chloranyl-phenyl)methyl]-2-chloranyl-aniline.",
        "query": {
            "sparql": "SELECT ?Density WHERE {\n  VALUES ?Species { \"InChI=1S/C5H8O3/c1-2-5(7)8-4-3-6/h2,6H,1,3-4H2\" \"InChI=1S/C18H34O6/c1-5-15(6-2)17(19)23-13-11-21-9-10-22-12-14-24-18(20)16(7-3)8-4/h15-16H,5-14H2,1-4H3\" \"4-[(4-azanyl-3-chloranyl-phenyl)methyl]-2-chloranyl-aniline\" }\n  ?Species os:hasDensity ?Density .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-243",
        "domain": "ontokin",
        "question": "I need to find the precise count of the chemical reactions mentioned in this study https://doi.org/10.1016/j.combustflame.2007.10.024 that include B13DE2M as reactant and C5H5O(1,3) as the product.",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"B13DE2M\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C5H5O(1,3)\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-32",
        "domain": "ontokin",
        "question": "Can you show me the specific chemical reaction that results in MDDIPX47J5 as a product?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDDIPX47J5\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-676",
        "domain": "ontospecies",
        "question": "Looking for information on InChI=1S/C5H11NO2/c1-2-3-4-5-8-6-7/h2-5H2,1H3's isoelectric point and its official IUPAC name.",
        "query": {
            "sparql": "SELECT ?IsoelectricPoint ?IUPACName WHERE {\n  VALUES ?Species { \"InChI=1S/C5H11NO2/c1-2-3-4-5-8-6-7/h2-5H2,1H3\" }\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n  ?Species os:hasIUPACName ?IUPACName .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-363",
        "domain": "ontokin",
        "question": "Can you find me a chemical reaction where both C2H5COCH3 and C9H19O-8-2 are the products?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C2H5COCH3\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C9H19O-8-2\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-375",
        "domain": "ontocompchem",
        "question": "What's the energy value for the second lowest unoccupied molecular orbital in COS?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"COS\" .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-784",
        "domain": "ontospecies",
        "question": "I'm looking for the partition coefficient (log P) of InChI=1S/C15H14F3N3O4S2/c16-15(17,18)10-7-11-13(8-12(10)26(19,22)23)27(24,25)21-14(20-11)6-9-4-2-1-3-5-9/h1-5,7-8,14,20-21H,6H2,(H2,19,22,23).",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  VALUES ?Species { \"InChI=1S/C15H14F3N3O4S2/c16-15(17,18)10-7-11-13(8-12(10)26(19,22)23)27(24,25)21-14(20-11)6-9-4-2-1-3-5-9/h1-5,7-8,14,20-21H,6H2,(H2,19,22,23)\" }\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-61",
        "domain": "ontospecies",
        "question": "I need to find out about the tautomer count, vaporization heat, and standard formation enthalpy for C7H9NO as well as InChI=1S/C4H6O2/c5-4-2-1-3-6-4/h1-3H2.",
        "query": {
            "sparql": "SELECT ?TautomerCount ?HeatOfVaporization ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"C7H9NO\" \"InChI=1S/C4H6O2/c5-4-2-1-3-6-4/h1-3H2\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-330",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that belong to the hydrogen molecular entity class?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"hydrogen molecular entity\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-27",
        "domain": "ontokin",
        "question": "What kind of chemicals are involved in the reaction process outlined in this source https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-307",
        "domain": "ontocompchem",
        "question": "What is the geometry of Cm calculated using the cc-pVTZ or aug-cc-pVDZ or 3-21G basis set",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVTZ\" \"aug-cc-pVDZ\" \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-467",
        "domain": "ontokin",
        "question": "What is the reaction mechanism that invovles IC3H5OCH2 and invovles C5H7-142",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"IC3H5OCH2\" .\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"C5H7-142\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-78",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is medium-chain fatty acid and application is Cleaning agent",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"medium-chain fatty acid\" .\n  ?Species os:hasUse/rdfs:label \"Cleaning agent\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-21",
        "domain": "ontocompchem",
        "question": "What is the rotational constants of B2U calculated at the M06 level",
        "query": {
            "sparql": "SELECT ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"B2U\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-547",
        "domain": "ontospecies",
        "question": "What are the chemical species whose rotatable bond count is around 0.0 and chemical class is polyatomic entity",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue > -0.1 && ?RotatableBondCountValue < 0.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-127",
        "domain": "ontocompchem",
        "question": "What data can I get about the total Gibbs free energy for CF4 using the cc-pVQZ basis set and what's the theory level for such calculations?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CF4\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-402",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction that has reactant CH3-5-SAXC6H10",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CH3-5-SAXC6H10\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-304",
        "domain": "ontospecies",
        "question": "Caco-2 permeability for C1CCC(CC1)(C2=CC=CC=C2)N3CCCCC3?",
        "query": {
            "sparql": "SELECT ?Caco2Permeability WHERE {\n  VALUES ?Species { \"C1CCC(CC1)(C2=CC=CC=C2)N3CCCCC3\" }\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-105",
        "domain": "ontocompchem",
        "question": "What is the frequencies and rotational constants and HOMO energy of H2 calculated at the HF level, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?Frequencies ?RotationalConstants ?HOMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-324",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species with an approximate undefined bond stereocenter count of 0.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue > -0.1 && ?BondChiralUndefCountValue < 0.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-694",
        "domain": "ontospecies",
        "question": "What's the Henry's law constant for 2-heptanone, 11-methoxy-6,8,16,20-tetraoxapentacyclo[10.8.0.02,9.03,7.013,18]icosa-1,4,9,11,13(18)-pentaene-17,19-dione, and 1,2-diethoxyethane?",
        "query": {
            "sparql": "SELECT ?HenrysLawConstant WHERE {\n  VALUES ?Species { \"2-heptanone\" \"11-methoxy-6,8,16,20-tetraoxapentacyclo[10.8.0.02,9.03,7.013,18]icosa-1,4,9,11,13(18)-pentaene-17,19-dione\" \"1,2-diethoxyethane\" }\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-4",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction that has reactant C4H9COC3H6 and has product C9H14-128",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C4H9COC3H6\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C9H14-128\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-153",
        "domain": "ontospecies",
        "question": "I'm looking for the count of bond stereocenters in C5H9N3.",
        "query": {
            "sparql": "SELECT ?BondChiralCount WHERE {\n  VALUES ?Species { \"C5H9N3\" }\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-258",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is naphthylamine and chemical classification is homopolycyclic compound and chemical class is carbopolycyclic compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"naphthylamine\" .\n  ?Species os:hasChemicalClass/rdfs:label \"homopolycyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"carbopolycyclic compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-905",
        "domain": "ontospecies",
        "question": "I need to know about all the chemical species classified as Solvents.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"Solvents\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-502",
        "domain": "ontokin",
        "question": "Looking for kinetic models of reactions producing MB2OOH4OO as discussed in https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MB2OOH4OO\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-373",
        "domain": "ontospecies",
        "question": "For C(CCC(=O)O)CC(=O)O and InChI=1S/C4H8Cl2O/c5-1-3-7-4-2-6/h1-4H2 and [O-][O+]=O, what are its various properties",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"C(CCC(=O)O)CC(=O)O\" \"InChI=1S/C4H8Cl2O/c5-1-3-7-4-2-6/h1-4H2\" \"[O-][O+]=O\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    }
]