[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-781",
        "domain": "ontospecies",
        "question": "Can you find the surface tension of a chemical species that is used as an Intermediate and a polar aprotic solvent, has a mono isotopic weight over 47.723895, serves as a carcinogenic agent, possesses an atom chiral undef count not within -1.0 to 1.0 range, and has its melting point outside the interval of 171.835002 to 211?",
        "query": {
            "sparql": "SELECT ?SurfaceTension WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 47.723895 )\n  ?Species os:hasUse/rdfs:label \"Intermediate\" .\n  ?Species os:hasUse/rdfs:label \"carcinogenic agent\" .\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue < -1.0 || ?AtomChiralUndefCountValue > 1.0 )\n  ?Species os:hasUse/rdfs:label \"polar aprotic solvent\" .\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue < 171.835002 || ?MeltingPointValue > 211 )\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-353",
        "domain": "ontospecies",
        "question": "For InChI=1S/C3H7NO2/c1-2(4)3(5)6/h2H,4H2,1H3,(H,5,6)/t2-/m0/s1 and COC1=CC(=C(C=C1Cl)OC)Cl, what is their log P",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  VALUES ?Species { \"InChI=1S/C3H7NO2/c1-2(4)3(5)6/h2H,4H2,1H3,(H,5,6)/t2-/m0/s1\" \"COC1=CC(=C(C=C1Cl)OC)Cl\" }\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-827",
        "domain": "ontospecies",
        "question": "Can you tell me about the hydrophobic nature and viscosity level of 2-butoxyethanol?",
        "query": {
            "sparql": "SELECT ?Hydrophobicity ?Viscosity WHERE {\n  VALUES ?Species { \"2-butoxyethanol\" }\n  ?Species os:hasHydrophobicity ?Hydrophobicity .\n  ?Species os:hasViscosity ?Viscosity .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-872",
        "domain": "ontospecies",
        "question": "What are the chemical species whose LogP is not less than 2 and chemical class is molecular entity",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue >= 2 )\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-103",
        "domain": "ontocompchem",
        "question": "Can you show me the molecular structure for O3?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"O3\" .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-728",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species classified as dopamine agonist, with dissociation constants under 9.153 or over 12, from the heteropolycyclic compound class, and an atom chiral undef count ranging from -1 to 1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"dopamine agonist\" .\n  ?Species os:hasDissociationConstants/os:value ?DissociationConstantsValue .\n  FILTER ( ?DissociationConstantsValue < 9.153 || ?DissociationConstantsValue > 12 )\n  ?Species os:hasChemicalClass/rdfs:label \"heteropolycyclic compound\" .\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue > -1 && ?AtomChiralUndefCountValue < 1 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-350",
        "domain": "ontocompchem",
        "question": "How can I determine the NHOMO and LUMO+2 energy of Xe when utilizing the aug-cc-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Xe\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-313",
        "domain": "ontocompchem",
        "question": "Can you give me information on the rotational constants for N2O, including the theory level and calculation basis set used?",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"N2O\" .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-375",
        "domain": "ontokin",
        "question": "I am trying to find out the count of chemical reactions where H2O is a reactant based on the mechanism detailed in www.osti.gov/servlets/purl/90098-26Ev73/webviewable/.",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C10OOH5-3O2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-729",
        "domain": "ontospecies",
        "question": "What kind of chemical species would be considered a molecule?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-67",
        "domain": "ontocompchem",
        "question": "Can you find the energy of the lowest unoccupied molecular orbital for Cu using the STO-2G or 3-21G basis set?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-2G\" \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-616",
        "domain": "ontospecies",
        "question": "I need to know the bond chiral count for any substance that melts above or at exactly 237.73499999999999 degrees, boils up to or exactly at 389.565 degrees, has a polar surface area lower than 26.510000000000005 and possesses less than two rotatable bonds?",
        "query": {
            "sparql": "SELECT ?BondChiralCount WHERE {\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue >= 237.73499999999999 )\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue <= 389.565 )\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue < 26.510000000000005 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue < 2 )\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-11",
        "domain": "ontocompchem",
        "question": "Calculate the zero point energy for H2 using the HF level of theory?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-50",
        "domain": "ontocompchem",
        "question": "Can you tell me the HOMO-2 energy of BrH when you calculate it with the G3 theory level and the 6-311+G basis set?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BrH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311+G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-437",
        "domain": "ontospecies",
        "question": "Can you list the heterocyclic compounds with an XLOGP3 value between 1.98 and 3 and a solubility greater than 0.3663?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"heterocyclic compound\" .\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value > 1.9800000000000002 && ?XLogP3Value < 3 )\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue > 0.36629999999999996 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-84",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that are classified as Solvents and used in Home Maintenance, with an atom chiral def count less than 1.0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue < 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"Solvents\" .\n  ?Species os:hasUse/rdfs:label \"Home Maintenance\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-794",
        "domain": "ontospecies",
        "question": "Can you find me the chemical species that are classified as ketone and have no undefined bond stereocenters?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"ketone\" .\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue = 0.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-612",
        "domain": "ontospecies",
        "question": "Can you tell me the empirical formula of C[Si](C)(C)Cl?",
        "query": {
            "sparql": "SELECT ?EmpiricalFormula WHERE {\n  VALUES ?Species { \"C[Si](C)(C)Cl\" }\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-964",
        "domain": "ontospecies",
        "question": "Can you tell me the monoisotopic weight of C1=CC=NC(=C1)N and how many hydrogen bond acceptors it has?",
        "query": {
            "sparql": "SELECT ?HydrogenBondAcceptorCount ?MonoIsotopicWeight WHERE {\n  VALUES ?Species { \"C1=CC=NC(=C1)N\" }\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-899",
        "domain": "ontospecies",
        "question": "Can you tell me the count of rotatable bonds in dicyclohexylamine?",
        "query": {
            "sparql": "SELECT ?RotatableBondCount WHERE {\n  VALUES ?Species { \"dicyclohexylamine\" }\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-37",
        "domain": "ontospecies",
        "question": "How many isotopic atoms are there in docosane?",
        "query": {
            "sparql": "SELECT ?IsotopeAtomCount WHERE {\n  VALUES ?Species { \"docosane\" }\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-800",
        "domain": "ontospecies",
        "question": "Can you find me chemical species that have about 1.0 covalent units, belong to the molecular entity class, and possess less than 1.1 hydrogen bond donors?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue > 1.0*0.9 && ?CovalentUnitCountValue < 1.0*1.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue < 1.1 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-138",
        "domain": "ontocompchem",
        "question": "I'm looking for information about the lowest unoccupied molecular orbital (LUMO) energy in all basis sets of FH.",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"FH\" .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-51",
        "domain": "ontocompchem",
        "question": "Could you show me the zero point energy of Pu using M06-2X theory with either 3-21G or cc-pVDZ basis sets?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-259",
        "domain": "ontocompchem",
        "question": "What is the LUMO+1 energy of Rh calculated at the PBE0 level of theory using the CC-pVTZ basis set",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Rh\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-447",
        "domain": "ontokin",
        "question": "I need to find the kinetic model of H + H + M <=> H2 + M chemical reaction.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + H + M <=> H2 + M\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-654",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species from the oxygen molecular entity class and Other Classes category with a charge more than -1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"oxygen molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"Other Classes\" .\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-984",
        "domain": "ontospecies",
        "question": "How many hydrogen bond acceptors does InChI=1S/C3H2F6O/c4-2(5,6)1(10)3(7,8)9/h1,10H have?",
        "query": {
            "sparql": "SELECT ?HydrogenBondAcceptorCount WHERE {\n  VALUES ?Species { \"InChI=1S/C3H2F6O/c4-2(5,6)1(10)3(7,8)9/h1,10H\" }\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-204",
        "domain": "ontokin",
        "question": "For the chemical reaction that has reactant Y-C7H14 and has reactant C2H5COCO and is involved in the mechanism found in www.osti.gov/servlets/purl/90098-26Ev73/webviewable/, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"Y-C7H14\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C2H5COCO\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-418",
        "domain": "ontokin",
        "question": "What are the kinetics involved in the chemical interaction of OH + H2O2 = H2O + HO2?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"OH + H2O2 = H2O + HO2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-282",
        "domain": "ontocompchem",
        "question": "I am looking for the rotational constants as well as the HOMO energy of Cl2, considering the level of theory and the basis set used in calculations.",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?HOMOEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cl2\" .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-484",
        "domain": "ontokin",
        "question": "Can you tell me about the kinetic model for a chemical reaction involving C12OOH4-8 as a reactant and L-C5H7 as a product as discussed in this link https://doi.org/10.1002/kin.20026?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C12OOH4-8\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"L-C5H7\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-166",
        "domain": "ontokin",
        "question": "Can you find the number of chemical reactions related to the mechanism described in https://doi.org/10.1002/kin.20026?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-20",
        "domain": "ontocompchem",
        "question": "Using M06-2X and 3-21G basis set, what is the calculation for the ground state energy, the total Gibbs free energy, as well as the HOMO-2 energy of Sc?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?TotalGibbsFreeEnergy ?HOMOMinus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Sc\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-215",
        "domain": "ontospecies",
        "question": "What are the chemical species whose vapor density is smaller than 5 and surface tension is around 20.7 and bond stereocenter count is not less than -1.0",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasVaporDensity/os:value ?VaporDensityValue .\n  FILTER ( ?VaporDensityValue < 5 )\n  ?Species os:hasSurfaceTension/os:value ?SurfaceTensionValue .\n  FILTER ( ?SurfaceTensionValue > 20.7*0.9 && ?SurfaceTensionValue < 20.7*1.1 )\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue >= -1.0 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-226",
        "domain": "ontokin",
        "question": "I'm looking for the kinetic model relating to a chemical reaction that uses MD7OOH8J as a reactant and produces MD79DMJ according to the mechanism in https://doi.org/10.1002/kin.20603.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD79DMJ\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD7OOH8J\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-336",
        "domain": "ontokin",
        "question": "How many types of chemical species can be found in the reaction mechanism at this link www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT (COUNT(?Species) AS ?SpeciesCount) WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-932",
        "domain": "ontospecies",
        "question": "I'm looking for the quantity of tautomers in C9H10O, can you help?",
        "query": {
            "sparql": "SELECT ?TautomerCount WHERE {\n  VALUES ?Species { \"C9H10O\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-858",
        "domain": "ontospecies",
        "question": "Can you tell me the Henry's law constant, ionization potential, and boiling point for CCCCOC(=O)C1=CC=CC=C1C(=O)OCCCC and C8H13NO2?",
        "query": {
            "sparql": "SELECT ?HenrysLawConstant ?IonizationPotential ?BoilingPoint WHERE {\n  VALUES ?Species { \"CCCCOC(=O)C1=CC=CC=C1C(=O)OCCCC\" \"C8H13NO2\" }\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n  ?Species os:hasIonizationPotential ?IonizationPotential .\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-936",
        "domain": "ontospecies",
        "question": "What are the chemical species whose boiling point is greater than or equal to 612.135 and undefined bond stereocenter count is < -1.0 or > 1.0 and atom chiral def count is smaller than 0 or greater than 2",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue >= 612.135 )\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue < -1.0 || ?BondChiralUndefCountValue > 1.0 )\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue < 0 || ?AtomChiralDefCountValue > 2 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-116",
        "domain": "ontokin",
        "question": "Can you show me the kinetic model of the reaction where HE + O + O <=> O2 + HE?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"HE + O + O <=> O2 + HE\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-94",
        "domain": "ontocompchem",
        "question": "I need to know the total energy for Cl2 calculated with the help of 3-21G or STO-6G basis set. Can you help?",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cl2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-243",
        "domain": "ontocompchem",
        "question": "Can you find the energy of Os at the G3 level using the 6-311+G basis set?",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Os\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311+G\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-321",
        "domain": "ontospecies",
        "question": "Search for chemical species, specifically those in the polyatomic entity class, with an exact monoisotopic mass of 294.90283 and whose melting point doesn't exceed 495.165?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue = 294.90283 )\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue <= 495.165 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-426",
        "domain": "ontocompchem",
        "question": "Can I find the energy of the lowest unoccupied molecular orbital for I2 calculated on the level of theory using the CC-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"I2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-33",
        "domain": "ontokin",
        "question": "I'm looking for the number of chemical reactions with MD7D5O and MEKETM2 as reactants and MN2OXO4J as a product in the mechanism outlined on this webpage: www.osti.gov/servlets/purl/90098-26Ev73/webviewable/.",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD7D5O\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MEKETM2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MN2OXO4J\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-60",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction H2O2 + H <=> H2 + HO2",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2O2 + H <=> H2 + HO2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-234",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction that has reactant C10OOH8-2E",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C10OOH8-2E\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-396",
        "domain": "ontospecies",
        "question": "Can you list the chemical species classified as both beta-lactam and organic molecule, and also belong to the heterocyclic antibiotic class?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"beta-lactam\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecule\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heterocyclic antibiotic\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-30",
        "domain": "ontospecies",
        "question": "Can you tell me about the different properties of CCCCCCCC?",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"CCCCCCCC\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-999",
        "domain": "ontospecies",
        "question": "What are some ether type chemicals that serve as Monomers and possess a Henry's law constant that doesn't exceed 1?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"ether\" .\n  ?Species os:hasUse/rdfs:label \"Monomers\" .\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue <= 1 )\n}"
        }
    }
]