[
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-434",
        "domain": "ontokin",
        "question": "MD9D9OOH7O2 production through chemical reactions, can you elaborate?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD9D9OOH7O2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-295",
        "domain": "ontospecies",
        "question": "Search for chemicals that fall under the classifications of steroid, cyclic ketone, and hydroxy steroid. They should have roughly no rotatable bonds, function as anabolic agents, with their melting points lying in the range of 381.735 to 467 degrees.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue > 381.735 && ?MeltingPointValue < 467 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue > -0.1 && ?RotatableBondCountValue < 0.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"steroid\" .\n  ?Species os:hasChemicalClass/rdfs:label \"cyclic ketone\" .\n  ?Species os:hasUse/rdfs:label \"anabolic agent\" .\n  ?Species os:hasChemicalClass/rdfs:label \"hydroxy steroid\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-427",
        "domain": "ontokin",
        "question": "Looking for a chemical reaction featured in the research https://doi.org/10.1002/kin.20026 that uses C7H15O-O3 to produce C8H16O6-7-2.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C8H16O6-7-2\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7H15O-O3\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-237",
        "domain": "ontokin",
        "question": "Can you explain the reaction mechanisms of H + HO2 <=> O2 + H2 and OH + HO2 = O2 + H2O?",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H + HO2 <=> O2 + H2\" .\n  ?Mechanism okin:hasReaction/okin:hasEquation \"OH + HO2 = O2 + H2O\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-716",
        "domain": "ontospecies",
        "question": "I'm looking for the count of rotatable bonds for these compounds: benzene-1,3-dicarboxylic acid, CCCCCCCCCC=C and C1C=CCS1(=O)=O.",
        "query": {
            "sparql": "SELECT ?RotatableBondCount WHERE {\n  VALUES ?Species { \"benzene-1,3-dicarboxylic acid\" \"CCCCCCCCCC=C\" \"C1C=CCS1(=O)=O\" }\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-398",
        "domain": "ontocompchem",
        "question": "Can you tell me the second lowest unoccupied molecular orbital energy and zero point energy of F6S when calculated with the HF level and CC-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F6S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-512",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is hydroxides",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"hydroxides\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-251",
        "domain": "ontospecies",
        "question": "What is the CID of a Nitriles chemical species with an undefined atom stereocenter count that's more than -1?",
        "query": {
            "sparql": "SELECT ?CID WHERE {\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue > -1 )\n  ?Species os:hasChemicalClass/rdfs:label \"Nitriles\" .\n  ?Species os:hasCID ?CID .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-251",
        "domain": "ontokin",
        "question": "What's the kinetic model of the H to HO2 chemical reaction explained in https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDCY80-4\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MH5OOH\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-376",
        "domain": "ontospecies",
        "question": "For C7H9N and N(F)(F)F and hexacosane, what is their molecular weight",
        "query": {
            "sparql": "SELECT ?MolecularWeight WHERE {\n  VALUES ?Species { \"C7H9N\" \"N(F)(F)F\" \"hexacosane\" }\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-902",
        "domain": "ontospecies",
        "question": "Looking for the compound complexity and number of rotatable bonds in an organic heterocyclic compound that functions as a Saccharomyces cerevisiae metabolite, has a monoisotopic weight above 100.82454750000001 but below 123.23000250000001, and has at least -1 bond chiral count.",
        "query": {
            "sparql": "SELECT ?CompoundComplexity ?RotatableBondCount WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 100.82454750000001 && ?MonoIsotopicWeightValue < 123.23000250000001 )\n  ?Species os:hasUse/rdfs:label \"Saccharomyces cerevisiae metabolite\" .\n  ?Species os:hasUse/rdfs:label \"Saccharomyces cerevisiae metabolite\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic heterocyclic compound\" .\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue >= -1.0 )\n  ?Species os:hasCompoundComplexity ?CompoundComplexity .\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-39",
        "domain": "ontocompchem",
        "question": "What is the SCF energy of HO2 across all basis set",
        "query": {
            "sparql": "SELECT ?SCFEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HO2\" .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-238",
        "domain": "ontocompchem",
        "question": "I need to know the total Gibbs free energy of Ac given the STO-6G basis set and the theory level used in the calculations.",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ac\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-384",
        "domain": "ontospecies",
        "question": "What are the chemical species whose rotatable bond count is lower than 6.6000000000000005 and compound complexity is smaller than 51 and heavy atom count is bigger than 8 and lower than 10",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue < 6.6000000000000005 )\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue < 51 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 8 && ?HeavyAtomCountValue < 10 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-98",
        "domain": "ontocompchem",
        "question": "Information on Pu's LUMO+2 energy calculation from B3LYP theoretical level and STO-4G basis set please.",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-979",
        "domain": "ontospecies",
        "question": "Can you find a hydroxy carboxylic acid with a bond chiral count greater than -1.0, classified as an oxygen molecular entity, has a log P of -2.22 and melts between 410 and 501.765 degrees?",
        "query": {
            "sparql": "SELECT ?MolecularFormula WHERE {\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > -1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"hydroxy carboxylic acid\" .\n  ?Species os:hasChemicalClass/rdfs:label \"oxygen molecular entity\" .\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue = -2.22 )\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue > 410 && ?MeltingPointValue < 501.76500000000004 )\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-174",
        "domain": "ontocompchem",
        "question": "Can you tell me the LUMO energy for Nb that's calculated at the PM6 level with the 4-31G basis set?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Nb\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"4-31G\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-978",
        "domain": "ontospecies",
        "question": "What are the different identifiers for CC?",
        "query": {
            "sparql": "SELECT ?IdentifierName WHERE {\n  VALUES ?Species { \"CC\" }\n  ?Species ?hasIdentifierName ?IdentifierName .\n  ?IdentifierName a/rdfs:subClassOf os:Identifier .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-415",
        "domain": "ontocompchem",
        "question": "What's the value of energy in the highest occupied molecular orbital (HOMO) of O2S when computed using cc-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"O2S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-175",
        "domain": "ontospecies",
        "question": "For the chemical species whose vapor pressure is bigger than 0.00016798621500000002 and role is Flame retardant and exact mass is around 382.1334, what is its PubChem ID and boiling point",
        "query": {
            "sparql": "SELECT ?CID ?BoilingPoint WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue > 0.00016798621500000002 )\n  ?Species os:hasUse/rdfs:label \"Flame retardant\" .\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 382.1334*0.9 && ?ExactMassValue < 382.1334*1.1 )\n  ?Species os:hasCID ?CID .\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-488",
        "domain": "ontospecies",
        "question": "I need information on molecule class chemicals with log P values less/equal to -0.261, rotatable bond counts either under 3 or over 5, and the compound complexity doesn't exceed 115.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue <= -0.261 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue < 3 || ?RotatableBondCountValue > 5 )\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue <= 115 )\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-358",
        "domain": "ontocompchem",
        "question": "What is the energy of second lowest unoccupied molecular orbital of F3N calculated at the UB3LYP level of theory, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F3N\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-249",
        "domain": "ontocompchem",
        "question": "What's the computed LUMO+2 energy for Md when the G3 method and the cc-pVTZ basis set are used?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Md\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-140",
        "domain": "ontocompchem",
        "question": "I need information on the NHOMO energy of Ar using the RB3LYP level with the CC-pVDZ basis set.",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Bk\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-73",
        "domain": "ontospecies",
        "question": "I'm looking for a list of chemical species that belong to the classifications: cyclic compound, organic aromatic compound, and are also in the class of both a molecule and ahomocyclic compound. They should have an exact mass exceeding 147.675348.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"cyclic compound\" .\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 147.675348 )\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic aromatic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"homocyclic compound\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-382",
        "domain": "ontocompchem",
        "question": "I'm searching for the rotational constants of Hg that are derived at the CCSD(T) level with a aug-cc-pVQZ basis set, can you help?",
        "query": {
            "sparql": "SELECT ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Hg\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-543",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species classified as organic molecular entity, can you help?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-90",
        "domain": "ontokin",
        "question": "Can you help me find the kinetic model of the reaction using C10H21O2-3 and producing C5H12-M2 from the process documented in www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C10H21O2-3\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C5H12-M2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-889",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is Other Classes and chemical class is polybromodiphenyl ether and Henry's law constant is not greater than 0.00132634425 and chemical class is organic cyclic compound and melting point is greater than 520",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"Other Classes\" .\n  ?Species os:hasChemicalClass/rdfs:label \"polybromodiphenyl ether\" .\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue <= 0.00132634425 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic cyclic compound\" .\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue > 520 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-567",
        "domain": "ontospecies",
        "question": "What are the chemical species whose atom chiral def count is inside the range (4, 6) and chemical classification is glycosyl compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue > 4 && ?AtomChiralDefCountValue < 6 )\n  ?Species os:hasChemicalClass/rdfs:label \"glycosyl compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-660",
        "domain": "ontospecies",
        "question": "What is the Caco-2 permeability of the chemical species whose vapor pressure is not greater than 1",
        "query": {
            "sparql": "SELECT ?Caco2Permeability WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue <= 1 )\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-38",
        "domain": "ontospecies",
        "question": "What are the chemical species whose atom chiral count is bigger than -1 and smaller than 1 and rotatable bond count is > 0 and lower than 2 and exact mass is bigger than 170.98697700000002 and flash point is <= 441.265",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue > -1 && ?AtomChiralCountValue < 1 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue > 0 && ?RotatableBondCountValue < 2 )\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 170.98697700000002 )\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue <= 441.265 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-370",
        "domain": "ontocompchem",
        "question": "Searching for the energy value of ClO's lowest unoccupied molecular orbital at the UB3LYP level using the cc-pVDZ basis set.",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClO\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-1005",
        "domain": "ontospecies",
        "question": "What's the solubility logarithm, or LogS, of C2H5Cl?",
        "query": {
            "sparql": "SELECT ?LogS WHERE {\n  VALUES ?Species { \"C2H5Cl\" }\n  ?Species os:hasLogS ?LogS .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-406",
        "domain": "ontokin",
        "question": "Can I find the kinetic model of the chemical reaction producing MDCY37-8 in this mechanism https://doi.org/10.1002/kin.20026?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDCY37-8\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-80",
        "domain": "ontocompchem",
        "question": "According to the B3LYP theoretical level, what's the optimal geometry for F-?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-879",
        "domain": "ontospecies",
        "question": "Can you tell me the standard enthalpy of formation values for both CC1=C(C(=C(C=C1[N+](=O)[O-])[N+](=O)[O-])O)[N+](=O)[O-] and C9H11NO2?",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"CC1=C(C(=C(C=C1[N+](=O)[O-])[N+](=O)[O-])O)[N+](=O)[O-]\" \"C9H11NO2\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-0",
        "domain": "ontocompchem",
        "question": "Find info on the specific theory level used for calculating CH4's total enthalpy and frequencies based on the 6-311G or CC-pVDZ basis set.",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy ?Frequencies ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CH4\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-986",
        "domain": "ontospecies",
        "question": "For the chemical species whose chemical classification is chlorophenol and polar surface area is smaller than 22.220000000000002 and chemical classification is organic aromatic compound and vapor pressure is bigger than 2.0758295700000002 and chemical classification is carbon group molecular entity, what is its charge",
        "query": {
            "sparql": "SELECT ?Charge WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"chlorophenol\" .\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue < 22.220000000000002 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic aromatic compound\" .\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue > 2.0758295700000002 )\n  ?Species os:hasChemicalClass/rdfs:label \"carbon group molecular entity\" .\n  ?Species os:hasCharge ?Charge .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-138",
        "domain": "ontospecies",
        "question": "Can you tell me the heat of vaporization for C19H26O3?",
        "query": {
            "sparql": "SELECT ?HeatOfVaporization WHERE {\n  VALUES ?Species { \"C19H26O3\" }\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-441",
        "domain": "ontokin",
        "question": "Which chemical reaction uses C12OOH4-OO6-2 in its reactant phase?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C12OOH4-OO6-2\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-453",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has product C7H13DIPX24J7 and is involved in the mechanism found in https://doi.org/10.1002/kin.20603",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C7H13DIPX24J7\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-229",
        "domain": "ontospecies",
        "question": "Can you tell me the collision cross section for InChI=1S/C14H14O4/c1-3-9-17-13(15)11-7-5-6-8-12(11)14(16)18-10-4-2/h3-8H,1-2,9-10H2?",
        "query": {
            "sparql": "SELECT ?CollisionCrossSection WHERE {\n  VALUES ?Species { \"InChI=1S/C14H14O4/c1-3-9-17-13(15)11-7-5-6-8-12(11)14(16)18-10-4-2/h3-8H,1-2,9-10H2\" }\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-280",
        "domain": "ontocompchem",
        "question": "Can you find the value of the rotational constants for Tb using STO-6G, CC-pVDZ or STO-5G basis set?",
        "query": {
            "sparql": "SELECT ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tb\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-6G\" \"CC-pVDZ\" \"STO-5G\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-279",
        "domain": "ontocompchem",
        "question": "What is the total enthalpy of Cd calculated using the CC-pVTZ basis set across all level of theory",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-478",
        "domain": "ontospecies",
        "question": "I'm looking for Hardener chemicals with an approximate mass of 129.1266 - which are they?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 129.1266*0.9 && ?ExactMassValue < 129.1266*1.1 )\n  ?Species os:hasUse/rdfs:label \"Hardener\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-201",
        "domain": "ontokin",
        "question": "What's the kinetic model for a chemical reaction involving C11H21 reactant?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C11H21\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    }
]