[
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-250",
        "domain": "ontocompchem",
        "question": "What's the LUMO+2 energy level of Os when analysed using STO-4G or 4-31G basis sets, and what would be the theoretical level at which such calculations are done?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Os\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" \"4-31G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-242",
        "domain": "ontocompchem",
        "question": "Can you tell me the energy of LUMO+1 for Gd using the G3 level computations?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Gd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-347",
        "domain": "ontokin",
        "question": "Can you provide me with the kinetic model of a chemical reaction where C5H10CHO is the product and MDCY79-3 is the reactant?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C5H10CHO\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDCY79-3\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-330",
        "domain": "ontokin",
        "question": "What is the thermodynamic model of C9OOH6-2C across all the reaction mechanisms in which it appears",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"C9OOH6-2C\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-484",
        "domain": "ontospecies",
        "question": "Can you find the chemical that has a melting point of exactly 378.15, Henry's law constant below 1, one covalent unit and any amount of vapor pressure above zero? I'm looking for its monoisotopic weight plus how hydrophobic it is and its flash point.",
        "query": {
            "sparql": "SELECT ?MonoIsotopicWeight ?Hydrophobicity ?FlashPoint WHERE {\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue = 378.15 )\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue < 1.0 )\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue = 1.0 )\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue > 0 )\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n  ?Species os:hasHydrophobicity ?Hydrophobicity .\n  ?Species os:hasFlashPoint ?FlashPoint .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-476",
        "domain": "ontokin",
        "question": "I need to understand the chemical reaction with C5H82OOH5-4O2 as reactant, C7OOH4-2B and MN9OOH5J as products from the mechanism in the following site: www.osti.gov/servlets/purl/90098-26Ev73/webviewable/.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C5H82OOH5-4O2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C7OOH4-2B\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MN9OOH5J\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-478",
        "domain": "ontokin",
        "question": "I need to understand the kinetic model associated with the H2 + HE = H + H + HE chemical reaction. Can you search it for me?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2 + HE = H + H + HE\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-648",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that fall under the category of Other Classes?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"Other Classes\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-953",
        "domain": "ontospecies",
        "question": "What's the value of enthalpy when C=CCOCC1CO1 and InChI=1S/C21H26N2S2/c1-22-13-6-5-7-16(22)12-14-23-18-8-3-4-9-20(18)25-21-11-10-17(24-2)15-19(21)23/h3-4,8-11,15-16H,5-7,12-14H2,1-2H3 undergo sublimation?",
        "query": {
            "sparql": "SELECT ?EnthalpyOfSublimation WHERE {\n  VALUES ?Species { \"C=CCOCC1CO1\" \"InChI=1S/C21H26N2S2/c1-22-13-6-5-7-16(22)12-14-23-18-8-3-4-9-20(18)25-21-11-10-17(24-2)15-19(21)23/h3-4,8-11,15-16H,5-7,12-14H2,1-2H3\" }\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-734",
        "domain": "ontospecies",
        "question": "Which chemicals have fewer than or exactly 4.4 rotatable bonds?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue <= 4.4 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-237",
        "domain": "ontospecies",
        "question": "Can you tell me the number of tautomers for CN=C=O?",
        "query": {
            "sparql": "SELECT ?TautomerCount WHERE {\n  VALUES ?Species { \"CN=C=O\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-286",
        "domain": "ontocompchem",
        "question": "How much energy does H2O2 have when calculated at RB3LYP level with the application of CC-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Nd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-766",
        "domain": "ontospecies",
        "question": "I'm trying to find out the role of a chemical species classified under both main group molecular entity and Plastics & Rubber.",
        "query": {
            "sparql": "SELECT ?UseLabel WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"main group molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"Plastics & Rubber\" .\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-768",
        "domain": "ontospecies",
        "question": "I need to know the enthalpy of sublimation and viscosity values for CCC1=CC=CC(=C1N(COCC)C(=O)CCl)C as well as InChI=1S/C8H15ClO/c1-2-3-4-5-6-7-8(9)10/h2-7H2,1H3.",
        "query": {
            "sparql": "SELECT ?Viscosity ?EnthalpyOfSublimation WHERE {\n  VALUES ?Species { \"CCC1=CC=CC(=C1N(COCC)C(=O)CCl)C\" \"InChI=1S/C8H15ClO/c1-2-3-4-5-6-7-8(9)10/h2-7H2,1H3\" }\n  ?Species os:hasViscosity ?Viscosity .\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-357",
        "domain": "ontokin",
        "question": "What does the kinetic model look like for a reaction that forms MD7D?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD7D\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-865",
        "domain": "ontospecies",
        "question": "Can you tell me the chiral def count, heat of combustion and isoelectric point for InChI=1S/C4H8O/c1-3-4(2)5/h3H2,1-2H3?",
        "query": {
            "sparql": "SELECT ?AtomChiralDefCount ?HeatOfCombustion ?IsoelectricPoint WHERE {\n  VALUES ?Species { \"InChI=1S/C4H8O/c1-3-4(2)5/h3H2,1-2H3\" }\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-252",
        "domain": "ontospecies",
        "question": "Which chemical species fall under the class of p-block molecular entity, belong to the classification of molecules, and have a bond stereocenter count higher than -1.0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"p-block molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -1.0 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-189",
        "domain": "ontocompchem",
        "question": "What is the total enthalpy and energy of next-to-highest occupied molecular orbital and SCF energy of F2 calculated using the cc-pVDZ or cc-pVTZ basis set",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy ?HOMOMinus1Energy ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" \"cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-341",
        "domain": "ontospecies",
        "question": "Can you tell me the chemical class, flash points, and boiling points for C15H18ClN3O, chloro(chloromethoxy)methane, and C19H17Cl2N3O3?",
        "query": {
            "sparql": "SELECT ?BoilingPoint ?FlashPoint ?ChemicalClassLabel WHERE {\n  VALUES ?Species { \"C15H18ClN3O\" \"chloro(chloromethoxy)methane\" \"C19H17Cl2N3O3\" }\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n  ?Species os:hasFlashPoint ?FlashPoint .\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-344",
        "domain": "ontospecies",
        "question": "Need to find out what the ionization potential and viscosity of C5H9N is.",
        "query": {
            "sparql": "SELECT ?Viscosity ?IonizationPotential WHERE {\n  VALUES ?Species { \"C5H9N\" }\n  ?Species os:hasViscosity ?Viscosity .\n  ?Species os:hasIonizationPotential ?IonizationPotential .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-412",
        "domain": "ontocompchem",
        "question": "M06-2X level LUMO+1 energy of Mo in different basis sets?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mo\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-85",
        "domain": "ontokin",
        "question": "Looking for the specific chemical reaction mentioned in the mechanism within this link https://doi.org/10.1002/kin.20026.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-351",
        "domain": "ontocompchem",
        "question": "What is the LUMO+2 energy of Sb2 calculated at the PM6 level, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Sb2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-479",
        "domain": "ontospecies",
        "question": "Can you tell me the count of chiral atoms in InChI=1S/C2H7N/c1-2-3/h2-3H2,1H3, 2-[(2R,3R,4S,5R)-3,4-dihydroxy-5-(hydroxymethyl)tetrahydrofuran-2-yl]-1,2,4-triazine-3,5-dione, and C17H21N?",
        "query": {
            "sparql": "SELECT ?AtomChiralDefCount WHERE {\n  VALUES ?Species { \"InChI=1S/C2H7N/c1-2-3/h2-3H2,1H3\" \"2-[(2R,3R,4S,5R)-3,4-dihydroxy-5-(hydroxymethyl)tetrahydrofuran-2-yl]-1,2,4-triazine-3,5-dione\" \"C17H21N\" }\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-319",
        "domain": "ontocompchem",
        "question": "Zero point and LUMO+2 energy of CSi using HF level theory with cc-pVQZ basis set: what are the values?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CSi\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-209",
        "domain": "ontospecies",
        "question": "Chemical species with a compound complexity of approximately 122.0, atom chiral count above -1.0 and isotope atom count greater than -1.0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue > 122.0*0.9 && ?CompoundComplexityValue < 122.0*1.1 )\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue >= -1.0 )\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue >= -1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-842",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is organonitrogen compound and melting point is greater than or equal to 348 and chemical classification is dibenzopyrrole and chemical class is chemical entity",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organonitrogen compound\" .\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue >= 348 )\n  ?Species os:hasChemicalClass/rdfs:label \"dibenzopyrrole\" .\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-458",
        "domain": "ontospecies",
        "question": "Can you tell me the Log P of a p-block molecular entity in chemistry?",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"p-block molecular entity\" .\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-380",
        "domain": "ontokin",
        "question": "Can you provide details on the OH + OH (+ M) = H2O2 (+ M) reaction's kinetic model?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"OH + OH (+ M) = H2O2 (+ M)\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-122",
        "domain": "ontospecies",
        "question": "What is the number of hydrogen bond donors of InChI=1S/C9H16ClN5/c1-5-11-7-12-6(10)13-8(14-7)15-9(2,3)4/h5H2,1-4H3,(H2,11,12,13,14,15)",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount WHERE {\n  VALUES ?Species { \"InChI=1S/C9H16ClN5/c1-5-11-7-12-6(10)13-8(14-7)15-9(2,3)4/h5H2,1-4H3,(H2,11,12,13,14,15)\" }\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-42",
        "domain": "ontospecies",
        "question": "Heat of vaporization for InChI=1S/C7H7Br/c1-6-2-4-7(8)5-3-6/h2-5H,1H3",
        "query": {
            "sparql": "SELECT ?HeatOfVaporization WHERE {\n  VALUES ?Species { \"InChI=1S/C7H7Br/c1-6-2-4-7(8)5-3-6/h2-5H,1H3\" }\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-49",
        "domain": "ontokin",
        "question": "What are the thermodynamic and transport models for MDDIPX100J8 in all reaction mechanisms it's involved in?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"MDDIPX100J8\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-774",
        "domain": "ontospecies",
        "question": "I'm looking for carbocyclic compound species that are also considered as organonitrogen compound. Can you help me find them?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carbocyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organonitrogen compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-666",
        "domain": "ontospecies",
        "question": "I'm trying to find out about the viscosity of CC1=C(C=C(C=C1)[N+](=O)[O-])[N+](=O)[O-], C1=CC(=CC=C1C(=C(Cl)Cl)C2=CC=C(C=C2)Cl)Cl, and C1C(O1)COCCCCOCC2CO2 along with their hydrogen bond acceptor counts.",
        "query": {
            "sparql": "SELECT ?Viscosity ?HydrogenBondAcceptorCount WHERE {\n  VALUES ?Species { \"CC1=C(C=C(C=C1)[N+](=O)[O-])[N+](=O)[O-]\" \"C1=CC(=CC=C1C(=C(Cl)Cl)C2=CC=C(C=C2)Cl)Cl\" \"C1C(O1)COCCCCOCC2CO2\" }\n  ?Species os:hasViscosity ?Viscosity .\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-291",
        "domain": "ontokin",
        "question": "Can you help me find what chemical reaction provided in https://doi.org/10.1002/kin.20603 uses MS3OXO and C11OOH1-OO3-2 as its reactants?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MS3OXO\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C11OOH1-OO3-2\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-183",
        "domain": "ontokin",
        "question": "Can you show me the reaction mechanisms that involve C12OOH5-3 in thermodynamics?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"C12OOH5-3\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-498",
        "domain": "ontokin",
        "question": "For the chemical reaction that has reactant CCYCCOOC-I2 and has product C5H92O2-4, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CCYCCOOC-I2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C5H92O2-4\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-595",
        "domain": "ontospecies",
        "question": "Can you tell me the IUPAC name for C1CCC(CC1)N, its collision cross section and how many rotatable bonds it has?",
        "query": {
            "sparql": "SELECT ?CollisionCrossSection ?IUPACName ?RotatableBondCount WHERE {\n  VALUES ?Species { \"C1CCC(CC1)N\" }\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n  ?Species os:hasIUPACName ?IUPACName .\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-283",
        "domain": "ontokin",
        "question": "Looking for instances of chemical reactions involving NC9KET53O.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"NC9KET53O\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-165",
        "domain": "ontospecies",
        "question": "What is the dissociation constants of COC1=C(C=C2C(=C1)C34CCN5C3CC6C7C4N2C(=O)CC7OCC=C6C5)OC",
        "query": {
            "sparql": "SELECT ?DissociationConstants WHERE {\n  VALUES ?Species { \"COC1=C(C=C2C(=C1)C34CCN5C3CC6C7C4N2C(=O)CC7OCC=C6C5)OC\" }\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-161",
        "domain": "ontocompchem",
        "question": "I need rotational constants for HO- using cc-pVQZ basis set, what results will I get?",
        "query": {
            "sparql": "SELECT ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HO-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-838",
        "domain": "ontospecies",
        "question": "For COP(=S)(OC)OC1=CC=C(C=C1)SC2=CC=C(C=C2)OP(=S)(OC)OC and 4-bromophenol, what is their International Chemical Identifier",
        "query": {
            "sparql": "SELECT ?InChI WHERE {\n  VALUES ?Species { \"COP(=S)(OC)OC1=CC=C(C=C1)SC2=CC=C(C=C2)OP(=S)(OC)OC\" \"4-bromophenol\" }\n  ?Species os:hasInChI ?InChI .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-143",
        "domain": "ontospecies",
        "question": "What are the chemical species whose isotope atom count is < 1.0 and solubility is not less than 0.54",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue < 1.0 )\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue >= 0.54 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-206",
        "domain": "ontokin",
        "question": "I need to know the number of chemical reactions in this article https://doi.org/10.1002/kin.20026 where C11O2-5 is the reactant and XC7H14OH is the product.",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"XC7H14OH\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C11O2-5\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-334",
        "domain": "ontospecies",
        "question": "I'm looking for the molecular mass of a chemical substance used as a human metabolite.",
        "query": {
            "sparql": "SELECT ?MolecularWeight WHERE {\n  ?Species os:hasUse/rdfs:label \"human metabolite\" .\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-220",
        "domain": "ontocompchem",
        "question": "What is the molecular structure of Md calculated at the M06 level of theory",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Md\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-517",
        "domain": "ontospecies",
        "question": "I'm looking to find out the heat of vaporization for C10H19N5O.",
        "query": {
            "sparql": "SELECT ?HeatOfVaporization WHERE {\n  VALUES ?Species { \"C10H19N5O\" }\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-749",
        "domain": "ontospecies",
        "question": "I'm looking for information on the different properties of propan-2-amine and InChI=1S/C6H12O/c1-3-5-6-7-4-2/h4H,2-3,5-6H2,1H3.",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"propan-2-amine\" \"InChI=1S/C6H12O/c1-3-5-6-7-4-2/h4H,2-3,5-6H2,1H3\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-116",
        "domain": "ontocompchem",
        "question": "Searching for information on total enthalpy, the energy of the lowest unoccupied molecular orbital, and Gibbs free energy for Ti based on the determined calculation basis set.",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy ?LUMOEnergy ?TotalGibbsFreeEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ti\" .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-170",
        "domain": "ontospecies",
        "question": "Find chemical species with zero charge, less than 1 atom stereocenter count, classified as homocyclic compound, and isotope atom count not below -1.0",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue = 0.0 )\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue < 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"homocyclic compound\" .\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue >= -1.0 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-511",
        "domain": "ontokin",
        "question": "What's the kinetic model for a chemical reaction with NC6D1KET45 as a reactant?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"NC6D1KET45\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-378",
        "domain": "ontospecies",
        "question": "What's the count of chiral bonds in C(CON=C(N)N)C(C(=O)O)N and InChI=1S/C12H14N4O5S2/c13-15-22(17,18)11-5-1-9(2-6-11)21-10-3-7-12(8-4-10)23(19,20)16-14/h1-8,15-16H,13-14H2?",
        "query": {
            "sparql": "SELECT ?BondChiralCount WHERE {\n  VALUES ?Species { \"C(CON=C(N)N)C(C(=O)O)N\" \"InChI=1S/C12H14N4O5S2/c13-15-22(17,18)11-5-1-9(2-6-11)21-10-3-7-12(8-4-10)23(19,20)16-14/h1-8,15-16H,13-14H2\" }\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-224",
        "domain": "ontocompchem",
        "question": "How to compute Mo's total enthalpy with 6-311G or 4-31G basis sets? Please include the theoretical level for these calculations.",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mo\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" \"4-31G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-86",
        "domain": "ontokin",
        "question": "I'm looking for the kinetic model of HO2 + O = OH + O2.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"HO2 + O = OH + O2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    }
]