[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-956",
        "domain": "ontospecies",
        "question": "Can you tell me the chiral def count and PubChem CID for COC1=C(C=CC(=C1)C=O)O, C(F)(F)(Br)Br, and CCCN(CCC)CCC?",
        "query": {
            "sparql": "SELECT ?AtomChiralDefCount ?CID WHERE {\n  VALUES ?Species { \"COC1=C(C=CC(=C1)C=O)O\" \"C(F)(F)(Br)Br\" \"CCCN(CCC)CCC\" }\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n  ?Species os:hasCID ?CID .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-20",
        "domain": "ontospecies",
        "question": "Looking for chemical species with a defined atom stereocenter count of 3.3 or less.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue <= 3.3000000000000003 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-91",
        "domain": "ontocompchem",
        "question": "What is the HOMO-2 energy of Lu calculated at the B3LYP level of theory across all basis set",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Lu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-564",
        "domain": "ontospecies",
        "question": "Could you provide me with the details regarding the heat of combustion, InChIKey, and chemical classification for both CHBr3 and C1=CC2=C(C3=C(C=CC=N3)C=C2)N=C1?",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion ?InChIKey ?ChemicalClassLabel WHERE {\n  VALUES ?Species { \"CHBr3\" \"C1=CC2=C(C3=C(C=CC=N3)C=C2)N=C1\" }\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n  ?Species os:hasInChIKey ?InChIKey .\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-605",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species falling under the category of cyclic compound.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"cyclic compound\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-316",
        "domain": "ontokin",
        "question": "For the chemical reaction H2 + H + H = H2 + H2 involved in the mechanism found in www.osti.gov/servlets/purl/90098-26Ev73/webviewable/, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2 + H + H = H2 + H2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-294",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that belong to the chalcogen molecular entity class and have a bond chiral count of 1.0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"chalcogen molecular entity\" .\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue = 1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-271",
        "domain": "ontospecies",
        "question": "Show me the chemical species that fall under the category of both a chalcogen molecular entity and a hydrogen molecular entity, are utilized in the field of Pet Care, and weigh approximately 192.02701 atomic mass units.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"chalcogen molecular entity\" .\n  ?Species os:hasUse/rdfs:label \"Pet Care\" .\n  ?Species os:hasChemicalClass/rdfs:label \"hydrogen molecular entity\" .\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 192.02701*0.9 && ?ExactMassValue < 192.02701*1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-618",
        "domain": "ontospecies",
        "question": "What is the flash point of C1CCC(CC1)N2C(=NN=N2)CCCCOC3=CC4=C(C=C3)NC(=O)CC4 and C10H12O3",
        "query": {
            "sparql": "SELECT ?FlashPoint WHERE {\n  VALUES ?Species { \"C1CCC(CC1)N2C(=NN=N2)CCCCOC3=CC4=C(C=C3)NC(=O)CC4\" \"C10H12O3\" }\n  ?Species os:hasFlashPoint ?FlashPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-832",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that are considered homocyclic compounds.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"homocyclic compound\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-83",
        "domain": "ontokin",
        "question": "I need information on the kinetic model for chemical reactions. Specifically, the ones where the product is CH3C2H2C2H4COCH3.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"CH3C2H2C2H4COCH3\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-394",
        "domain": "ontocompchem",
        "question": "What is the energy of lowest unoccupied molecular orbital of CO calculated using the cc-pVDZ basis set",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CO\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-104",
        "domain": "ontocompchem",
        "question": "What is the SLUMO energy of Kr calculated at the M06 level of theory using the STO-3G or 6-311+G or aug-cc-pVDZ basis set",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Kr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" \"6-311+G\" \"aug-cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-633",
        "domain": "ontospecies",
        "question": "How many bond stereocenters does C10H12N3O3PS2 have?",
        "query": {
            "sparql": "SELECT ?BondChiralDefCount WHERE {\n  VALUES ?Species { \"C10H12N3O3PS2\" }\n  ?Species os:hasBondChiralDefCount ?BondChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-844",
        "domain": "ontospecies",
        "question": "What is the compound complexity and rotatable bond count of the chemical species whose chemical class is molecular entity and exact mass is <= 126 and chemical class is main group molecular entity",
        "query": {
            "sparql": "SELECT ?CompoundComplexity ?RotatableBondCount WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue <= 126 )\n  ?Species os:hasChemicalClass/rdfs:label \"main group molecular entity\" .\n  ?Species os:hasCompoundComplexity ?CompoundComplexity .\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-340",
        "domain": "ontospecies",
        "question": "What is the Caco-2 permeability of C17H12O6",
        "query": {
            "sparql": "SELECT ?Caco2Permeability WHERE {\n  VALUES ?Species { \"C17H12O6\" }\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-830",
        "domain": "ontospecies",
        "question": "What are the charge and dissociation constants for N-(4-aminophenyl)sulfonylcarbamic acid methyl ester and InChI=1S/C9H15N/c1-4-7-10(8-5-2)9-6-3/h4-6H,1-3,7-9H2?",
        "query": {
            "sparql": "SELECT ?Charge ?DissociationConstants WHERE {\n  VALUES ?Species { \"N-(4-aminophenyl)sulfonylcarbamic acid methyl ester\" \"InChI=1S/C9H15N/c1-4-7-10(8-5-2)9-6-3/h4-6H,1-3,7-9H2\" }\n  ?Species os:hasCharge ?Charge .\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-949",
        "domain": "ontospecies",
        "question": "I need information on hexanal's use, its ionization potential and the isoelectric point.",
        "query": {
            "sparql": "SELECT ?UseLabel ?IonizationPotential ?IsoelectricPoint WHERE {\n  VALUES ?Species { \"hexanal\" }\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n  ?Species os:hasIonizationPotential ?IonizationPotential .\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-156",
        "domain": "ontospecies",
        "question": "Search for the chemicals where the atom's chiral undef count is not less than zero and has a specific vapor pressure of 773.26984?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue >= 0 )\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue = 773.26984 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-89",
        "domain": "ontocompchem",
        "question": "Using the basis set CC-pVTZ, how much total energy of O2 can be measured?",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-405",
        "domain": "ontokin",
        "question": "I'm looking for the kinetic model of the chemical reaction where MDCY26-7 is the reactant.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDCY26-7\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-260",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that fall under the categories of ketone and organic molecule.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"ketone\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecule\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-395",
        "domain": "ontospecies",
        "question": "I need to find the SMILES for InChI=1S/C7H7NO/c8-7(9)6-4-2-1-3-5-6/h1-5H,(H2,8,9).",
        "query": {
            "sparql": "SELECT ?SMILES WHERE {\n  VALUES ?Species { \"InChI=1S/C7H7NO/c8-7(9)6-4-2-1-3-5-6/h1-5H,(H2,8,9)\" }\n  ?Species os:hasSMILES ?SMILES .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-63",
        "domain": "ontospecies",
        "question": "Can you find me the chemical species classified as heteroorganic entities and chlorine molecular entities, and fall under the classes of organic oxo compounds, molecular entities, and organic acids?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic oxo compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"chlorine molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic acid\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-77",
        "domain": "ontocompchem",
        "question": "Can you find out the HOMO-1 energy for H2O at the M06 theoretical level using various basis sets?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2O\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-466",
        "domain": "ontokin",
        "question": "For the chemical reaction H2 + OH <=> H + H2O, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2 + OH <=> H + H2O\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-314",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species where the count of undefined atom stereocenters isn't lower than -1.0.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue >= -1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-593",
        "domain": "ontospecies",
        "question": "I'm looking for hydrides and Laboratory chemicals where the bond stereocenter count is not less than -1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"Laboratory chemicals\" .\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue >= -1 )\n  ?Species os:hasChemicalClass/rdfs:label \"hydrides\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-483",
        "domain": "ontokin",
        "question": "What's the thermodynamic model used in all the reactions including MS6D5J?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"MS6D5J\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-105",
        "domain": "ontokin",
        "question": "What is the number of chemical reactions producing C8H14-1 outlined in the mechanism shown at https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C8H14-1\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-29",
        "domain": "ontocompchem",
        "question": "SCF energy for ClH with the CC-pVDZ basis set, can you provide info?",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-763",
        "domain": "ontospecies",
        "question": "How many chiral bonds does [C-]#[O+] have?",
        "query": {
            "sparql": "SELECT ?BondChiralDefCount WHERE {\n  VALUES ?Species { \"[C-]#[O+]\" }\n  ?Species os:hasBondChiralDefCount ?BondChiralDefCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-188",
        "domain": "ontokin",
        "question": "Can you tell me about the chemical reaction in the mechanism detailed on www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-336",
        "domain": "ontospecies",
        "question": "I'm trying to find out the boiling points of <I>N</I>,<I>N</I>-dimethyl-3-phenothiazin-10-ylpropan-1-amine, C8H19O4P, and C15H10O3.",
        "query": {
            "sparql": "SELECT ?BoilingPoint WHERE {\n  VALUES ?Species { \"<I>N</I>,<I>N</I>-dimethyl-3-phenothiazin-10-ylpropan-1-amine\" \"C8H19O4P\" \"C15H10O3\" }\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-574",
        "domain": "ontospecies",
        "question": "Can you find the chemical species with an XLogP3 value between 3 and 4, compound complexity between 64 and 77, polar surface area close to zero, bond chiral def count over -1.0, bond chiral undef count exactly zero and flash point precisely at 352.03888?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value > 3 && ?XLogP3Value < 4 )\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue > 63 && ?CompoundComplexityValue < 78 )\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue > -0.1 && ?PolarSurfaceAreaValue < 0.1 )\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -1.0 )\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue = 0.0 )\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue = 352.03888 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-208",
        "domain": "ontocompchem",
        "question": "I'm looking for the LUMO energy and SCF energy of Am at the PBE0 level using the STO-2G basis set. Can you help?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Am\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-2G\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-156",
        "domain": "ontokin",
        "question": "What's the chemical reaction where C7H15O4-HP4P3 reacts to form NC5KET32O as seen in this study https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"NC5KET32O\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7H15O4-HP4P3\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-864",
        "domain": "ontospecies",
        "question": "What is the Log S and enthalpy of sublimation and solubility of C10H8O and p-xylene and InChI=1S/C12H10N2O/c15-13-14(11-7-3-1-4-8-11)12-9-5-2-6-10-12/h1-10H",
        "query": {
            "sparql": "SELECT ?LogS ?EnthalpyOfSublimation ?Solubility WHERE {\n  VALUES ?Species { \"C10H8O\" \"p-xylene\" \"InChI=1S/C12H10N2O/c15-13-14(11-7-3-1-4-8-11)12-9-5-2-6-10-12/h1-10H\" }\n  ?Species os:hasLogS ?LogS .\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-23",
        "domain": "ontocompchem",
        "question": "Can you provide the energy readings for the second lowest unoccupied molecular orbital, highest occupied molecular orbital and the LUMO in HN3?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?HOMOEnergy ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HN3\" .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-713",
        "domain": "ontospecies",
        "question": "Can you tell me about the different properties of InChI=1S/C10H9Cl4NO2S/c11-9(12)10(13,14)18-15-7(16)5-3-1-2-4-6(5)8(15)17/h1-2,5-6,9H,3-4H2?",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"InChI=1S/C10H9Cl4NO2S/c11-9(12)10(13,14)18-15-7(16)5-3-1-2-4-6(5)8(15)17/h1-2,5-6,9H,3-4H2\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-422",
        "domain": "ontocompchem",
        "question": "I'm searching for calculations of LUMO energy and frequencies for H3N using a 3-21G basis set at a particular theory level. Can you help?",
        "query": {
            "sparql": "SELECT ?Frequencies ?LUMOEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H3N\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-391",
        "domain": "ontocompchem",
        "question": "At the prescribed theory's level, what's the energy for HOMO-2 of CO2?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CO2\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-267",
        "domain": "ontokin",
        "question": "Can you tell me about the transport model of MNKETM3O across various reaction mechanisms?",
        "query": {
            "sparql": "SELECT ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"MNKETM3O\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-365",
        "domain": "ontocompchem",
        "question": "Looking for total Gibbs free energy and ground state energy of F4S. What's the level of theory and basis set for these calculations?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?ZeroPointEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F4S\" .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-317",
        "domain": "ontospecies",
        "question": "For InChI=1S/BBr3/c2-1(3)4 and C22H19Cl2NO3, what is their ionization potential",
        "query": {
            "sparql": "SELECT ?IonizationPotential WHERE {\n  VALUES ?Species { \"InChI=1S/BBr3/c2-1(3)4\" \"C22H19Cl2NO3\" }\n  ?Species os:hasIonizationPotential ?IonizationPotential .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-300",
        "domain": "ontospecies",
        "question": "Can you find any chemical species that have zero isotopes, don't melt between 145 and 177.265 degrees, and have a Henry's law constant approximately equal to 5.2992973?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue = 0.0 )\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue < 145 || ?MeltingPointValue > 177.26500000000001 )\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue > 5.2992973*0.9 && ?HenrysLawConstantValue < 5.2992973*1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-896",
        "domain": "ontospecies",
        "question": "Searching for flash point values of three alcohols: C6H12O2, CC(C)(C)O and InChI=1S/C3H2N2/c4-2-1-3-5/h1H2.",
        "query": {
            "sparql": "SELECT ?FlashPoint WHERE {\n  VALUES ?Species { \"C6H12O2\" \"CC(C)(C)O\" \"InChI=1S/C3H2N2/c4-2-1-3-5/h1H2\" }\n  ?Species os:hasFlashPoint ?FlashPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-556",
        "domain": "ontospecies",
        "question": "What are the chemical species whose number of hydrogen bond acceptors is not less than 1.8 and number of non-hydrogen atoms is not less than 5",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue >= 1.8 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue >= 5 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-285",
        "domain": "ontocompchem",
        "question": "What is the energy of Br2 calculated at the UB3LYP level of theory using the CC-pVQZ basis set",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Br2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-142",
        "domain": "ontocompchem",
        "question": "Can you find the total enthalpy for Fe in the PM6 level using a STO-3G basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Fe\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-798",
        "domain": "ontospecies",
        "question": "Can you find the PubChem Compound ID, polar surface area, and boiling point for an organic molecule with a maximum mass of 270.71049500000004 and at least a -1 charge?",
        "query": {
            "sparql": "SELECT ?CID ?PolarSurfaceArea ?BoilingPoint WHERE {\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue <= 270.71049500000004 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecule\" .\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue >= -1 )\n  ?Species os:hasCID ?CID .\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-0",
        "domain": "ontokin",
        "question": "Details on the chemical reaction occurring with XC7H14OOH-Y1O2 and MSKET24O as documented in https://doi.org/10.1002/kin.20603",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"XC7H14OOH-Y1O2\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MSKET24O\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n}"
        }
    }
]