[
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-109",
        "domain": "ontocompchem",
        "question": "What is the total Gibbs free energy of Nd calculated at the M06-2X level using the CC-pVDZ basis set",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Nd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-211",
        "domain": "ontocompchem",
        "question": "What is the LUMO+1 energy of Mo calculated at the CCSD(T) level using the cc-pVQZ basis set",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mo\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-492",
        "domain": "ontocompchem",
        "question": "Total energy of Mo in every theory level?",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mo\" .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-169",
        "domain": "ontocompchem",
        "question": "Can you tell me the overall enthalpy for Tb?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tb\" .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-80",
        "domain": "ontokin",
        "question": "I'm looking for the particular chemical reaction that uses MD6T9D to yield ALDC6.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"ALDC6\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD6T9D\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-428",
        "domain": "ontospecies",
        "question": "What is the enthalpy of sublimation of C19H21NO4",
        "query": {
            "sparql": "SELECT ?EnthalpyOfSublimation WHERE {\n  VALUES ?Species { \"C19H21NO4\" }\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-709",
        "domain": "ontospecies",
        "question": "What is the ionization potential and density and vapor pressure of CC([N+](=O)[O-])(Cl)Cl and C14H18O",
        "query": {
            "sparql": "SELECT ?IonizationPotential ?Density ?VaporPressure WHERE {\n  VALUES ?Species { \"CC([N+](=O)[O-])(Cl)Cl\" \"C14H18O\" }\n  ?Species os:hasIonizationPotential ?IonizationPotential .\n  ?Species os:hasDensity ?Density .\n  ?Species os:hasVaporPressure ?VaporPressure .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-430",
        "domain": "ontokin",
        "question": "Need details on the chemical reaction linked with the mechanism in this research paper: https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-149",
        "domain": "ontocompchem",
        "question": "Can you help me understand the NHOMO energy and the energy of the second lowest unoccupied molecular orbital in the case of ClI?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClI\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-296",
        "domain": "ontokin",
        "question": "Explain the mechanism of the reactions H2 + OH <=> H2O + H and OH + H + M = H2O + M, please.",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H2 + OH <=> H2O + H\" .\n  ?Mechanism okin:hasReaction/okin:hasEquation \"OH + H + M = H2O + M\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-54",
        "domain": "ontokin",
        "question": "I'm looking for a chemical reaction with MD8OOH7O2 as an outcome.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD8OOH7O2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-518",
        "domain": "ontospecies",
        "question": "For <I>N</I>,<I>N</I>-diphenylaniline, what is its molecular weight",
        "query": {
            "sparql": "SELECT ?MolecularWeight WHERE {\n  VALUES ?Species { \"<I>N</I>,<I>N</I>-diphenylaniline\" }\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-242",
        "domain": "ontospecies",
        "question": "Searching for chemical species in the class of heteroatomic molecular entity, having a number of covalent units greater than 0.9 and an exact molecular mass of 306.27.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue > 0.9 )\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue = 306.27 )\n  ?Species os:hasChemicalClass/rdfs:label \"heteroatomic molecular entity\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-268",
        "domain": "ontokin",
        "question": "Can you help me find the chemical species involved in the reaction mechanism in this study https://doi.org/10.1002/kin.20026?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-180",
        "domain": "ontokin",
        "question": "I'm looking for the reaction mechanism involving these reactions: O + H2 = H + OH, H2O + M = H + OH + M, and O + HO2 <=> O2 + OH.",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"O + H2 = H + OH\" .\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H2O + M = H + OH + M\" .\n  ?Mechanism okin:hasReaction/okin:hasEquation \"O + HO2 <=> O2 + OH\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-601",
        "domain": "ontospecies",
        "question": "Which chemical species are both a part of the p-block molecular entity classification and identified as an organic molecule?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"p-block molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecule\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-90",
        "domain": "ontocompchem",
        "question": "I'm trying to find the molecular structure and total energy of CH4 when calculated using either a STO-2G or cc-pVDZ basis set at the PBE0 level of theory. Could you help out?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CH4\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-2G\" \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-147",
        "domain": "ontospecies",
        "question": "I'm looking for the specific heat of combustion values for C6H3Cl3, CCCCOC(=O)C1=CC=CC=C1C(=O)OC2CCCCC2, and C4H11NO.",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion WHERE {\n  VALUES ?Species { \"C6H3Cl3\" \"CCCCOC(=O)C1=CC=CC=C1C(=O)OC2CCCCC2\" \"C4H11NO\" }\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-486",
        "domain": "ontokin",
        "question": "What's the reaction in chemistry that takes MD9D4OOH8O2 and produces AR?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD9D4OOH8O2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"AR\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-119",
        "domain": "ontokin",
        "question": "For the chemical reaction that has reactant MH4OXO2J, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MH4OXO2J\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-215",
        "domain": "ontocompchem",
        "question": "Need to know the zero point energy figures for F4S determined via the STO-6G basis set at all theoretical levels.",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F4S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-178",
        "domain": "ontocompchem",
        "question": "Can you find the energy for the lowest unoccupied molecular orbital of H2S using aug-cc-pVQZ, aug-cc-pVTZ or STO-4G basis sets?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVQZ\" \"aug-cc-pVTZ\" \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-98",
        "domain": "ontokin",
        "question": "What's the mechanism for chemical reactions with MDCY36-9?",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"MDCY36-9\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-423",
        "domain": "ontocompchem",
        "question": "I'm interested in the ground state energy and electronic energy of F-, computed utilizing the aug-cc-pVTZ basis set - can you tell me?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-980",
        "domain": "ontospecies",
        "question": "I'm looking for heterocyclic compounds that are also classified as pnictogen and molecular entities, have a covalent unit count of 1.0, and their dissociation constants fall between 9.099 and 12.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue = 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"heterocyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"pnictogen molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n  ?Species os:hasDissociationConstants/os:value ?DissociationConstantsValue .\n  FILTER ( ?DissociationConstantsValue > 9.099 && ?DissociationConstantsValue < 12 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-7",
        "domain": "ontocompchem",
        "question": "What is the geometry of CO calculated at the CCSD(T) level using the 3-21G basis set",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CO\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-182",
        "domain": "ontospecies",
        "question": "I'm looking for chemicals that have a melting point greater than 415.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue > 415 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-34",
        "domain": "ontocompchem",
        "question": "What is the frequencies and rotational constants of F6S calculated at the PM6 level of theory, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?Frequencies ?RotationalConstants ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F6S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-604",
        "domain": "ontospecies",
        "question": "I'm looking for information on InChI=1S/C6H14O3/c1-7-3-5-9-6-4-8-2/h3-6H2,1-2H3, specifically its ionization potential and what it's called according to IUPAC.",
        "query": {
            "sparql": "SELECT ?IonizationPotential ?IUPACName WHERE {\n  VALUES ?Species { \"InChI=1S/C6H14O3/c1-7-3-5-9-6-4-8-2/h3-6H2,1-2H3\" }\n  ?Species os:hasIonizationPotential ?IonizationPotential .\n  ?Species os:hasIUPACName ?IUPACName .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-875",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species which fall under the category of organic molecular entity and possess a bond chiral count exceeding -1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > -1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-119",
        "domain": "ontospecies",
        "question": "Can you tell me the SMILES of InChI=1S/C3H8S2/c4-2-1-3-5/h4-5H,1-3H2, InChI=1S/C7H9N/c1-6-2-4-7(8)5-3-6/h2-5H,8H2,1H3 and C7H6O2?",
        "query": {
            "sparql": "SELECT ?SMILES WHERE {\n  VALUES ?Species { \"InChI=1S/C3H8S2/c4-2-1-3-5/h4-5H,1-3H2\" \"InChI=1S/C7H9N/c1-6-2-4-7(8)5-3-6/h2-5H,8H2,1H3\" \"C7H6O2\" }\n  ?Species os:hasSMILES ?SMILES .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-424",
        "domain": "ontokin",
        "question": "Looking for the kinetic model for this chemical reaction H2O2 (+ M) <=> OH + OH (+ M), details are in https://doi.org/10.1002/kin.20026.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2O2 (+ M) <=> OH + OH (+ M)\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-906",
        "domain": "ontospecies",
        "question": "Looking for chemicals whose hydrogen bond donors are not more than one and have a mono isotopic weight above 84.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue <= 1 )\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 84 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-649",
        "domain": "ontospecies",
        "question": "What are the chemical species whose atom chiral count is approximately 0.0 and chemical classification is alcohol and role is Cleaning agent",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue > -0.1 && ?AtomChiralCountValue < 0.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"alcohol\" .\n  ?Species os:hasUse/rdfs:label \"Cleaning agent\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-796",
        "domain": "ontospecies",
        "question": "For C7H10N2, what is its undefined bond stereocenter count",
        "query": {
            "sparql": "SELECT ?BondChiralUndefCount WHERE {\n  VALUES ?Species { \"C7H10N2\" }\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-185",
        "domain": "ontocompchem",
        "question": "Can you find the energy level of the second highest occupied molecular orbital in BrH? Please mention the theory level used for the calculations.",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BrH\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-16",
        "domain": "ontospecies",
        "question": "What is the molecular formula and melting point and autoignition temperature of (4<I>R</I>,4<I>a</I><I>S</I>,7<I>a</I><I>R</I>,12<I>b</I><I>S</I>)-3-(cyclopropylmethyl)-4<I>a</I>,9-dihydroxy-2,4,5,6,7<I>a</I>,13-hexahydro-1<I>H</I>-4,12-methanobenzofuro[3,2-e]isoquinolin-7-one and C2H3FO2",
        "query": {
            "sparql": "SELECT ?MolecularFormula ?MeltingPoint ?AutoignitionTemperature WHERE {\n  VALUES ?Species { \"(4<I>R</I>,4<I>a</I><I>S</I>,7<I>a</I><I>R</I>,12<I>b</I><I>S</I>)-3-(cyclopropylmethyl)-4<I>a</I>,9-dihydroxy-2,4,5,6,7<I>a</I>,13-hexahydro-1<I>H</I>-4,12-methanobenzofuro[3,2-e]isoquinolin-7-one\" \"C2H3FO2\" }\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n  ?Species os:hasAutoignitionTemperature ?AutoignitionTemperature .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-377",
        "domain": "ontokin",
        "question": "Chemical reactions from the link https://doi.org/10.1002/kin.20026 involving MB2OXOMJ and CH2OCH2O2H that yield MDCY683O: how many are there?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDCY683O\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MB2OXOMJ\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"CH2OCH2O2H\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-435",
        "domain": "ontokin",
        "question": "Can you find the kinetic model involving S-C3H5 production, as detailed in https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"S-C3H5\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-416",
        "domain": "ontocompchem",
        "question": "Need the calculated energy of LUMO+2 for Os at the M06-2X level. Also, specify the basis set used for performing the calculations.",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Os\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-440",
        "domain": "ontokin",
        "question": "Can you give me details about how the O + HO2 = O2 + OH reaction mechanism works?",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"O + HO2 = O2 + OH\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-500",
        "domain": "ontospecies",
        "question": "What are the properties of 1,2-dibromopropane in terms of its logS and viscosity?",
        "query": {
            "sparql": "SELECT ?LogS ?Viscosity WHERE {\n  VALUES ?Species { \"1,2-dibromopropane\" }\n  ?Species os:hasLogS ?LogS .\n  ?Species os:hasViscosity ?Viscosity .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-187",
        "domain": "ontokin",
        "question": "I need to know the transport model for chemical species in the reaction mechanism referred to in this research https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?TransportModel WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-326",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species classified as carbocyclic compound and are part of the organic molecular entity class.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carbocyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-226",
        "domain": "ontocompchem",
        "question": "Need data on the rotational constants for HN3 computed through the aug-cc-pVTZ basis set for all levels of theory.",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HN3\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-407",
        "domain": "ontocompchem",
        "question": "Looking for information on B2U's optimized geometry calculated at the PM6 level using the aug-cc-pVQZ or CC-pVQZ basis set.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"B2U\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVQZ\" \"CC-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-224",
        "domain": "ontokin",
        "question": "What chemical reaction uses MD9DCY25 to form MOKET56?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD9DCY25\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MOKET56\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-216",
        "domain": "ontocompchem",
        "question": "What is the frequencies and LUMO+1 energy of La calculated using the cc-pVDZ basis set",
        "query": {
            "sparql": "SELECT ?Frequencies ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"La\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-531",
        "domain": "ontospecies",
        "question": "Can you find me the chemical species that have an XLOGP3 value of at least 1.71?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value >= 1.71 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-304",
        "domain": "ontokin",
        "question": "Could you explain the kinetic model for the reaction H2O2 + OH <=> H2O + HO2?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2O2 + OH <=> H2O + HO2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-257",
        "domain": "ontospecies",
        "question": "What are the chemical species whose compound complexity is outside the range (25, 31.57) and chemical class is tertiary amino compound and chemical classification is heteroorganic entity",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue < 25 || ?CompoundComplexityValue > 31.57 )\n  ?Species os:hasChemicalClass/rdfs:label \"tertiary amino compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-29",
        "domain": "ontospecies",
        "question": "What's the density of a chemical species classified as carbon group molecular entity, benzenes and Other Classes?",
        "query": {
            "sparql": "SELECT ?Density WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carbon group molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"benzenes\" .\n  ?Species os:hasChemicalClass/rdfs:label \"carbon group molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"Other Classes\" .\n  ?Species os:hasDensity ?Density .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-183",
        "domain": "ontospecies",
        "question": "What is the LogS and monoisotopic mass of 2,4-ditert-butylphenol",
        "query": {
            "sparql": "SELECT ?LogS ?MonoIsotopicWeight WHERE {\n  VALUES ?Species { \"2,4-ditert-butylphenol\" }\n  ?Species os:hasLogS ?LogS .\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-834",
        "domain": "ontospecies",
        "question": "Can you find chemical species that are both polycyclic compounds and molecules, with no undefined atom stereocenter?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue = 0.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"polycyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n}"
        }
    }
]