[
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-254",
        "domain": "ontokin",
        "question": "Can you tell me the chemical reaction that involves MDDIPX25J8 as a reactant, produces C8OOH7-2E and is discussed in this link www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C8OOH7-2E\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDDIPX25J8\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-278",
        "domain": "ontokin",
        "question": "C9H18OOH5-4O2's thermodynamic and transport model used in reaction mechanisms, what are they?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"C9H18OOH5-4O2\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-856",
        "domain": "ontospecies",
        "question": "Autoignition temperature and number of tautomers for CCSCC",
        "query": {
            "sparql": "SELECT ?AutoignitionTemperature ?TautomerCount WHERE {\n  VALUES ?Species { \"CCSCC\" }\n  ?Species os:hasAutoignitionTemperature ?AutoignitionTemperature .\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-100",
        "domain": "ontospecies",
        "question": "Number of heavy atoms in C10H6O2?",
        "query": {
            "sparql": "SELECT ?HeavyAtomCount WHERE {\n  VALUES ?Species { \"C10H6O2\" }\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-155",
        "domain": "ontocompchem",
        "question": "What's the calculated energy of LUMO+2 for H2O at the HF level?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2O\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-451",
        "domain": "ontokin",
        "question": "What's the kinetic model for a chemical reaction with reactants HO2 and OH as mentioned in this study https://doi.org/10.1002/kin.20026?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDDIPX90J4\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"CH3CHJC2H4COC3H7\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-112",
        "domain": "ontocompchem",
        "question": "Need to know the LUMO+2 energy and total Gibbs free energy of BH3 in different basis sets.",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?TotalGibbsFreeEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BH3\" .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-692",
        "domain": "ontospecies",
        "question": "What's the charge of C13H7Cl4NO2 and InChI=1S/C7H11NO/c9-6-8-7-4-2-1-3-5-7/h7H,1-5H2?",
        "query": {
            "sparql": "SELECT ?Charge WHERE {\n  VALUES ?Species { \"C13H7Cl4NO2\" \"InChI=1S/C7H11NO/c9-6-8-7-4-2-1-3-5-7/h7H,1-5H2\" }\n  ?Species os:hasCharge ?Charge .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-963",
        "domain": "ontospecies",
        "question": "Undefined atom stereocenter count in InChI=1S/C3H6O/c1-2-3-4/h2,4H,1,3H2",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount WHERE {\n  VALUES ?Species { \"InChI=1S/C3H6O/c1-2-3-4/h2,4H,1,3H2\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-142",
        "domain": "ontospecies",
        "question": "Can you tell me the chemical classification for C1CCC2CCCCC2C1?",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel WHERE {\n  VALUES ?Species { \"C1CCC2CCCCC2C1\" }\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-479",
        "domain": "ontocompchem",
        "question": "What is the SLUMO energy of Pm calculated at the M06-2X level of theory using the CC-pVDZ basis set",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-521",
        "domain": "ontospecies",
        "question": "Can you find chemical species that belong to the phenols class, have an XLogP3 greater than -1.0, and are classified as both cyclic compound and carbocyclic compound?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"phenols\" .\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value > -1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"cyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"carbocyclic compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-788",
        "domain": "ontospecies",
        "question": "What kind of chemical species are classified as nitrogen molecular entity?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"nitrogen molecular entity\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-497",
        "domain": "ontocompchem",
        "question": "Can you give me the calculation for the electronic energy of Sm at the HF level?",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Sm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-675",
        "domain": "ontospecies",
        "question": "For the chemical species whose polar surface area is greater than or equal to 24.93 and melting point is around 203.15, what is its Log S",
        "query": {
            "sparql": "SELECT ?LogS WHERE {\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue >= 24.93 )\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue > 203.15*0.9 && ?MeltingPointValue < 203.15*1.1 )\n  ?Species os:hasLogS ?LogS .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-1",
        "domain": "ontocompchem",
        "question": "Can you find the HOMO-2 energy value for a HN3 molecule?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HN3\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-698",
        "domain": "ontospecies",
        "question": "Need to find out InChI=1S/C2H7NO/c3-1-2-4/h4H,1-3H2's bond stereocenter count and its molecular composition.",
        "query": {
            "sparql": "SELECT ?BondChiralCount ?MolecularFormula WHERE {\n  VALUES ?Species { \"InChI=1S/C2H7NO/c3-1-2-4/h4H,1-3H2\" }\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-212",
        "domain": "ontokin",
        "question": "Can you show me the chemical reaction mechanism between MS2OOHMO2 and C4H9O2-HP2R4?",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"MS2OOHMO2\" .\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"C4H9O2-HP2R4\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-777",
        "domain": "ontospecies",
        "question": "Can you tell me the count of undef chiral atoms in InChI=1S/C7H6O4/c8-5-2-1-4(7(10)11)3-6(5)9/h1-3,8-9H,(H,10,11)?",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount WHERE {\n  VALUES ?Species { \"InChI=1S/C7H6O4/c8-5-2-1-4(7(10)11)3-6(5)9/h1-3,8-9H,(H,10,11)\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-272",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction that is involved in the mechanism found in www.osti.gov/servlets/purl/90098-26Ev73/webviewable/",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-330",
        "domain": "ontocompchem",
        "question": "What is the total enthalpy and NHOMO energy and total energy of CN- across all level of theory and basis set",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy ?HOMOMinus1Energy ?TotalEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CN-\" .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-201",
        "domain": "ontospecies",
        "question": "For C10H16N2O8, what are its different properties",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"C10H16N2O8\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-804",
        "domain": "ontospecies",
        "question": "Need details on the tautomer count of 1,2-benzothiazol-3-one, InChI=1S/C14H12O6S/c1-20-12-8-11(15)10(7-13(12)21(17,18)19)14(16)9-5-3-2-4-6-9/h2-8,15H,1H3,(H,17,18,19), InChI=1S/C10H22O2/c1-3-5-7-11-9-10-12-8-6-4-2/h3-10H2,1-2H3 as well as their dissociation constants and uses.",
        "query": {
            "sparql": "SELECT ?TautomerCount ?DissociationConstants ?UseLabel WHERE {\n  VALUES ?Species { \"1,2-benzothiazol-3-one\" \"InChI=1S/C14H12O6S/c1-20-12-8-11(15)10(7-13(12)21(17,18)19)14(16)9-5-3-2-4-6-9/h2-8,15H,1H3,(H,17,18,19)\" \"InChI=1S/C10H22O2/c1-3-5-7-11-9-10-12-8-6-4-2/h3-10H2,1-2H3\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-463",
        "domain": "ontocompchem",
        "question": "Searching for the calculation of B2U's molecular structure using the aug-cc-pVDZ basis set.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"B2U\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-680",
        "domain": "ontospecies",
        "question": "List of chemical species with a charge of 0.0, optical rotation of 0.054454274, compound complexity less than or equal to 21.89 and melting point not between 177.33501 and 216.74279000000004",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue = 0.0 )\n  ?Species os:hasOpticalRotation/os:value ?OpticalRotationValue .\n  FILTER ( ?OpticalRotationValue = 0.054454274 )\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue <= 21.89 )\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue < 177.33501 || ?MeltingPointValue > 216.74279000000004 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-566",
        "domain": "ontospecies",
        "question": "Can you tell me the ionization potential for CCOP(=O)(OCC)OC1=CC=C(C=C1)[N+](=O)[O-]?",
        "query": {
            "sparql": "SELECT ?IonizationPotential WHERE {\n  VALUES ?Species { \"CCOP(=O)(OCC)OC1=CC=C(C=C1)[N+](=O)[O-]\" }\n  ?Species os:hasIonizationPotential ?IonizationPotential .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-100",
        "domain": "ontokin",
        "question": "What's the kinetic model for the chemical equation O + H2 <=> H + OH described here https://doi.org/10.1002/kin.20026?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"O + H2 <=> H + OH\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-22",
        "domain": "ontokin",
        "question": "Can you find me a chemical reaction that transforms C12OOH6-OO3-2 into HOCOCQ(CH3)2?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"HOCOCQ(CH3)2\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C12OOH6-OO3-2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-52",
        "domain": "ontospecies",
        "question": "What is the Caco-2 permeability of the chemical species whose chemical class is carbonyl compound",
        "query": {
            "sparql": "SELECT ?Caco2Permeability WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carbonyl compound\" .\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-1",
        "domain": "ontokin",
        "question": "Can I find a thermodynamic model for PC7H15O2 across all its chemical reaction mechanisms?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"PC7H15O2\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-394",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction OH + HO2 <=> H2O + O2 involved in the mechanism found in https://doi.org/10.1016/j.combustflame.2007.10.024",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"OH + HO2 <=> H2O + O2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-238",
        "domain": "ontokin",
        "question": "What kind of kinetic model does a chemical reaction use when C10KET4-1 is one of the reactants?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C10KET4-1\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-450",
        "domain": "ontospecies",
        "question": "Can you tell me the count of heavy atoms in InChI=1S/C22H29FO5/c1-12-8-16-15-5-4-13-9-14(25)6-7-19(13,2)21(15,23)17(26)10-20(16,3)22(12,28)18(27)11-24/h6-7,9,12,15-17,24,26,28H,4-5,8,10-11H2,1-3H3/t12-,15-,16-,17-,19-,20-,21-,22-/m0/s1?",
        "query": {
            "sparql": "SELECT ?HeavyAtomCount WHERE {\n  VALUES ?Species { \"InChI=1S/C22H29FO5/c1-12-8-16-15-5-4-13-9-14(25)6-7-19(13,2)21(15,23)17(26)10-20(16,3)22(12,28)18(27)11-24/h6-7,9,12,15-17,24,26,28H,4-5,8,10-11H2,1-3H3/t12-,15-,16-,17-,19-,20-,21-,22-/m0/s1\" }\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-454",
        "domain": "ontospecies",
        "question": "What is the number of hydrogen bond acceptors of InChI=1S/C10H14O4/c1-7(2)9(11)13-5-6-14-10(12)8(3)4/h1,3,5-6H2,2,4H3",
        "query": {
            "sparql": "SELECT ?HydrogenBondAcceptorCount WHERE {\n  VALUES ?Species { \"InChI=1S/C10H14O4/c1-7(2)9(11)13-5-6-14-10(12)8(3)4/h1,3,5-6H2,2,4H3\" }\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-629",
        "domain": "ontospecies",
        "question": "I'm searching for chemical species belonging to the p-block molecular entity and isoprenoid classes, with a polar surface area of 17.1, compound complexity over 200 but not between 200 and 246, and are used in Auto Products.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"p-block molecular entity\" .\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue = 17.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"isoprenoid\" .\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue < 200 || ?CompoundComplexityValue > 246 )\n  ?Species os:hasUse/rdfs:label \"Auto Products\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-572",
        "domain": "ontospecies",
        "question": "I need to know, what's the charge of a CCCCCCCCCCCCC=C molecule?",
        "query": {
            "sparql": "SELECT ?Charge WHERE {\n  VALUES ?Species { \"CCCCCCCCCCCCC=C\" }\n  ?Species os:hasCharge ?Charge .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-341",
        "domain": "ontokin",
        "question": "I'm trying to find out a chemical reaction that results in C10KET7-9-2.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C10KET7-9-2\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-13",
        "domain": "ontocompchem",
        "question": "What is the rotational constants of B2U calculated at the CCSD(T) level of theory, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"B2U\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-701",
        "domain": "ontospecies",
        "question": "Show me all the chemical species that fall under the classifications of diazole and polyatomic entity, belong to the class called chemical entity, and have no less than 2.7 rotatable bonds.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"diazole\" .\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue >= 2.7 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-277",
        "domain": "ontospecies",
        "question": "Looking for chemical species that are both polyatomic entity and cyclic compound, classified as Amino Phenols, with a dissociation constant of 9 or more.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"Amino Phenols\" .\n  ?Species os:hasDissociationConstants/os:value ?DissociationConstantsValue .\n  FILTER ( ?DissociationConstantsValue >= 9 )\n  ?Species os:hasChemicalClass/rdfs:label \"cyclic compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-894",
        "domain": "ontospecies",
        "question": "Which chemicals have a monoisotopic mass not in the range of (109, 134.2804826) but their solubility is more than or equals to 4.113?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue < 109 || ?MonoIsotopicWeightValue > 134.2804826 )\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue >= 4.113 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-733",
        "domain": "ontospecies",
        "question": "Can you find any chemical species that belong to the 1-benzyl-3-(dimethylamino)-2-methyl-1-phenylpropyl propanoate and nitrogen molecular entity chemical classes?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"1-benzyl-3-(dimethylamino)-2-methyl-1-phenylpropyl propanoate\" .\n  ?Species os:hasChemicalClass/rdfs:label \"nitrogen molecular entity\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-337",
        "domain": "ontocompchem",
        "question": "Can you tell me the energy level of the next-to-highest occupied molecular orbital in an Eu atom?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Eu\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-355",
        "domain": "ontospecies",
        "question": "What's the count of stereocenters and hydrogen bond acceptors for CCCCCCCCCCCCCCCCCCCCCCCCCCCC and C4H9NO2? Also, what is their heat of vaporization?",
        "query": {
            "sparql": "SELECT ?BondChiralCount ?HydrogenBondAcceptorCount ?HeatOfVaporization WHERE {\n  VALUES ?Species { \"CCCCCCCCCCCCCCCCCCCCCCCCCCCC\" \"C4H9NO2\" }\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-460",
        "domain": "ontospecies",
        "question": "Can you tell me about the hydrophobicity, surface tension, and hydrogen bond donors in C28H44O?",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount ?Hydrophobicity ?SurfaceTension WHERE {\n  VALUES ?Species { \"C28H44O\" }\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n  ?Species os:hasHydrophobicity ?Hydrophobicity .\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-340",
        "domain": "ontokin",
        "question": "In the study https://doi.org/10.1002/kin.20603, how many reactions involve MD6D10OOH as a reacting substance and end up producing C7H15O2-HP3R2?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD6D10OOH\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C7H15O2-HP3R2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-220",
        "domain": "ontospecies",
        "question": "For the chemical species whose chemical classification is organic heterocyclic compound and chemical class is organic cyclic compound, what is its molecular weight",
        "query": {
            "sparql": "SELECT ?MolecularWeight WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic heterocyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic cyclic compound\" .\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-106",
        "domain": "ontospecies",
        "question": "I'm looking for information on the number of isotope atoms found in InChI=1S/C2H6O3P/c1-4-6(3)5-2/h1-2H3/q+1.",
        "query": {
            "sparql": "SELECT ?IsotopeAtomCount WHERE {\n  VALUES ?Species { \"InChI=1S/C2H6O3P/c1-4-6(3)5-2/h1-2H3/q+1\" }\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-106",
        "domain": "ontokin",
        "question": "What is the transport model and thermodynamic model of RALD3OO across all the reaction mechanisms in which it appears",
        "query": {
            "sparql": "SELECT ?TransportModel ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"RALD3OO\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-105",
        "domain": "ontospecies",
        "question": "For 2-(4-chlorophenyl)-2-(1,2,4-triazol-1-ylmethyl)hexanenitrile and CC(F)(Cl)Cl, what is their undefined atom stereocenter count and vapor pressure",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount ?VaporPressure WHERE {\n  VALUES ?Species { \"2-(4-chlorophenyl)-2-(1,2,4-triazol-1-ylmethyl)hexanenitrile\" \"CC(F)(Cl)Cl\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n  ?Species os:hasVaporPressure ?VaporPressure .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-368",
        "domain": "ontocompchem",
        "question": "Can you find out the total and HOMO-2 energy of O2S as estimated at the HF level in every basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?HOMOMinus2Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"O2S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-277",
        "domain": "ontocompchem",
        "question": "Can you tell me the energy of the second lowest unoccupied molecular orbital of W as calculated by the B3LYP method with the 4-31G basis set?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"W\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"4-31G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-802",
        "domain": "ontospecies",
        "question": "Number of covalent units in InChI=1S/C2F4/c3-1(4)2(5)6?",
        "query": {
            "sparql": "SELECT ?CovalentUnitCount WHERE {\n  VALUES ?Species { \"InChI=1S/C2F4/c3-1(4)2(5)6\" }\n  ?Species os:hasCovalentUnitCount ?CovalentUnitCount .\n}"
        }
    }
]