[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-335",
        "domain": "ontospecies",
        "question": "I'm looking for information on InChI=1S/C10H18O/c1-9(2)7-4-5-10(9,3)8(11)6-7/h7-8,11H,4-6H2,1-3H3/t7-,8+,10+/m0/s1: its standard enthalpy of formation, SMILES string and density.",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation ?SMILES ?Density WHERE {\n  VALUES ?Species { \"InChI=1S/C10H18O/c1-9(2)7-4-5-10(9,3)8(11)6-7/h7-8,11H,4-6H2,1-3H3/t7-,8+,10+/m0/s1\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n  ?Species os:hasSMILES ?SMILES .\n  ?Species os:hasDensity ?Density .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-248",
        "domain": "ontospecies",
        "question": "What's the hydrophobicity and Caco-2 permeability of CCC(CC)O, C18H31NO4, and beta-picoline?",
        "query": {
            "sparql": "SELECT ?Hydrophobicity ?Caco2Permeability WHERE {\n  VALUES ?Species { \"CCC(CC)O\" \"C18H31NO4\" \"beta-picoline\" }\n  ?Species os:hasHydrophobicity ?Hydrophobicity .\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-994",
        "domain": "ontospecies",
        "question": "Can you tell me the exact mass, Caco-2 permeability, and rotatable bond count of chloromethylbenzene?",
        "query": {
            "sparql": "SELECT ?RotatableBondCount ?Caco2Permeability ?ExactMass WHERE {\n  VALUES ?Species { \"chloromethylbenzene\" }\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n  ?Species os:hasExactMass ?ExactMass .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-286",
        "domain": "ontokin",
        "question": "For C12O3-6, what is its thermodynamic model across all the reaction mechanisms in which it appears",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"C12O3-6\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-47",
        "domain": "ontospecies",
        "question": "Can you tell me the IUPAC names for 1,7,7-trimethylbicyclo[2.2.1]heptan-2-one, InChI=1S/Br2/c1-2, and C#C?",
        "query": {
            "sparql": "SELECT ?IUPACName WHERE {\n  VALUES ?Species { \"1,7,7-trimethylbicyclo[2.2.1]heptan-2-one\" \"InChI=1S/Br2/c1-2\" \"C#C\" }\n  ?Species os:hasIUPACName ?IUPACName .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-324",
        "domain": "ontocompchem",
        "question": "How to determine the energy of Kr, given a specific level of theory and basis set used for calculations?",
        "query": {
            "sparql": "SELECT ?SCFEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Kr\" .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-626",
        "domain": "ontospecies",
        "question": "Find me any chemical species classified as both an organic molecular entity and an organohalogen compound, which also have a molecular mass greater than 102.618?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue > 102.618 )\n  ?Species os:hasChemicalClass/rdfs:label \"organohalogen compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-429",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is bromine molecular entity and boiling point is greater than 444 and lower than 542.9050000000001 and chemical class is polyatomic entity and vapor density is not less than 0 and chemical class is molecular entity",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"bromine molecular entity\" .\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue > 444 && ?BoilingPointValue < 542.9050000000001 )\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasVaporDensity/os:value ?VaporDensityValue .\n  FILTER ( ?VaporDensityValue >= 0 )\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-162",
        "domain": "ontospecies",
        "question": "What is the melting point of the chemical species whose chemical classification is organic molecule and chemical classification is organooxygen compound and charge is > -1 and rotatable bond count is = 3.0",
        "query": {
            "sparql": "SELECT ?MeltingPoint WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecule\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organooxygen compound\" .\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -1 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue = 3.0 )\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-508",
        "domain": "ontospecies",
        "question": "Can you find chemical species that have around zero isotope atoms, density not exceeding 1508.21, at least -1 hydrogen bond donors and a polar surface area above -1?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue > -0.1 && ?IsotopeAtomCountValue < 0.1 )\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue <= 1508.21 )\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue >= -1.0 )\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue > -1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-630",
        "domain": "ontospecies",
        "question": "Need info on InChI=1S/C16H21Cl2NO2/c1-12-5-2-3-8-19(12)9-4-10-21-16(20)13-6-7-14(17)15(18)11-13/h6-7,11-12H,2-5,8-10H2,1H3's atom chiral undef count.",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount WHERE {\n  VALUES ?Species { \"InChI=1S/C16H21Cl2NO2/c1-12-5-2-3-8-19(12)9-4-10-21-16(20)13-6-7-14(17)15(18)11-13/h6-7,11-12H,2-5,8-10H2,1H3\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-42",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has product MD6OOH4J and has reactant C4H6CHO2-11",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD6OOH4J\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C4H6CHO2-11\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-41",
        "domain": "ontocompchem",
        "question": "I'm looking for the geometric measurement of ClO using the CC-pVTZ basis set at the CCSD(T) level of theory, can you help?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClO\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-68",
        "domain": "ontospecies",
        "question": "What are the chemical species whose vapor density is > 5.22 and < 6.38 and defined bond stereocenter count is bigger than -1 and atom chiral def count is < -1 or > 1",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasVaporDensity/os:value ?VaporDensityValue .\n  FILTER ( ?VaporDensityValue > 5.22 && ?VaporDensityValue < 6.38 )\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -1 )\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue < -1 || ?AtomChiralDefCountValue > 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-462",
        "domain": "ontospecies",
        "question": "Can you tell me the Log P value and PubChem Compound ID for InChI=1S/C8H11N/c1-6-3-7(2)5-8(9)4-6/h3-5H,9H2,1-2H3?",
        "query": {
            "sparql": "SELECT ?LogP ?CID WHERE {\n  VALUES ?Species { \"InChI=1S/C8H11N/c1-6-3-7(2)5-8(9)4-6/h3-5H,9H2,1-2H3\" }\n  ?Species os:hasLogP ?LogP .\n  ?Species os:hasCID ?CID .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-658",
        "domain": "ontospecies",
        "question": "Can you list the chemical species with an atom chiral def count below 1.0, belonging to the molecule class and used as environmental contaminant?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue < 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n  ?Species os:hasUse/rdfs:label \"environmental contaminant\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-148",
        "domain": "ontospecies",
        "question": "Can you tell me the boiling point of a chemical compound classified as both a saturated organic heterocyclic parent and a molecule?",
        "query": {
            "sparql": "SELECT ?BoilingPoint WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"saturated organic heterocyclic parent\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-130",
        "domain": "ontokin",
        "question": "In the publication https://doi.org/10.1002/kin.20026, which thermodynamic model was used for the chemical species in the reaction mechanism?",
        "query": {
            "sparql": "SELECT ?ThermoModel WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-419",
        "domain": "ontokin",
        "question": "What's the kinetic model for this chemical reaction: HO2 + H = H2O + O?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"HO2 + H = H2O + O\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-145",
        "domain": "ontocompchem",
        "question": "I'm looking for the energy of LUMO in B2U, what is it in respect to the calculation's theory level?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"B2U\" .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-998",
        "domain": "ontospecies",
        "question": "I need to find out the value of the Henry's law constant for phosphorous acid triphenyl ester.",
        "query": {
            "sparql": "SELECT ?HenrysLawConstant WHERE {\n  VALUES ?Species { \"phosphorous acid triphenyl ester\" }\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-584",
        "domain": "ontospecies",
        "question": "Can you tell me about the compound complexity and the temperature at which C(C(=O)O)C(=O)O autoignites?",
        "query": {
            "sparql": "SELECT ?CompoundComplexity ?AutoignitionTemperature WHERE {\n  VALUES ?Species { \"C(C(=O)O)C(=O)O\" }\n  ?Species os:hasCompoundComplexity ?CompoundComplexity .\n  ?Species os:hasAutoignitionTemperature ?AutoignitionTemperature .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-14",
        "domain": "ontocompchem",
        "question": "What is the total energy of Ce calculated at the PM6 level using the aug-cc-pVQZ or STO-3G or aug-cc-pVTZ basis set",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ce\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVQZ\" \"STO-3G\" \"aug-cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-479",
        "domain": "ontokin",
        "question": "Identify the chemical reaction with TC3H6COCH3 and CY346JC as reactants and C2H5C2H2C3H6CHO as a product on this link https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"TC3H6COCH3\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C2H5C2H2C3H6CHO\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"CY346JC\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-535",
        "domain": "ontospecies",
        "question": "I need to find out the specific temperatures where diethoxy-(4-nitrophenoxy)-thioxo-lambda5-phosphane and CCCCN1CCCCC1C(=O)NC2=C(C=CC=C2C)C transition from solid to liquid.",
        "query": {
            "sparql": "SELECT ?MeltingPoint WHERE {\n  VALUES ?Species { \"diethoxy-(4-nitrophenoxy)-thioxo-lambda5-phosphane\" \"CCCCN1CCCCC1C(=O)NC2=C(C=CC=C2C)C\" }\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-726",
        "domain": "ontospecies",
        "question": "Can you provide me with the number of atom stereocenters, undefined atom stereocenters, and the molecular formula for InChI=1S/C6H3Cl3O/c7-3-1-2-4(10)6(9)5(3)8/h1-2,10H?",
        "query": {
            "sparql": "SELECT ?AtomChiralCount ?AtomChiralUndefCount ?MolecularFormula WHERE {\n  VALUES ?Species { \"InChI=1S/C6H3Cl3O/c7-3-1-2-4(10)6(9)5(3)8/h1-2,10H\" }\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-356",
        "domain": "ontospecies",
        "question": "Can you list out the organic molecule and molecule types with a bond chiral count less than 1.0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue < 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecule\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-643",
        "domain": "ontospecies",
        "question": "What is the optical rotation of (9-methyl-3-oxa-9-azatricyclo[3.3.1.02,4]nonan-7-yl) 3-hydroxy-2-phenylpropanoate and CC1=CC=C(C=C1)S(=O)(=O)O",
        "query": {
            "sparql": "SELECT ?OpticalRotation WHERE {\n  VALUES ?Species { \"(9-methyl-3-oxa-9-azatricyclo[3.3.1.02,4]nonan-7-yl) 3-hydroxy-2-phenylpropanoate\" \"CC1=CC=C(C=C1)S(=O)(=O)O\" }\n  ?Species os:hasOpticalRotation ?OpticalRotation .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-338",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction that has product MPDIOXOM3",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MPDIOXOM3\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-861",
        "domain": "ontospecies",
        "question": "Can you tell me the number of atom stereocenters in InChI=1S/Cl2S2/c1-3-4-2?",
        "query": {
            "sparql": "SELECT ?AtomChiralCount WHERE {\n  VALUES ?Species { \"InChI=1S/Cl2S2/c1-3-4-2\" }\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-181",
        "domain": "ontocompchem",
        "question": "Information needed on NHOMO energy and second lowest unoccupied molecular orbital energy of Ni in terms of all theory levels and basis sets.",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?LUMOPlus1Energy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ni\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-84",
        "domain": "ontokin",
        "question": "Can you help me find the thermodynamic model for C12OOH11-2G in all reaction mechanisms where it's present?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"C12OOH11-2G\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-337",
        "domain": "ontospecies",
        "question": "Can you provide information on the melting point, vapor density, and atom chiral undef count of both C24H34O9 and 4-methyl-3-penten-2-one?",
        "query": {
            "sparql": "SELECT ?MeltingPoint ?VaporDensity ?AtomChiralUndefCount WHERE {\n  VALUES ?Species { \"C24H34O9\" \"4-methyl-3-penten-2-one\" }\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n  ?Species os:hasVaporDensity ?VaporDensity .\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-919",
        "domain": "ontospecies",
        "question": "I'm looking for Nitrogen Compounds with roughly 0.0 undefined atom stereocenter count that serve as Intermediate.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"Nitrogen Compounds\" .\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue > -0.1 && ?AtomChiralUndefCountValue < 0.1 )\n  ?Species os:hasUse/rdfs:label \"Intermediate\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-142",
        "domain": "ontokin",
        "question": "What's the kinetic model for a chemical reaction where PC7H14OOH-N is the reactant and MDDIOXO47 is the product?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"PC7H14OOH-N\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDDIOXO47\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-210",
        "domain": "ontospecies",
        "question": "I'm searching for chemical species that are part of the heteroorganic entity and organic molecular entity classes, but specifically within the category of  acetophenones.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"acetophenones\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-580",
        "domain": "ontospecies",
        "question": "I'm looking for the count of tautomers in CC1=CC(=C(C=C1)C)O.",
        "query": {
            "sparql": "SELECT ?TautomerCount WHERE {\n  VALUES ?Species { \"CC1=CC(=C(C=C1)C)O\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-387",
        "domain": "ontocompchem",
        "question": "What's the sum of all energy for Br2 based on the G3 level?",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Br2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-689",
        "domain": "ontospecies",
        "question": "What are the chemical species whose hydrogen bond acceptor count is >= 1 and chemical class is organonitrogen compound and chemical class is heterocyclic compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue >= 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"organonitrogen compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heterocyclic compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-385",
        "domain": "ontospecies",
        "question": "Search for chemicals in the class of fatty alcohol, having more than -1.0 defined bond stereocenters, playing a role as a volatile oil component, and also classified under the category of hydroxides.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"fatty alcohol\" .\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -1.0 )\n  ?Species os:hasUse/rdfs:label \"volatile oil component\" .\n  ?Species os:hasChemicalClass/rdfs:label \"fatty alcohol\" .\n  ?Species os:hasChemicalClass/rdfs:label \"hydroxides\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-725",
        "domain": "ontospecies",
        "question": "I'm looking for information on a compound which is both a hydrogen molecular entity and monoterpenoid, has around 0.3546375 as its Henry's law constant, and is also identified as a polyatomic entity. Specifically, I need to know its chemical class and how many hydrogen bond donors it has.",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel ?HydrogenBondDonorCount WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"hydrogen molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"monoterpenoid\" .\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue > 0.3546375*0.9 && ?HenrysLawConstantValue < 0.3546375*1.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-114",
        "domain": "ontospecies",
        "question": "Which chemical species carry a charge of more than -1.0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -1.0 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-442",
        "domain": "ontocompchem",
        "question": "Energy level of HOMO for O3 in the STO-4G basis set?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"O3\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-473",
        "domain": "ontocompchem",
        "question": "What is the energy of lowest unoccupied molecular orbital and rotational constants of FH calculated at the B3LYP level of theory, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?RotationalConstants ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"FH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-960",
        "domain": "ontospecies",
        "question": "Looking for chemical species that have a maximum of 1 hydrogen bond donor, less than 1 rotatable bond and a compound complexity greater than 52",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue <= 1.0 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue < 1.0 )\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue > 52 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-373",
        "domain": "ontocompchem",
        "question": "Find the HOMO-2 and HOMO-1 energy values of Bk using the PM6 level method",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Bk\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-170",
        "domain": "ontocompchem",
        "question": "Can you find the rotational constants and LUMO+2 energy for F- as per the CCSD(T) theoretical model, including the basis set used for calculations?",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?LUMOPlus2Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-64",
        "domain": "ontospecies",
        "question": "What are the chemical species whose atom chiral def count is greater than -1",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue > -1 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-11",
        "domain": "ontokin",
        "question": "Can you explain the reaction mechanism for OH + H2 <=> H + H2O?",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"OH + H2 <=> H + H2O\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-462",
        "domain": "ontocompchem",
        "question": "Using cc-pVDZ basis set, what's the calculated total Gibbs free energy of Tm?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-911",
        "domain": "ontospecies",
        "question": "I'm looking for molecular entities in the sulfur chemical class that have a boiling point less than 413.33499 or greater than 505.18721000000005.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue < 413.33499 || ?BoilingPointValue > 505.18721000000005 )\n  ?Species os:hasChemicalClass/rdfs:label \"sulfur molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n}"
        }
    }
]