[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-540",
        "domain": "ontospecies",
        "question": "Can you provide a list of chemical species with a surface tension greater than 0.0774, mono isotopic weight close to 38.963707, and hydrogen bond acceptors ranging from -1.0 to 1?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasSurfaceTension/os:value ?SurfaceTensionValue .\n  FILTER ( ?SurfaceTensionValue > 0.0774 )\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 38.963707*0.9 && ?MonoIsotopicWeightValue < 38.963707*1.1 )\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue > -1.0 && ?HydrogenBondAcceptorCountValue < 1 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-40",
        "domain": "ontocompchem",
        "question": "What is the ground state energy of H2O calculated using the STO-4G basis set across all level of theory",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2O\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-157",
        "domain": "ontospecies",
        "question": "Can you tell me the hydrophobicity, heat of combustion and PubChem ID associated with acridine-3,6-diamine?",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion ?Hydrophobicity ?CID WHERE {\n  VALUES ?Species { \"acridine-3,6-diamine\" }\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n  ?Species os:hasHydrophobicity ?Hydrophobicity .\n  ?Species os:hasCID ?CID .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-378",
        "domain": "ontokin",
        "question": "Looking for the specific chemical reaction where C12OOH3-OO5-2 and H2 are the reactants.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C12OOH3-OO5-2\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"H2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-25",
        "domain": "ontospecies",
        "question": "I need to know the Henry's law constant for molecular fluorine, InChI=1S/C3H6O3/c1-2(4)3(5)6/h2,4H,1H3,(H,5,6) and C10H14.",
        "query": {
            "sparql": "SELECT ?HenrysLawConstant WHERE {\n  VALUES ?Species { \"molecular fluorine\" \"InChI=1S/C3H6O3/c1-2(4)3(5)6/h2,4H,1H3,(H,5,6)\" \"C10H14\" }\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-185",
        "domain": "ontospecies",
        "question": "Can you tell me the standard heat of formation for both CC(C)CCON=O and C25H22O10?",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"CC(C)CCON=O\" \"C25H22O10\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-30",
        "domain": "ontocompchem",
        "question": "Can you tell me the total Gibbs free energy calculation for W at HF level with the aug-cc-pVDZ basis set?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"W\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-542",
        "domain": "ontospecies",
        "question": "Search for chemicals which are both a monocyclic compound and an organonitrogen compound, with their polar surface area being not less than 67.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"monocyclic compound\" .\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue >= 67 )\n  ?Species os:hasChemicalClass/rdfs:label \"monocyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organonitrogen compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-813",
        "domain": "ontospecies",
        "question": "What are the chemical species whose dissociation constants is lower than 11",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasDissociationConstants/os:value ?DissociationConstantsValue .\n  FILTER ( ?DissociationConstantsValue < 11 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-298",
        "domain": "ontokin",
        "question": "What is the thermodynamic model of C4H6CHO2-24 across all the reaction mechanisms in which it appears",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"C4H6CHO2-24\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-253",
        "domain": "ontospecies",
        "question": "What's the count of non-hydrogen atoms in C15H15NO2 and 9-methoxy-7-furo[3,2-g][1]benzopyranone? Also, their isoelectric and melting points?",
        "query": {
            "sparql": "SELECT ?HeavyAtomCount ?IsoelectricPoint ?MeltingPoint WHERE {\n  VALUES ?Species { \"C15H15NO2\" \"9-methoxy-7-furo[3,2-g][1]benzopyranone\" }\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-316",
        "domain": "ontospecies",
        "question": "How many chiral atoms are there in CC(C)C(=O)C?",
        "query": {
            "sparql": "SELECT ?AtomChiralCount WHERE {\n  VALUES ?Species { \"CC(C)C(=O)C\" }\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-510",
        "domain": "ontospecies",
        "question": "What are the chemical species whose rotatable bond count is equal to 1.0 and chemical class is organic molecular entity and chemical class is substituted aniline",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue = 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"substituted aniline\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-901",
        "domain": "ontospecies",
        "question": "What is the molecular formula of the chemical species whose chemical classification is heteroorganic entity and XLOGP3 is higher than 0.54 and less than 1 and monoisotopic mass is not greater than 134.29284",
        "query": {
            "sparql": "SELECT ?MolecularFormula WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value > 0.54 && ?XLogP3Value < 1 )\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue <= 134.29284 )\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-946",
        "domain": "ontospecies",
        "question": "Search for chemicals that are part of the carbon group molecular entity class, also classified as an organic cyclic compound, with a stereocenter count outside of the range -1 to 1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carbon group molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic cyclic compound\" .\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue < -1 || ?BondChiralUndefCountValue > 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-110",
        "domain": "ontospecies",
        "question": "I need to find out the melting point of an organochalcogen compound that also is a main group molecular entity and serves as a Dispersing agent.",
        "query": {
            "sparql": "SELECT ?MeltingPoint WHERE {\n  ?Species os:hasUse/rdfs:label \"Dispersing agent\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organochalcogen compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"main group molecular entity\" .\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-470",
        "domain": "ontokin",
        "question": "Kinetic model of the chemical reaction H2 + O2 <=> OH + OH from the study at https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2 + O2 <=> OH + OH\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-499",
        "domain": "ontokin",
        "question": "Can someone explain the kinetic model of the chemical reaction H2 + O <=> OH + H as detailed on www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2 + O <=> OH + H\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-384",
        "domain": "ontokin",
        "question": "How many chemical reaction that has reactant CH3CY24PD1 and has product MDCY485O and is involved in the mechanism found in https://doi.org/10.1016/j.combustflame.2007.10.024",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CH3CY24PD1\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDCY485O\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-779",
        "domain": "ontospecies",
        "question": "I'm looking for molecule type chemical species with an approximate dissociation constant of 3.3 and no more than one chiral atom.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n  ?Species os:hasDissociationConstants/os:value ?DissociationConstantsValue .\n  FILTER ( ?DissociationConstantsValue > 3.3*0.9 && ?DissociationConstantsValue < 3.3*1.1 )\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue <= 1.0 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-240",
        "domain": "ontokin",
        "question": "For CH2OCH2OCHO, what is its transport model across all the reaction mechanisms in which it appears",
        "query": {
            "sparql": "SELECT ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"CH2OCH2OCHO\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-614",
        "domain": "ontospecies",
        "question": "Charge and rotatable bond count for C8H16O2, can you provide them?",
        "query": {
            "sparql": "SELECT ?Charge ?RotatableBondCount WHERE {\n  VALUES ?Species { \"C8H16O2\" }\n  ?Species os:hasCharge ?Charge .\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-329",
        "domain": "ontocompchem",
        "question": "What is the rotational constants of H3N across all basis set",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H3N\" .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-182",
        "domain": "ontokin",
        "question": "What is the reaction mechanism that invovles the reaction H2O2 + O <=> HO2 + OH",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H2O2 + O <=> HO2 + OH\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-522",
        "domain": "ontospecies",
        "question": "I need to know the number of tautomers, autoignition temperature and collision cross section for CCCCCCCCCCCC(=O)OC.",
        "query": {
            "sparql": "SELECT ?TautomerCount ?CollisionCrossSection ?AutoignitionTemperature WHERE {\n  VALUES ?Species { \"CCCCCCCCCCCC(=O)OC\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n  ?Species os:hasAutoignitionTemperature ?AutoignitionTemperature .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-328",
        "domain": "ontocompchem",
        "question": "What is the rotational constants of Np across all basis set",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Np\" .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-841",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that are classified as both organohalogen compound and heteroorganic entity.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organohalogen compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-230",
        "domain": "ontospecies",
        "question": "Find chemicals where XLogP3 is at least 1.53, surface tension equals to exactly 6.58, exact mass ranges from over 91.00840500000001 but under 111.23249500000001, undefined atom stereocenter count doesn't exceed one and bond chiral undef count is under one.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value >= 1.53 )\n  ?Species os:hasSurfaceTension/os:value ?SurfaceTensionValue .\n  FILTER ( ?SurfaceTensionValue = 6.58 )\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 91.00840500000001 && ?ExactMassValue < 111.23249500000001 )\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue <= 1.0 )\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue < 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-504",
        "domain": "ontospecies",
        "question": "Can I find out the rotatable bond count and undefined atom stereocenter count for a chemical species that has around 0.0 hydrogen bond acceptors and a bond chiral def count between -1.0 and 1.0?",
        "query": {
            "sparql": "SELECT ?RotatableBondCount ?AtomChiralUndefCount WHERE {\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue > -0.1 && ?HydrogenBondAcceptorCountValue < 0.1 )\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -1.0 && ?BondChiralDefCountValue < 1.0 )\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-246",
        "domain": "ontocompchem",
        "question": "Can someone tell me the total enthalpy of Rh when calculated with STO-3G basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Rh\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-254",
        "domain": "ontocompchem",
        "question": "I am looking for the value of energy for Es's highest occupied molecular orbital calculated at the M06-2X level with the aug-cc-pVDZ basis set.",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Es\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-300",
        "domain": "ontocompchem",
        "question": "Using UB3LYP, what's the molecular structure and ground state energy of COS?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"COS\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-144",
        "domain": "ontokin",
        "question": "What's the chemical process that uses SXC12H25 and C2H5-2-SAX1C6H10 as reacting substances?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"SXC12H25\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C2H5-2-SAX1C6H10\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-519",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is phenols and boiling point is equal to 558.15 and chemical classification is organochalcogen compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"phenols\" .\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue = 558.15 )\n  ?Species os:hasChemicalClass/rdfs:label \"organochalcogen compound\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-287",
        "domain": "ontokin",
        "question": "I'm looking for the chemical reaction that uses MDCY583OXO as a reactant.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDCY583OXO\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-352",
        "domain": "ontocompchem",
        "question": "Information on Br- frequencies determined by M06-2X theory utilizing aug-cc-pVTZ or 6-311+G basis sets.",
        "query": {
            "sparql": "SELECT ?Frequencies WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Br-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" \"6-311+G\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-192",
        "domain": "ontokin",
        "question": "I'm looking for the chemical reaction described in https://doi.org/10.1002/kin.20026 that produces NC3-QOOH.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"NC3-QOOH\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-706",
        "domain": "ontospecies",
        "question": "Which chemicals have a vapor pressure of more than 4?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue > 4 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-283",
        "domain": "ontocompchem",
        "question": "Total Gibbs free energy for H2 using RB3LYP theoretical method",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tb\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-372",
        "domain": "ontokin",
        "question": "What's the kinetic model for a chemical reaction involving reactant C12KET8-10-2 and product C(CO)2-A, as documented in the mechanism at https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C12KET8-10-2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C(CO)2-A\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-333",
        "domain": "ontospecies",
        "question": "How many non-hydrogen atoms are there in C2H5NO2, InChI=1S/C3H2ClF5O/c4-1(5)3(8,9)10-2(6)7/h1-2H and CC(C)(C)OC? Also want to know about their solubility and their ability to accept hydrogen bonds.",
        "query": {
            "sparql": "SELECT ?Solubility ?HydrogenBondAcceptorCount ?HeavyAtomCount WHERE {\n  VALUES ?Species { \"C2H5NO2\" \"InChI=1S/C3H2ClF5O/c4-1(5)3(8,9)10-2(6)7/h1-2H\" \"CC(C)(C)OC\" }\n  ?Species os:hasSolubility ?Solubility .\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-456",
        "domain": "ontospecies",
        "question": "I'm searching for chemical species with an exact mass greater than 145.767519 and belong to the classes dichlorophenol, organic molecular entity, and molecule. Also, their Henry's law constant should be less than 1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 145.767519 )\n  ?Species os:hasChemicalClass/rdfs:label \"dichlorophenol\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue < 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-133",
        "domain": "ontospecies",
        "question": "Search for chemical species in the chemical entity class that have a minimum solubility of 0.045899999999999996, an approximate logS of -3.7 and a maximum mono isotopic weight of 279.50373.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue >= 0.045899999999999996 )\n  ?Species os:hasLogS/os:value ?LogSValue .\n  FILTER ( ?LogSValue > -3.7*1.1 && ?LogSValue < -3.7*0.9 )\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue <= 279.50373 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-125",
        "domain": "ontocompchem",
        "question": "What is the total Gibbs free energy and NHOMO energy of Tc across all basis set",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?HOMOMinus1Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tc\" .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-887",
        "domain": "ontospecies",
        "question": "What are the chemical species whose role is Preservative and role is antibacterial agent and chemical classification is organooxygen compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"Preservative\" .\n  ?Species os:hasUse/rdfs:label \"antibacterial agent\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organooxygen compound\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-289",
        "domain": "ontokin",
        "question": "Looking for information on what kind of chemical reaction would result in C11H23OO-1-2 if the reactant is C11OOH1-OO3-2.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C11H23OO-1-2\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C11OOH1-OO3-2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-71",
        "domain": "ontospecies",
        "question": "I'm looking for the number of covalent units present in C12H6Cl4O2S.",
        "query": {
            "sparql": "SELECT ?CovalentUnitCount WHERE {\n  VALUES ?Species { \"C12H6Cl4O2S\" }\n  ?Species os:hasCovalentUnitCount ?CovalentUnitCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-837",
        "domain": "ontospecies",
        "question": "What is the number of hydrogen bond donors of the chemical species whose chemical classification is nitrogen molecular entity and chemical classification is organic molecular entity",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"nitrogen molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-600",
        "domain": "ontospecies",
        "question": "Monoisotopic mass and uses of InChI=1S/C17H23N3O/c1-19(2)12-13-20(17-6-4-5-11-18-17)14-15-7-9-16(21-3)10-8-15/h4-11H,12-14H2,1-3H3",
        "query": {
            "sparql": "SELECT ?MonoIsotopicWeight ?UseLabel WHERE {\n  VALUES ?Species { \"InChI=1S/C17H23N3O/c1-19(2)12-13-20(17-6-4-5-11-18-17)14-15-7-9-16(21-3)10-8-15/h4-11H,12-14H2,1-3H3\" }\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-610",
        "domain": "ontospecies",
        "question": "Looking for chemical species with approximate viscosity of 0.00132",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasViscosity/os:value ?ViscosityValue .\n  FILTER ( ?ViscosityValue > 0.00132*0.9 && ?ViscosityValue < 0.00132*1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-136",
        "domain": "ontospecies",
        "question": "For C(CCC(=O)O)CCN and 3-(3,4-dichlorophenyl)-1-methoxy-1-methyl-urea, what is their Log P",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  VALUES ?Species { \"C(CCC(=O)O)CCN\" \"3-(3,4-dichlorophenyl)-1-methoxy-1-methyl-urea\" }\n  ?Species os:hasLogP ?LogP .\n}"
        }
    }
]