[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-177",
        "domain": "ontospecies",
        "question": "For 2-methyl-1-pentene, what is its monoisotopic mass",
        "query": {
            "sparql": "SELECT ?MonoIsotopicWeight WHERE {\n  VALUES ?Species { \"2-methyl-1-pentene\" }\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-196",
        "domain": "ontospecies",
        "question": "Searching for the logS of a nitro compound that has a vapor pressure higher than zero and density exceeding 1.1340000000000001.",
        "query": {
            "sparql": "SELECT ?LogS WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue > 0 )\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue > 1.1340000000000001 )\n  ?Species os:hasChemicalClass/rdfs:label \"nitro compound\" .\n  ?Species os:hasLogS ?LogS .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-362",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is s-block molecular entity and compound complexity is approximately 11.6 and chemical classification is molecule",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"s-block molecular entity\" .\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue > 11.6*0.9 && ?CompoundComplexityValue < 11.6*1.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-88",
        "domain": "ontocompchem",
        "question": "What is the LUMO+2 energy and energy of Dy calculated using the STO-3G or cc-pVQZ basis set",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Dy\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" \"cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-294",
        "domain": "ontocompchem",
        "question": "Can you tell me about the geometry associated with Pm?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pm\" .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-129",
        "domain": "ontokin",
        "question": "I'm looking for the process where AC5H10OOH-C reacts and produces MN58D in a chemical reaction.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MN58D\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"AC5H10OOH-C\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-452",
        "domain": "ontocompchem",
        "question": "Can I find out the SLUMO energy of W when computed with either 3-21G, aug-cc-pVTZ, or 6-311G basis set?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"W\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" \"aug-cc-pVTZ\" \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-92",
        "domain": "ontocompchem",
        "question": "Can you provide the Gibbs free energy, LUMO energy, and total energy of Mn as calculated with the B3LYP method and STO-3G basis set?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?LUMOEnergy ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mn\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-45",
        "domain": "ontospecies",
        "question": "Need info on the ionization potential and density of InChI=1S/C7H5N/c8-6-7-4-2-1-3-5-7/h1-5H, COC1=NN(C(=O)S1)CSP(=S)(OC)OC, InChI=1S/C2H6OS/c3-1-2-4/h3-4H,1-2H2.",
        "query": {
            "sparql": "SELECT ?Density ?IonizationPotential WHERE {\n  VALUES ?Species { \"InChI=1S/C7H5N/c8-6-7-4-2-1-3-5-7/h1-5H\" \"COC1=NN(C(=O)S1)CSP(=S)(OC)OC\" \"InChI=1S/C2H6OS/c3-1-2-4/h3-4H,1-2H2\" }\n  ?Species os:hasDensity ?Density .\n  ?Species os:hasIonizationPotential ?IonizationPotential .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-365",
        "domain": "ontokin",
        "question": "I'm looking for the kinetic model of the equation H + O2 (+ H2O) <=> HO2 (+ H2O), how can I find it?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + O2 (+ H2O) <=> HO2 (+ H2O)\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-291",
        "domain": "ontocompchem",
        "question": "What's the energy of the LUMO for Br- when figured out via CCSD(T) theory level and using 6-311G as the basis set?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Br-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-954",
        "domain": "ontospecies",
        "question": "Could you tell me the molecular weights of both 1-bromopropane and C10H16?",
        "query": {
            "sparql": "SELECT ?MolecularWeight WHERE {\n  VALUES ?Species { \"1-bromopropane\" \"C10H16\" }\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-361",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is hydroxides and use is Viscosity modifiers and role is Surfactant (surface active agent)",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"hydroxides\" .\n  ?Species os:hasUse/rdfs:label \"Viscosity modifiers\" .\n  ?Species os:hasUse/rdfs:label \"Surfactant (surface active agent)\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-258",
        "domain": "ontokin",
        "question": "MNKET64 is used as a reactant in what chemical reaction?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MNKET64\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-983",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is sulfamides and chemical classification is molecular entity",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"sulfamides\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-473",
        "domain": "ontokin",
        "question": "Can you find out the total count of chemical reactions mentioned in the mechanism of the study available at https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-209",
        "domain": "ontokin",
        "question": "For the chemical reaction OH + OH (+ M) <=> H2O2 (+ M) involved in the mechanism found in www.osti.gov/servlets/purl/90098-26Ev73/webviewable/, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"OH + OH (+ M) <=> H2O2 (+ M)\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-33",
        "domain": "ontospecies",
        "question": "What is the Log S of InChI=1S/C9H18O2/c1-2-3-4-5-6-7-8-9(10)11/h2-8H2,1H3,(H,10,11)",
        "query": {
            "sparql": "SELECT ?LogS WHERE {\n  VALUES ?Species { \"InChI=1S/C9H18O2/c1-2-3-4-5-6-7-8-9(10)11/h2-8H2,1H3,(H,10,11)\" }\n  ?Species os:hasLogS ?LogS .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-163",
        "domain": "ontocompchem",
        "question": "What is the total energy of H2O calculated at the M06 level of theory using the aug-cc-pVDZ or CC-pVTZ basis set",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2O\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-143",
        "domain": "ontocompchem",
        "question": "How can I find the rotational constants of Cm using the RB3LYP level of theory and either STO-5G, CC-pVQZ, or CC-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-5G\" \"CC-pVQZ\" \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-990",
        "domain": "ontospecies",
        "question": "Can you find me any chemical species with an XLogP3 value equal to or greater than 1 that are classified as organic molecule, nitrogen molecular entity and organic cyclic compound?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value >= 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecule\" .\n  ?Species os:hasChemicalClass/rdfs:label \"nitrogen molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic cyclic compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-249",
        "domain": "ontospecies",
        "question": "Need to know the molecular formula and hydrogen bond donor count for a compound with a bond chiral def count above -1.0, an atom chiral def count of 0.0, and a defined atom stereocenter count of no more than 1.",
        "query": {
            "sparql": "SELECT ?MolecularFormula ?HydrogenBondDonorCount WHERE {\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -1.0 )\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue <= 1 )\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-357",
        "domain": "ontospecies",
        "question": "Can you list the hydrocarbon chemical species with a polar surface area less than 1?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"hydrocarbon\" .\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue < 1 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-147",
        "domain": "ontocompchem",
        "question": "Can I find the energy level of the highest occupied molecular orbital for O3S using a specified theory level and basis set?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"O3S\" .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-23",
        "domain": "ontospecies",
        "question": "For InChI=1S/C3H7NO3/c1-2-3-7-4(5)6/h2-3H2,1H3 and C18H16N2, what are its different labels",
        "query": {
            "sparql": "SELECT ?IdentifierName WHERE {\n  VALUES ?Species { \"InChI=1S/C3H7NO3/c1-2-3-7-4(5)6/h2-3H2,1H3\" \"C18H16N2\" }\n  ?Species ?hasIdentifierName ?IdentifierName .\n  ?IdentifierName a/rdfs:subClassOf os:Identifier .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-44",
        "domain": "ontocompchem",
        "question": "I'm working on Br2 and need to know its ground state energy with the 6-311G basis set. Also, need information on what theoretical level the calculations are done.",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Br2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-428",
        "domain": "ontocompchem",
        "question": "What is the ground state energy and total energy of Am calculated using the cc-pVDZ basis set",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Am\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-651",
        "domain": "ontospecies",
        "question": "Can you list the chemical compounds with a vapor pressure of 263.835 or more and around 0.065 surface tension?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue >= 263.835 )\n  ?Species os:hasSurfaceTension/os:value ?SurfaceTensionValue .\n  FILTER ( ?SurfaceTensionValue > 0.065*0.9 && ?SurfaceTensionValue < 0.065*1.1 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-132",
        "domain": "ontocompchem",
        "question": "What is the optimized geometry and energy of F3N calculated using the STO-4G basis set across all level of theory",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?SCFEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F3N\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-115",
        "domain": "ontocompchem",
        "question": "Looking for LUMO energy of O2S through PM6 theory level employed on STO-3G basis set.",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"O2S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-237",
        "domain": "ontocompchem",
        "question": "What is the energy of lowest unoccupied molecular orbital of H2S, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2S\" .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-259",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has reactant C4H8O4_35",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C4H8O4_35\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-755",
        "domain": "ontospecies",
        "question": "I need to find out the dissociation constants and polar surface area of 3a,4,7,7a-tetrahydro-2-benzofuran-1,3-dione.",
        "query": {
            "sparql": "SELECT ?PolarSurfaceArea ?DissociationConstants WHERE {\n  VALUES ?Species { \"3a,4,7,7a-tetrahydro-2-benzofuran-1,3-dione\" }\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-808",
        "domain": "ontospecies",
        "question": "I'm looking for the XLOGP3 of C(C(Cl)(Cl)Cl)(Cl)Cl, could you help?",
        "query": {
            "sparql": "SELECT ?XLogP3 WHERE {\n  VALUES ?Species { \"C(C(Cl)(Cl)Cl)(Cl)Cl\" }\n  ?Species os:hasXLogP3 ?XLogP3 .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-27",
        "domain": "ontospecies",
        "question": "Can you find the hashed InChI, exact mass, and chemical classification for C16H24N2O?",
        "query": {
            "sparql": "SELECT ?InChIKey ?ExactMass ?ChemicalClassLabel WHERE {\n  VALUES ?Species { \"C16H24N2O\" }\n  ?Species os:hasInChIKey ?InChIKey .\n  ?Species os:hasExactMass ?ExactMass .\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-282",
        "domain": "ontokin",
        "question": "Can you help me find the kinetic model of a chemical reaction that uses C9H17-17 as a reactant and produces PHNTHROXY-1 and NEOC5H11O2 as described in https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"PHNTHROXY-1\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"NEOC5H11O2\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C9H17-17\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-590",
        "domain": "ontospecies",
        "question": "Can you find me chemical species used as Lubricants and lubricant additives with compound complexity not between -1 and 1.0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue < -1 || ?CompoundComplexityValue > 1.0 )\n  ?Species os:hasUse/rdfs:label \"Lubricants and lubricant additives\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-219",
        "domain": "ontospecies",
        "question": "Need to find out the IUPAC name for (4R,4aS,6R)-4,4a-dimethyl-6-(1-methylethenyl)-3,4,5,6,7,8-hexahydronaphthalen-2-one, along with its number of rotatable bonds and undefined bond stereocenters.",
        "query": {
            "sparql": "SELECT ?IUPACName ?RotatableBondCount ?BondChiralUndefCount WHERE {\n  VALUES ?Species { \"(4R,4aS,6R)-4,4a-dimethyl-6-(1-methylethenyl)-3,4,5,6,7,8-hexahydronaphthalen-2-one\" }\n  ?Species os:hasIUPACName ?IUPACName .\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-223",
        "domain": "ontokin",
        "question": "What's the kinetic model of a reaction that uses CY5910J and produces CY806, according to the mechanism described at www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CY5910J\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"CY806\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-681",
        "domain": "ontospecies",
        "question": "What's the LogS value for benzophenone?",
        "query": {
            "sparql": "SELECT ?LogS WHERE {\n  VALUES ?Species { \"benzophenone\" }\n  ?Species os:hasLogS ?LogS .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-172",
        "domain": "ontokin",
        "question": "Searching for the thermodynamic and transport models for the chemical species featured in the reaction mechanism on www.osti.gov/servlets/purl/90098-26Ev73/webviewable/.",
        "query": {
            "sparql": "SELECT ?ThermoModel ?TransportModel WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-620",
        "domain": "ontospecies",
        "question": "Can you tell me the heat of vaporization for InChI=1S/C10H10Cl2O3/c11-7-3-4-9(8(12)6-7)15-5-1-2-10(13)14/h3-4,6H,1-2,5H2,(H,13,14)?",
        "query": {
            "sparql": "SELECT ?HeatOfVaporization WHERE {\n  VALUES ?Species { \"InChI=1S/C10H10Cl2O3/c11-7-3-4-9(8(12)6-7)15-5-1-2-10(13)14/h3-4,6H,1-2,5H2,(H,13,14)\" }\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-208",
        "domain": "ontokin",
        "question": "I need information on the kinetic model for this chemical reaction: OH + OH results in H2O + O. The details are on www.osti.gov/servlets/purl/90098-26Ev73/webviewable/.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"OH + OH = H2O + O\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-16",
        "domain": "ontocompchem",
        "question": "Looking for the calculations of total energy and SLUMO energy for Pt at the PBE0 level using the basis sets aug-cc-pVTZ, aug-cc-pVQZ, or 6-311G.",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pt\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" \"aug-cc-pVQZ\" \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-217",
        "domain": "ontospecies",
        "question": "What's the heat of vaporization for InChI=1S/C12H17O4PS2/c1-4-16-12(13)11(10-8-6-5-7-9-10)19-17(18,14-2)15-3/h5-9,11H,4H2,1-3H3?",
        "query": {
            "sparql": "SELECT ?HeatOfVaporization WHERE {\n  VALUES ?Species { \"InChI=1S/C12H17O4PS2/c1-4-16-12(13)11(10-8-6-5-7-9-10)19-17(18,14-2)15-3/h5-9,11H,4H2,1-3H3\" }\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-695",
        "domain": "ontospecies",
        "question": "Looking for chemical species that are classified as polyatomic entity and plant metabolite, have a polar surface area of 39 or more, and belong to the zwitterion chemical class.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue >= 39 )\n  ?Species os:hasUse/rdfs:label \"plant metabolite\" .\n  ?Species os:hasChemicalClass/rdfs:label \"zwitterion\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-460",
        "domain": "ontocompchem",
        "question": "What are the energy values for the highest occupied molecular orbital, total energy, and HOMO-2 for F3N considering all levels of theory and basis sets?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?TotalEnergy ?HOMOMinus2Energy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F3N\" .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-492",
        "domain": "ontokin",
        "question": "For the chemical reaction that has product MH6O2, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MH6O2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-456",
        "domain": "ontocompchem",
        "question": "Can you help me find the LUMO+2 energy and frequencies for F- when calculated at the CCSD(T) level with all basis sets?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?Frequencies ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-656",
        "domain": "ontospecies",
        "question": "Can you help me find chemical species with a solubility less than or equal to 1, charge either below -1 or above 1, no undefined bond stereocenters and just one hydrogen bond acceptor?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue <= 1 )\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue < -1 || ?ChargeValue > 1.0 )\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue = 0.0 )\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue = 1.0 )\n}"
        }
    }
]