[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-922",
        "domain": "ontospecies",
        "question": "I'm looking for different terminologies used to refer to InChI=1S/C12H14N4O2S/c1-8-7-9(2)15-12(14-8)16-19(17,18)11-5-3-10(13)4-6-11/h3-7H,13H2,1-2H3,(H,14,15,16).",
        "query": {
            "sparql": "SELECT ?IdentifierName WHERE {\n  VALUES ?Species { \"InChI=1S/C12H14N4O2S/c1-8-7-9(2)15-12(14-8)16-19(17,18)11-5-3-10(13)4-6-11/h3-7H,13H2,1-2H3,(H,14,15,16)\" }\n  ?Species ?hasIdentifierName ?IdentifierName .\n  ?IdentifierName a/rdfs:subClassOf os:Identifier .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-756",
        "domain": "ontospecies",
        "question": "What are the chemical species whose covalent unit count is approximately 1.0",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue > 1.0*0.9 && ?CovalentUnitCountValue < 1.0*1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-786",
        "domain": "ontospecies",
        "question": "Can you find any chemical compounds with roughly 0.0 bond chiral count, a mono isotopic weight of 316.0139, and an autoignition temperature close to 160.0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > -0.1 && ?BondChiralCountValue < 0.1 )\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue = 316.0139 )\n  ?Species os:hasAutoignitionTemperature/os:value ?AutoignitionTemperatureValue .\n  FILTER ( ?AutoignitionTemperatureValue > 160.0*0.9 && ?AutoignitionTemperatureValue < 160.0*1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-852",
        "domain": "ontospecies",
        "question": "What's the Chemical Entities of Biological Interest ID and InChI for a chemical species that falls outside the (-1, 1.0) bond chiral count range and belongs to the hydrogen molecular entity, heterocyclic compound, and nitrogen molecular entity classes?",
        "query": {
            "sparql": "SELECT ?ChebiID ?InChI WHERE {\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue < -1 || ?BondChiralCountValue > 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"hydrogen molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heterocyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"nitrogen molecular entity\" .\n  ?Species os:hasChebiID ?ChebiID .\n  ?Species os:hasInChI ?InChI .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-203",
        "domain": "ontokin",
        "question": "Can you show me the chemical reactions where CY368 acts as a reactant?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CY368\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-992",
        "domain": "ontospecies",
        "question": "Can you help me find chemical entities that are classified as olefins, have a Henry's law constant of 22088.85, and are used in personal care?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue = 22088.85 )\n  ?Species os:hasChemicalClass/rdfs:label \"olefin\" .\n  ?Species os:hasUse/rdfs:label \"Personal Care\" .\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-422",
        "domain": "ontokin",
        "question": "What's the chemical reaction's kinetic model if the end product is C5H4?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C5H4\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-430",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is s-block molecular entity and atom chiral count is > 4.5 and chemical classification is main group molecular entity",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"s-block molecular entity\" .\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue > 4.5 )\n  ?Species os:hasChemicalClass/rdfs:label \"main group molecular entity\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-269",
        "domain": "ontokin",
        "question": "I need to understand the mechanism of a reaction that includes C7H15CHCO.",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"C7H15CHCO\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-286",
        "domain": "ontospecies",
        "question": "What's the autoignition temperature for CCCCS?",
        "query": {
            "sparql": "SELECT ?AutoignitionTemperature WHERE {\n  VALUES ?Species { \"CCCCS\" }\n  ?Species os:hasAutoignitionTemperature ?AutoignitionTemperature .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-702",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species from Other Classes with a monoisotopic weight in the range of 138 to 169.42927100000003.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"Other Classes\" .\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 138 && ?MonoIsotopicWeightValue < 169.42927100000003 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-227",
        "domain": "ontocompchem",
        "question": "Can you tell me the values for electronic, SLUMO energy and the optimized geometry of Kr found at PM6 level using STO-3G or CC-pVTZ basis sets?",
        "query": {
            "sparql": "SELECT ?SCFEnergy ?OptimizedGeometry ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Kr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-530",
        "domain": "ontospecies",
        "question": "What are the chemical species whose use is Intermediate and application is Saccharomyces cerevisiae metabolite and number of hydrogen bond donors is >= 0 and role is Solvent",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"Intermediate\" .\n  ?Species os:hasUse/rdfs:label \"Saccharomyces cerevisiae metabolite\" .\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue >= 0 )\n  ?Species os:hasUse/rdfs:label \"Solvent\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-311",
        "domain": "ontocompchem",
        "question": "Look up the HF level computation of the molecular structure and total Gibbs free energy of Sm using the aug-cc-pVTZ basis set.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Sm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-873",
        "domain": "ontospecies",
        "question": "What are the values for the ChEBI ID, bond chiral count, and XLogP3 of both C3H5NO and C1=CC=C2C(=C1)C3=CC=CC=C3S2?",
        "query": {
            "sparql": "SELECT ?ChebiID ?BondChiralCount ?XLogP3 WHERE {\n  VALUES ?Species { \"C3H5NO\" \"C1=CC=C2C(=C1)C3=CC=CC=C3S2\" }\n  ?Species os:hasChebiID ?ChebiID .\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n  ?Species os:hasXLogP3 ?XLogP3 .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-395",
        "domain": "ontocompchem",
        "question": "Can you show me the total energy calculation for BP using the 6-311G or STO-2G basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BP\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" \"STO-2G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-356",
        "domain": "ontokin",
        "question": "Can you explain the kinetic model for a chemical reaction where C7H11-161 is the product?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C7H11-161\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-124",
        "domain": "ontospecies",
        "question": "Can you provide me with the various identifiers for 1,4-diazabicyclo[2.2.2]octane?",
        "query": {
            "sparql": "SELECT ?IdentifierName WHERE {\n  VALUES ?Species { \"1,4-diazabicyclo[2.2.2]octane\" }\n  ?Species ?hasIdentifierName ?IdentifierName .\n  ?IdentifierName a/rdfs:subClassOf os:Identifier .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-3",
        "domain": "ontocompchem",
        "question": "I'm trying to find out the total energy, ground state energy, and optimized geometry of HO- using the PBE0 level of theory and STO-4G basis set.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?ZeroPointEnergy ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HO-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-389",
        "domain": "ontokin",
        "question": "Can I find the number of chemical reactions in https://doi.org/10.1016/j.combustflame.2007.10.024 where CXCCJCXC behaves as a reactant and C9OOH2-1O2 is the product?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CXCCJCXC\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C9OOH2-1O2\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-190",
        "domain": "ontocompchem",
        "question": "What is the HOMO energy of Lu calculated at the M06-2X level using the aug-cc-pVDZ basis set",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Lu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-609",
        "domain": "ontospecies",
        "question": "Can you find me the collision cross section and empirical formula for any piperidines class substances with an exact mass that doesn't fall between 208 and 255.33330900000004, but has a LogP value of exactly 1.3?",
        "query": {
            "sparql": "SELECT ?CollisionCrossSection ?EmpiricalFormula WHERE {\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue < 208 || ?ExactMassValue > 255.33330900000004 )\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue = 1.3 )\n  ?Species os:hasChemicalClass/rdfs:label \"piperidines\" .\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-177",
        "domain": "ontocompchem",
        "question": "I'm looking for the LUMO+2 energy and the rotational constants for La using the M06 theoretical model.",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"La\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-250",
        "domain": "ontospecies",
        "question": "Melting point and standard enthalpy of formation for chemical species with atom stereocenter count equal to or greater than -1.0",
        "query": {
            "sparql": "SELECT ?MeltingPoint ?StandardEnthalpyOfFormation WHERE {\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue >= -1.0 )\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-443",
        "domain": "ontokin",
        "question": "I need details of the kinetic model for the chemical reaction mechanism described in this link: https://doi.org/10.1002/kin.20026. Can you help?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-46",
        "domain": "ontospecies",
        "question": "What is the heavy atom count of the chemical species whose role is Pesticides and application is Insulators and bond chiral def count is outside the range (-1, 1) and role is Heat transferring agent and melting point is < 296 and heavy atom count is less than 11.0",
        "query": {
            "sparql": "SELECT ?HeavyAtomCount WHERE {\n  ?Species os:hasUse/rdfs:label \"Pesticides\" .\n  ?Species os:hasUse/rdfs:label \"Insulators\" .\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue < -1 || ?BondChiralDefCountValue > 1 )\n  ?Species os:hasUse/rdfs:label \"Heat transferring agent\" .\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue < 296 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue < 11.0 )\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-212",
        "domain": "ontospecies",
        "question": "Looking for chemical species with heavy atom count less than 24.200000000000003, atom chiral undef count between -1 and 1, and belong to the oxygen molecular entity class",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue < 24.200000000000003 )\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue > -1 && ?AtomChiralUndefCountValue < 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"oxygen molecular entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-939",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species with a defined atom stereocenter count close to 0.0 and belong to the s-block molecular entity class.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"s-block molecular entity\" .\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue > -0.1 && ?AtomChiralDefCountValue < 0.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-773",
        "domain": "ontospecies",
        "question": "I'm looking for the number of hydrogen bond acceptors in C1=CC=C(C=C1)C(=O)Cl, can you help?",
        "query": {
            "sparql": "SELECT ?HydrogenBondAcceptorCount WHERE {\n  VALUES ?Species { \"C1=CC=C(C=C1)C(=O)Cl\" }\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-459",
        "domain": "ontospecies",
        "question": "Which chemical species possess an XLOGP3 >= 1 and a number of hydrogen bond donors that's more than zero but less than 1.1?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value >= 1 )\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue > 0 && ?HydrogenBondDonorCountValue < 1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-223",
        "domain": "ontospecies",
        "question": "What temperatures cause InChI=1S/CHN/c1-2/h1H and InChI=1S/C19H38O2/c1-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19(20)21-2/h3-18H2,1-2H3 to go from solid to liquid?",
        "query": {
            "sparql": "SELECT ?MeltingPoint WHERE {\n  VALUES ?Species { \"InChI=1S/CHN/c1-2/h1H\" \"InChI=1S/C19H38O2/c1-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19(20)21-2/h3-18H2,1-2H3\" }\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-985",
        "domain": "ontospecies",
        "question": "Can you provide information about the dissociation constants, collision cross section, and complexity of a CC(C)NCC(C1=CC=C(C=C1)NS(=O)(=O)C)O molecule?",
        "query": {
            "sparql": "SELECT ?DissociationConstants ?CollisionCrossSection ?CompoundComplexity WHERE {\n  VALUES ?Species { \"CC(C)NCC(C1=CC=C(C=C1)NS(=O)(=O)C)O\" }\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n  ?Species os:hasCompoundComplexity ?CompoundComplexity .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-100",
        "domain": "ontocompchem",
        "question": "Using the CC-pVDZ basis set, how much is the total energy of COS?",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"COS\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-264",
        "domain": "ontospecies",
        "question": "Can you provide information on the number of tautomers found in CC1=CC=CC=C1O, InChI=1S/C3H7NO2/c1-2-6-3(4)5/h2H2,1H3,(H2,4,5), and propyl 3,4,5-trihydroxybenzoate?",
        "query": {
            "sparql": "SELECT ?TautomerCount WHERE {\n  VALUES ?Species { \"CC1=CC=CC=C1O\" \"InChI=1S/C3H7NO2/c1-2-6-3(4)5/h2H2,1H3,(H2,4,5)\" \"propyl 3,4,5-trihydroxybenzoate\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-650",
        "domain": "ontospecies",
        "question": "What's the heat of combustion value for InChI=1S/C17H19N5/c1-16(2,9-18)14-5-13(8-22-12-20-11-21-22)6-15(7-14)17(3,4)10-19/h5-7,11-12H,8H2,1-4H3?",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion WHERE {\n  VALUES ?Species { \"InChI=1S/C17H19N5/c1-16(2,9-18)14-5-13(8-22-12-20-11-21-22)6-15(7-14)17(3,4)10-19/h5-7,11-12H,8H2,1-4H3\" }\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-785",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is heteroorganic entity and defined atom stereocenter count is equal to 0.0 and compound complexity is >= 397 and chemical class is Nitrogen Compounds",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue = 0.0 )\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue >= 397 )\n  ?Species os:hasChemicalClass/rdfs:label \"Nitrogen Compounds\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-66",
        "domain": "ontospecies",
        "question": "How many atoms in 2-[2-[[2,6-bis(chloranyl)phenyl]amino]phenyl]ethanoic acid are chiral and undefined?",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount WHERE {\n  VALUES ?Species { \"2-[2-[[2,6-bis(chloranyl)phenyl]amino]phenyl]ethanoic acid\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-825",
        "domain": "ontospecies",
        "question": "Can you tell me which chemical species have a log P value near 2.63?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue > 2.63*0.9 && ?LogPValue < 2.63*1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-722",
        "domain": "ontospecies",
        "question": "Need info on LogS, heat of vaporization and ChEBI IDs for CCCCOC(=O)CC and 1-hexene.",
        "query": {
            "sparql": "SELECT ?LogS ?HeatOfVaporization ?ChebiID WHERE {\n  VALUES ?Species { \"CCCCOC(=O)CC\" \"1-hexene\" }\n  ?Species os:hasLogS ?LogS .\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n  ?Species os:hasChebiID ?ChebiID .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-926",
        "domain": "ontospecies",
        "question": "I'm looking for Intermediates in chemical species with a single covalent unit and at least one hydrogen bond donor.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"Intermediates\" .\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue = 1.0 )\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue > 0 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-101",
        "domain": "ontocompchem",
        "question": "What's the baseline energy of La when all basis sets are considered?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"La\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-68",
        "domain": "ontokin",
        "question": "Trying to find the mechanism involved in H2O + O <=> OH + OH reaction.",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H2O + O <=> OH + OH\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-487",
        "domain": "ontospecies",
        "question": "I need to find out the values of Chemical Entities of Biological Interest ID, Henry's law constant, and Caco-2 permeability for C1=CC=C(C(=C1)[N+](=O)[O-])Cl as well as 3-bromoprop-1-yne.",
        "query": {
            "sparql": "SELECT ?ChebiID ?HenrysLawConstant ?Caco2Permeability WHERE {\n  VALUES ?Species { \"C1=CC=C(C(=C1)[N+](=O)[O-])Cl\" \"3-bromoprop-1-yne\" }\n  ?Species os:hasChebiID ?ChebiID .\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-26",
        "domain": "ontokin",
        "question": "In www.osti.gov/servlets/purl/90098-26Ev73/webviewable/, how many chemical reactions are there that produce N-C3H7COC2H4-1?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"N-C3H7COC2H4-1\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-165",
        "domain": "ontocompchem",
        "question": "Can you tell me the total energy of Pt according to the B3LYP theory level?",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pt\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-83",
        "domain": "ontocompchem",
        "question": "What is the geometry of CO calculated using the STO-6G basis set across all level of theory",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CO\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-959",
        "domain": "ontospecies",
        "question": "Need info on chemical species with <= 1 charge, belonging to the class of both molecular entity and lipid, and classified as an organic molecular entity.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue <= 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"lipid\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-175",
        "domain": "ontocompchem",
        "question": "What is the energy of second lowest unoccupied molecular orbital of ClH calculated at the PM6 level of theory using the cc-pVQZ or cc-pVTZ basis set",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" \"cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-383",
        "domain": "ontospecies",
        "question": "I need information on the isoelectric point, compound complexity and heat of vaporization for 5,5-diphenylimidazolidine-2,4-dione, C6H12O and C1=CC2=C3C(=C1)C4=CC=CC5=C4C6=C(C=C5)C=CC(=C36)C=C2.",
        "query": {
            "sparql": "SELECT ?IsoelectricPoint ?CompoundComplexity ?HeatOfVaporization WHERE {\n  VALUES ?Species { \"5,5-diphenylimidazolidine-2,4-dione\" \"C6H12O\" \"C1=CC2=C3C(=C1)C4=CC=CC5=C4C6=C(C=C5)C=CC(=C36)C=C2\" }\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n  ?Species os:hasCompoundComplexity ?CompoundComplexity .\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-190",
        "domain": "ontospecies",
        "question": "What's the isoelectric point for C18H22N2?",
        "query": {
            "sparql": "SELECT ?IsoelectricPoint WHERE {\n  VALUES ?Species { \"C18H22N2\" }\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n}"
        }
    }
]