[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-635",
        "domain": "ontospecies",
        "question": "I need to find out the LogP for both carbonochloridic acid propan-2-yl ester and InChI=1S/C6Cl5NO2/c7-1-2(8)4(10)6(12(13)14)5(11)3(1)9.",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  VALUES ?Species { \"carbonochloridic acid propan-2-yl ester\" \"InChI=1S/C6Cl5NO2/c7-1-2(8)4(10)6(12(13)14)5(11)3(1)9\" }\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-275",
        "domain": "ontokin",
        "question": "Can you show me a chemical reaction where MDCY489OXO is a reactant?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDCY489OXO\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-663",
        "domain": "ontospecies",
        "question": "I'm looking for details on the precise mass of C1=C(C(=C(C(=C1Cl)Cl)[N+](=O)[O-])Cl)Cl and its solubility.",
        "query": {
            "sparql": "SELECT ?ExactMass ?Solubility WHERE {\n  VALUES ?Species { \"C1=C(C(=C(C(=C1Cl)Cl)[N+](=O)[O-])Cl)Cl\" }\n  ?Species os:hasExactMass ?ExactMass .\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-598",
        "domain": "ontospecies",
        "question": "I'm looking for information on chemical species with these specific properties: vapor pressure no less than one; density under one point one; a count of heavy atoms either fewer than eleven or more than fifteen; they're found Inside the Home; their autoignition temperature isn't in the interval from five hundred thirty-three point eight three five to six hundred fifty-three degrees.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue >= 1 )\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue < 1.1 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue < 11 || ?HeavyAtomCountValue > 15 )\n  ?Species os:hasUse/rdfs:label \"Inside the Home\" .\n  ?Species os:hasAutoignitionTemperature/os:value ?AutoignitionTemperatureValue .\n  FILTER ( ?AutoignitionTemperatureValue < 533.835 || ?AutoignitionTemperatureValue > 653 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-369",
        "domain": "ontokin",
        "question": "Can you show me the thermodynamic model that includes C6H12O1-5 in all its reaction mechanisms?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"C6H12O1-5\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-397",
        "domain": "ontocompchem",
        "question": "I'm looking for the zero point energy of F4S and the energy of the second lowest unoccupied molecular orbital calculated at the CCSD(T) level using either the aug-cc-pVDZ or STO-5G basis set.",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F4S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" \"STO-5G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-364",
        "domain": "ontocompchem",
        "question": "Can you tell me the HOMO-2 energy level of BP using a specific basis set for calculations?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BP\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-826",
        "domain": "ontospecies",
        "question": "What is the number of hydrogen bond acceptors and standard enthalpy of formation of C11H23NOS and thionyl chloride",
        "query": {
            "sparql": "SELECT ?HydrogenBondAcceptorCount ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"C11H23NOS\" \"thionyl chloride\" }\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-484",
        "domain": "ontocompchem",
        "question": "Can you find the SCF energy for ClI with the M06-2X theoretical level and STO-6G basis set?",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClI\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-70",
        "domain": "ontospecies",
        "question": "What are the chemical species whose density is less than 2168.32 and charge is approximately 0.0",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue < 2168.32 )\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -0.1 && ?ChargeValue < 0.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-403",
        "domain": "ontospecies",
        "question": "What are the uses and hashed InChI of CCCCCCCCC(=O)OC and C(C(C(CO)O)O)O?",
        "query": {
            "sparql": "SELECT ?UseLabel ?InChIKey WHERE {\n  VALUES ?Species { \"CCCCCCCCC(=O)OC\" \"C(C(C(CO)O)O)O\" }\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n  ?Species os:hasInChIKey ?InChIKey .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-468",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species with a charge less than or equal to 1.0 that function as a Hardener.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"Hardener\" .\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue <= 1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-867",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is elemental molecule and chemical class is elemental hydrogen and chemical classification is elemental molecular entity",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"elemental molecule\" .\n  ?Species os:hasChemicalClass/rdfs:label \"elemental hydrogen\" .\n  ?Species os:hasChemicalClass/rdfs:label \"elemental molecular entity\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-314",
        "domain": "ontocompchem",
        "question": "I'm looking for information on the STO-3G basis set's determination of rotational constants and Gibbs free energy for Pd.",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-151",
        "domain": "ontokin",
        "question": "Could you tell me the number of chemical reactions linked to the mechanism in https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-903",
        "domain": "ontospecies",
        "question": "Can you tell me the empirical formula, hydrophobic properties, and tautomer count of a chemical species classified as an organonitrogen heterocyclic compound?",
        "query": {
            "sparql": "SELECT ?EmpiricalFormula ?Hydrophobicity ?TautomerCount WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organonitrogen heterocyclic compound\" .\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n  ?Species os:hasHydrophobicity ?Hydrophobicity .\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-235",
        "domain": "ontocompchem",
        "question": "Can you tell me the ground state energy, SCF energy, and total enthalpy for Sb2?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?SCFEnergy ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Sb2\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-849",
        "domain": "ontospecies",
        "question": "Searching for chemical species in the class of polyatomic entity that possess a charge more than -1.0.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-81",
        "domain": "ontospecies",
        "question": "I need to find out the SMILES for both N-(2-methoxy-5-phenylanilino)carbamic acid propan-2-yl ester and InChI=1S/C11H22O/c1-2-3-4-5-6-7-8-9-10-11-12/h11H,2-10H2,1H3.",
        "query": {
            "sparql": "SELECT ?SMILES WHERE {\n  VALUES ?Species { \"N-(2-methoxy-5-phenylanilino)carbamic acid propan-2-yl ester\" \"InChI=1S/C11H22O/c1-2-3-4-5-6-7-8-9-10-11-12/h11H,2-10H2,1H3\" }\n  ?Species os:hasSMILES ?SMILES .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-670",
        "domain": "ontospecies",
        "question": "Looking for chemical compounds that have a surface tension in the range of 0 to 0.015400000000000002 and less than or equal to one hydrogen bond donor.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasSurfaceTension/os:value ?SurfaceTensionValue .\n  FILTER ( ?SurfaceTensionValue > 0 && ?SurfaceTensionValue < 0.015400000000000002 )\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue <= 1.0 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-135",
        "domain": "ontocompchem",
        "question": "What is the HOMO-2 energy of Pt calculated at the PM6 level of theory",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pt\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-342",
        "domain": "ontokin",
        "question": "What's the kinetic model for a chemical reaction that starts with C7CY14O7 and MD2OXOMJ then forms OA1CH3-M?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7CY14O7\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"OA1CH3-M\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD2OXOMJ\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-38",
        "domain": "ontocompchem",
        "question": "Using the PBE0 level of theory and the 3-21G basis set, what energy does the highest occupied molecular orbital of Pa possess?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pa\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-215",
        "domain": "ontokin",
        "question": "For the chemical reaction that has product M4PD12-D, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"M4PD12-D\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-9",
        "domain": "ontocompchem",
        "question": "What is the LUMO energy of Tb",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tb\" .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-347",
        "domain": "ontocompchem",
        "question": "Can you tell me the total enthalpy for Pr?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pr\" .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-313",
        "domain": "ontokin",
        "question": "In the study https://doi.org/10.1002/kin.20026, how many reactions form C9OOH6-OO5-2 from H15DE25DM-SO and C11H23OO-9-2",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C9OOH6-OO5-2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"H15DE25DM-SO\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C11H23OO-9-2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-14",
        "domain": "ontospecies",
        "question": "For CC(C)N(C(C)C)C(=O)SCC(=C(Cl)Cl)Cl and C7H14O and 4-(2-aminoethyl)pyrocatechol, what is their SMILES and density and solubility",
        "query": {
            "sparql": "SELECT ?SMILES ?Density ?Solubility WHERE {\n  VALUES ?Species { \"CC(C)N(C(C)C)C(=O)SCC(=C(Cl)Cl)Cl\" \"C7H14O\" \"4-(2-aminoethyl)pyrocatechol\" }\n  ?Species os:hasSMILES ?SMILES .\n  ?Species os:hasDensity ?Density .\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-304",
        "domain": "ontocompchem",
        "question": "I'm curious about the total energy and enthalpy of Re calculated with M06 using either the STO-3G or CC-pVDZ basis set - can you help me with this?",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Re\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-344",
        "domain": "ontokin",
        "question": "I need to know the specific chemical reaction that uses N-C3H7CHO in its mechanism in the study found at https://doi.org/10.1002/kin.20603.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"N-C3H7CHO\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-136",
        "domain": "ontokin",
        "question": "What's the kinetic model for a chemical reaction if PC4H9 is involved as a reactant?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"PC4H9\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-161",
        "domain": "ontokin",
        "question": "I'm looking for the chemical reaction where NC4KET24OH-1 is a reactant.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"NC4KET24OH-1\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-12",
        "domain": "ontocompchem",
        "question": "Need info on NHOMO energy values of ClH throughout all basis set.",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClH\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-223",
        "domain": "ontocompchem",
        "question": "Can you tell me the energy level of the next-to-highest occupied molecular orbital in Cr as determined by the UB3LYP theory level using the cc-pVDZ basis set?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-933",
        "domain": "ontospecies",
        "question": "What is the isotope atom count of C8H5Cl3O2 and glutaraldehyde",
        "query": {
            "sparql": "SELECT ?IsotopeAtomCount WHERE {\n  VALUES ?Species { \"C8H5Cl3O2\" \"glutaraldehyde\" }\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-622",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that are classified as both an organic hydride and an organic fundamental parent.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic hydride\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic fundamental parent\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-28",
        "domain": "ontokin",
        "question": "I need the kinetic model for the chemistry involving reactants C5H9-14 and RALD3OO and product MD3D2OOH as stipulated in this research: https://doi.org/10.1002/kin.20026. Can you help?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C5H9-14\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD3D2OOH\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"RALD3OO\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-847",
        "domain": "ontospecies",
        "question": "I'm looking for p-block molecular entity chemicals with a non-hydrogen atom count ranging from 6 to 7.700000000000001.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"p-block molecular entity\" .\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 6 && ?HeavyAtomCountValue < 7.700000000000001 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-361",
        "domain": "ontokin",
        "question": "I'm trying to find information on the kinetic reaction model for OH + H2O2 = H2O + HO2, as referenced in this paper https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"OH + H2O2 = H2O + HO2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-60",
        "domain": "ontocompchem",
        "question": "What is the total energy and rotational constants of O2 calculated using the cc-pVDZ basis set",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"O2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-478",
        "domain": "ontocompchem",
        "question": "Please find info on AsY's rotational constants when calculated using the M06-2X level and the 6-311G or STO-6G basis sets.",
        "query": {
            "sparql": "SELECT ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"AsY\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-77",
        "domain": "ontospecies",
        "question": "I'm looking for the number of 2-methylpyridine's undefined bond stereocenters.",
        "query": {
            "sparql": "SELECT ?BondChiralUndefCount WHERE {\n  VALUES ?Species { \"2-methylpyridine\" }\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-447",
        "domain": "ontocompchem",
        "question": "Can you show me the HOMO energy for oxygen (ClO), calculated based on a specific theoretical level?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClO\" .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-815",
        "domain": "ontospecies",
        "question": "What are the IUPAC names, standard enthalpy of formation, and bond chiral counts for CCI and InChI=1S/C10H15N/c1-3-8-6-5-7-9(4-2)10(8)11/h5-7H,3-4,11H2,1-2H3?",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation ?IUPACName ?BondChiralCount WHERE {\n  VALUES ?Species { \"CCI\" \"InChI=1S/C10H15N/c1-3-8-6-5-7-9(4-2)10(8)11/h5-7H,3-4,11H2,1-2H3\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n  ?Species os:hasIUPACName ?IUPACName .\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-241",
        "domain": "ontocompchem",
        "question": "What is the LUMO+1 energy and ground state energy of I2 calculated at the PM6 level of theory",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"I2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-496",
        "domain": "ontospecies",
        "question": "Need to find out the XLogP3 value for a chemical type which is utilized in both Pet Care and as a Pesticides, also its isotope atom count should be under 1.0.",
        "query": {
            "sparql": "SELECT ?XLogP3 WHERE {\n  ?Species os:hasUse/rdfs:label \"Pet Care\" .\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue < 1.0 )\n  ?Species os:hasUse/rdfs:label \"Pesticides\" .\n  ?Species os:hasXLogP3 ?XLogP3 .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-492",
        "domain": "ontospecies",
        "question": "Can you tell me about the applications and log P of InChI=1S/C2H3N3/c1-3-2-5-4-1/h1-2H,(H,3,4,5), InChI=1S/AsCl3/c2-1(3)4, and InChI=1S/C9H12/c1-2-6-9-7-4-3-5-8-9/h3-5,7-8H,2,6H2,1H3?",
        "query": {
            "sparql": "SELECT ?UseLabel ?LogP WHERE {\n  VALUES ?Species { \"InChI=1S/C2H3N3/c1-3-2-5-4-1/h1-2H,(H,3,4,5)\" \"InChI=1S/AsCl3/c2-1(3)4\" \"InChI=1S/C9H12/c1-2-6-9-7-4-3-5-8-9/h3-5,7-8H,2,6H2,1H3\" }\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-447",
        "domain": "ontospecies",
        "question": "I'm looking for organochalcogen compound chemicals with an undefined atom stereocenter count above -1.0, can you help?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organochalcogen compound\" .\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue > -1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-234",
        "domain": "ontospecies",
        "question": "What's the chemical category for C1C(O1)CO?",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel WHERE {\n  VALUES ?Species { \"C1C(O1)CO\" }\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-898",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that act as Corrosion inhibitors and anti-scaling agents?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"Corrosion inhibitors and anti-scaling agents\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-120",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has product S-C7H15 and has reactant C10KET1-4 and has product I-C4H7OH and has reactant MD9T",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"S-C7H15\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C10KET1-4\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"I-C4H7OH\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD9T\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-372",
        "domain": "ontocompchem",
        "question": "What's the energy amount of HOMO-1 in FH?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"FH\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-160",
        "domain": "ontospecies",
        "question": "Can you list the chemical species with a LogP value under 1 and classified as an organic oxo compound?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue < 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic oxo compound\" .\n}"
        }
    }
]