[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-668",
        "domain": "ontospecies",
        "question": "What is the collision cross section of the chemical species whose chemical classification is one-carbon compound and charge is not less than -1.0 and hydrogen bond donor count is equal to 0.0 and defined atom stereocenter count is < 1 and vapor pressure is greater than or equal to 5999 and chemical class is heteroorganic entity",
        "query": {
            "sparql": "SELECT ?CollisionCrossSection WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"one-carbon compound\" .\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue >= -1.0 )\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue = 0.0 )\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue < 1 )\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue >= 5999 )\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-9",
        "domain": "ontospecies",
        "question": "Looking for the number of atoms in C3H6 excluding hydrogen ones.",
        "query": {
            "sparql": "SELECT ?HeavyAtomCount WHERE {\n  VALUES ?Species { \"C3H6\" }\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-893",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that have zero isotope atoms, a polar surface area either below -1.0 or above 1.0, are found Inside the Home, and boil at roughly 248.92778.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue = 0.0 )\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue < -1.0 || ?PolarSurfaceAreaValue > 1.0 )\n  ?Species os:hasUse/rdfs:label \"Inside the Home\" .\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue > 248.92778*0.9 && ?BoilingPointValue < 248.92778*1.1 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-488",
        "domain": "ontocompchem",
        "question": "I'm looking for information on the energy of the highest occupied molecular orbital of F3N.",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F3N\" .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-52",
        "domain": "ontocompchem",
        "question": "Determine SCF energy of HI with B3LYP level of theory and cc-pVDZ basis set.",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HI\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-169",
        "domain": "ontokin",
        "question": "Could you please find the kinetic model of a chemical reaction involving NEOC7KETPQ as a reactant and MD9DXOOH6O2 as a product as outlined in this document https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"NEOC7KETPQ\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD9DXOOH6O2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-955",
        "domain": "ontospecies",
        "question": "I need information on CCCCCCCCCC(=O)OC's rotatable bond count, its polar surface area and how many covalent units it has.",
        "query": {
            "sparql": "SELECT ?RotatableBondCount ?PolarSurfaceArea ?CovalentUnitCount WHERE {\n  VALUES ?Species { \"CCCCCCCCCC(=O)OC\" }\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n  ?Species os:hasCovalentUnitCount ?CovalentUnitCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-321",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has product MD9OXO",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD9OXO\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-443",
        "domain": "ontocompchem",
        "question": "What is the HOMO energy and total Gibbs free energy of Cr calculated using the cc-pVDZ basis set",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-108",
        "domain": "ontocompchem",
        "question": "Using the B3LYP theory level, can you find out the energy and geometry for Cu over the entire basis set?",
        "query": {
            "sparql": "SELECT ?SCFEnergy ?OptimizedGeometry ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-465",
        "domain": "ontocompchem",
        "question": "What is the HOMO-2 energy of Ar, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ar\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-307",
        "domain": "ontospecies",
        "question": "Can you show me a list of chemical species that are classified as both organochalcogen compound and Pesticides?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organochalcogen compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"Pesticides\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-234",
        "domain": "ontocompchem",
        "question": "Energy calculation for Er with 6-311G basis set - I need to know.",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Er\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-309",
        "domain": "ontocompchem",
        "question": "Can you find the molecular structure of Ne determined using M06 theory and the CC-pVQZ basis set?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ne\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-414",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has reactant CPDOOH",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CPDOOH\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-871",
        "domain": "ontospecies",
        "question": "Can you find the chemical species that have a bond chiral def count less than 1.0, belong to the hydrogen molecular entity class and have no rotatable bonds?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue < 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"hydrogen molecular entity\" .\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue = 0.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-831",
        "domain": "ontospecies",
        "question": "Optical rotation and number of undefined stereocenters in C4H8O",
        "query": {
            "sparql": "SELECT ?OpticalRotation ?BondChiralUndefCount WHERE {\n  VALUES ?Species { \"C4H8O\" }\n  ?Species os:hasOpticalRotation ?OpticalRotation .\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-475",
        "domain": "ontokin",
        "question": "Can you show me the chemical reactions where MN4O acts as a starting material?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MN4O\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-13",
        "domain": "ontokin",
        "question": "In all reactions mechanisms where MO6OOH4J appears, what is its thermodynamic model?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"MO6OOH4J\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-96",
        "domain": "ontokin",
        "question": "Can you show me the thermodynamic model involving C7H11-163 in all the reactions it's part of?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"C7H11-163\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-684",
        "domain": "ontospecies",
        "question": "Find me chemical species classified as both a carbon group molecular entity and an organic molecular entity, identified as a type of molecule, with chiral atoms ranging from -1.0 to 1 and possessing logP values below 1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carbon group molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue > -1.0 && ?AtomChiralCountValue < 1 )\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue < 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-739",
        "domain": "ontospecies",
        "question": "What is the hydrogen bond donor count and isotope atom count and solubility of InChI=1S/C8H18O5/c9-1-3-11-5-7-13-8-6-12-4-2-10/h9-10H,1-8H2",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount ?IsotopeAtomCount ?Solubility WHERE {\n  VALUES ?Species { \"InChI=1S/C8H18O5/c9-1-3-11-5-7-13-8-6-12-4-2-10/h9-10H,1-8H2\" }\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-997",
        "domain": "ontospecies",
        "question": "Can you list the chemical species with a bond chiral undef count of 1.0 or less, fewer than 1.1 covalent units, XLogP3 value above 2.9699999999999998, hydrogen bond acceptor count not below -1 and a defined bond stereocenter count under 1?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue <= 1.0 )\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue < 1.1 )\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value > 2.9699999999999998 )\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue >= -1 )\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue < 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-238",
        "domain": "ontospecies",
        "question": "I'm looking for the LogS for InChI=1S/C8H13N3O4S/c1-3-16(14,15)5-4-10-7(2)9-6-8(10)11(12)13/h6H,3-5H2,1-2H3, what is it?",
        "query": {
            "sparql": "SELECT ?LogS WHERE {\n  VALUES ?Species { \"InChI=1S/C8H13N3O4S/c1-3-16(14,15)5-4-10-7(2)9-6-8(10)11(12)13/h6H,3-5H2,1-2H3\" }\n  ?Species os:hasLogS ?LogS .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-912",
        "domain": "ontospecies",
        "question": "I need information on the various properties of C8H16O2.",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"C8H16O2\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-370",
        "domain": "ontokin",
        "question": "How many chemical reaction that has reactant MDCY783O and is involved in the mechanism found in https://doi.org/10.1002/kin.20026 and has product MD4D10J and has reactant C7OOH1-OO1-2",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDCY783O\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD4D10J\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7OOH1-OO1-2\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-95",
        "domain": "ontokin",
        "question": "Can you find how many chemical reactions in the mechanism on www.osti.gov/servlets/purl/90098-26Ev73/webviewable/ use MHMO2 as a reactant?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MHMO2\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-293",
        "domain": "ontocompchem",
        "question": "Can you provide the values for total and ground state energy of F3N based on various levels of theory?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?TotalEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F3N\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-525",
        "domain": "ontospecies",
        "question": "What is the defined atom stereocenter count of C9H17N5S",
        "query": {
            "sparql": "SELECT ?AtomChiralDefCount WHERE {\n  VALUES ?Species { \"C9H17N5S\" }\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-410",
        "domain": "ontospecies",
        "question": "Show me all the chemical species that fall under the carboxamide classification and have a charge not less than -1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carboxamide\" .\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue >= -1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-563",
        "domain": "ontospecies",
        "question": "Can you find the isoelectric point of a chemical compound with less than 1 undefined bond stereocenter, a solubility greater than 0.18, a monoisotopic weight of exactly 200.02402 and an XLogP3 value either below 2 or above 2.53?",
        "query": {
            "sparql": "SELECT ?IsoelectricPoint WHERE {\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue < 1.0 )\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue > 0.18000000000000002 )\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue = 200.02402 )\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value < 2 || ?XLogP3Value > 2.53 )\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-371",
        "domain": "ontocompchem",
        "question": "Can you provide me with the data for the LUMO+2 energy and the energy of the HO's second lowest unoccupied molecular orbital, which were evaluated using the UB3LYP level and the CC-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Es\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-31",
        "domain": "ontospecies",
        "question": "What is the LogP of CC(=CCCC(=CCO)C)C and InChI=1S/C16H22O4/c1-11(2)9-19-15(17)13-7-5-6-8-14(13)16(18)20-10-12(3)4/h5-8,11-12H,9-10H2,1-4H3 and 2,3,4,6-tetrachlorophenol",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  VALUES ?Species { \"CC(=CCCC(=CCO)C)C\" \"InChI=1S/C16H22O4/c1-11(2)9-19-15(17)13-7-5-6-8-14(13)16(18)20-10-12(3)4/h5-8,11-12H,9-10H2,1-4H3\" \"2,3,4,6-tetrachlorophenol\" }\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-534",
        "domain": "ontospecies",
        "question": "Search for lipid chemicals with over -1 defined atom stereocenters and about 20.2 in polar surface area.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"lipid\" .\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue > -1 )\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue > 20.2*0.9 && ?PolarSurfaceAreaValue < 20.2*1.1 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-439",
        "domain": "ontokin",
        "question": "What does the thermodynamic model look like for CH2CH2CHOHCH3 in all its reaction mechanisms?",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"CH2CH2CHOHCH3\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-848",
        "domain": "ontospecies",
        "question": "What are the values of the dissociation constants in (R)-[2,8-bis(trifluoromethyl)-4-quinolinyl]-[(2S)-2-piperidinyl]methanol?",
        "query": {
            "sparql": "SELECT ?DissociationConstants WHERE {\n  VALUES ?Species { \"(R)-[2,8-bis(trifluoromethyl)-4-quinolinyl]-[(2S)-2-piperidinyl]methanol\" }\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-414",
        "domain": "ontocompchem",
        "question": "I need to know the total energetic value and Gibbs free energy for Am according to every level of theory.",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?TotalGibbsFreeEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Am\" .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-153",
        "domain": "ontokin",
        "question": "Description of the MDDIPX47J10 transport model in all possible reaction mechanisms, please.",
        "query": {
            "sparql": "SELECT ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"MDDIPX47J10\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-26",
        "domain": "ontospecies",
        "question": "Need details on C(CCl)P(=O)(O)O: its sublimation enthalpy, what class of chemicals it belongs to, and its collision cross section.",
        "query": {
            "sparql": "SELECT ?EnthalpyOfSublimation ?ChemicalClassLabel ?CollisionCrossSection WHERE {\n  VALUES ?Species { \"C(CCl)P(=O)(O)O\" }\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-809",
        "domain": "ontospecies",
        "question": "Can you find the Caco-2 permeability and isoelectric point for chromatographic reagents that don't fall within the logP range of 1.647 to 2.013000000000003 but have a flashpoint equal to 385.92776?",
        "query": {
            "sparql": "SELECT ?Caco2Permeability ?IsoelectricPoint WHERE {\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue < 1.647 || ?LogPValue > 2.0130000000000003 )\n  ?Species os:hasUse/rdfs:label \"chromatographic reagent\" .\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue = 385.92776 )\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-145",
        "domain": "ontospecies",
        "question": "For C14H19NO, what is its heat of combustion",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion WHERE {\n  VALUES ?Species { \"C14H19NO\" }\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-231",
        "domain": "ontokin",
        "question": "What is the kinetic model for the chemical reaction H2O2 + H <=> H2 + HO2 as mentioned in this article: https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2O2 + H <=> H2 + HO2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-74",
        "domain": "ontocompchem",
        "question": "I need to find out the energy for COS's highest occupied molecular orbital using cc-pVDZ basis set.",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"COS\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-189",
        "domain": "ontokin",
        "question": "In this study https://doi.org/10.1002/kin.20026, how many instances are there of chemical reactions where S3XC7H15 is a reactant?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"S3XC7H15\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-507",
        "domain": "ontospecies",
        "question": "Boiling point and number of tautomers in C1=CC=C2C(=C1)C=CC=C2CC(=O)O?",
        "query": {
            "sparql": "SELECT ?BoilingPoint ?TautomerCount WHERE {\n  VALUES ?Species { \"C1=CC=C2C(=C1)C=CC=C2CC(=O)O\" }\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-1002",
        "domain": "ontospecies",
        "question": "Need to find out about the chemical species that fall under the amino acid category and have their isotope atom count equal to or above -1.0.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"amino acid\" .\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue >= -1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-884",
        "domain": "ontospecies",
        "question": "I need to find out the standard enthalpy of formation for these substances: C4H4S, CC(=NOC(=O)NC)SC, and CCC1(CCC(=O)NC1=O)C2=CC=CC=C2.",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"C4H4S\" \"CC(=NOC(=O)NC)SC\" \"CCC1(CCC(=O)NC1=O)C2=CC=CC=C2\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-296",
        "domain": "ontocompchem",
        "question": "What is the energy of lowest unoccupied molecular orbital and LUMO+1 energy of No calculated at the CCSD(T) level using the aug-cc-pVDZ or 3-21G basis set",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"No\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-270",
        "domain": "ontospecies",
        "question": "What is the boiling point and autoignition temperature of the chemical species whose chemical classification is organic oxo compound and compound complexity is outside the range (95.4, 116.60000000000001) and boiling point is > 379.684998 and chemical class is carboxylic ester and chemical classification is chalcogen molecular entity",
        "query": {
            "sparql": "SELECT ?BoilingPoint ?AutoignitionTemperature WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic oxo compound\" .\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue < 95.4 || ?CompoundComplexityValue > 116.60000000000001 )\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue > 379.684998 )\n  ?Species os:hasChemicalClass/rdfs:label \"carboxylic ester\" .\n  ?Species os:hasChemicalClass/rdfs:label \"chalcogen molecular entity\" .\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n  ?Species os:hasAutoignitionTemperature ?AutoignitionTemperature .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-199",
        "domain": "ontocompchem",
        "question": "Can you tell me the total energy of Mn if we calculate it with the 6-311G basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mn\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    }
]