[
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-284",
        "domain": "ontocompchem",
        "question": "I'm looking for data on the NHOMO energy, molecular structure, and HOMO-2 energy for Cm, computed at the M06 level for all basis set.",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?OptimizedGeometry ?HOMOMinus2Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-186",
        "domain": "ontokin",
        "question": "Need information on kinetic reaction model for O2 + H (+ O2) <=> HO2 (+ O2).",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"O2 + H (+ O2) <=> HO2 (+ O2)\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-73",
        "domain": "ontokin",
        "question": "I'm searching for the method of transportation for MD5D9T in all reaction mechanisms it's present in.",
        "query": {
            "sparql": "SELECT ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"MD5D9T\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-741",
        "domain": "ontospecies",
        "question": "Can you tell me the molecular weight of diethoxyphosphoryl diethyl phosphate?",
        "query": {
            "sparql": "SELECT ?MolecularWeight WHERE {\n  VALUES ?Species { \"diethoxyphosphoryl diethyl phosphate\" }\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-693",
        "domain": "ontospecies",
        "question": "What's the basic atomic composition of InChI=1S/C5H8O2/c1-4-2-3-5(6)7-4/h4H,2-3H2,1H3?",
        "query": {
            "sparql": "SELECT ?EmpiricalFormula WHERE {\n  VALUES ?Species { \"InChI=1S/C5H8O2/c1-4-2-3-5(6)7-4/h4H,2-3H2,1H3\" }\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-783",
        "domain": "ontospecies",
        "question": "I'm looking for the names of chemicals that play the role of an Embalming agent.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"Embalming agent\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-402",
        "domain": "ontocompchem",
        "question": "Show me data on the electronic energy and total Gibbs free energy for Th under the M06-2X theoretical level, mentioning the basis set involved in the calculations.",
        "query": {
            "sparql": "SELECT ?SCFEnergy ?TotalGibbsFreeEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Th\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-452",
        "domain": "ontospecies",
        "question": "Looking for chemical species with a rotatable bond count greater than -1 but less than 1, and are used as both pH regulating agent and antimicrobial food preservative.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue > -1 && ?RotatableBondCountValue < 1 )\n  ?Species os:hasUse/rdfs:label \"pH regulating agent\" .\n  ?Species os:hasUse/rdfs:label \"antimicrobial food preservative\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-931",
        "domain": "ontospecies",
        "question": "What kind of chemical is classified as p-block molecular entity and also has its bond chiral undef count below 1?",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel WHERE {\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue < 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"p-block molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-457",
        "domain": "ontokin",
        "question": "What are the chemical species involved in the reaction mechanism of the study discussed in this link https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-818",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is benzoate ester and chemical class is main group molecular entity and chemical class is organic aromatic compound and chemical class is organic aromatic compound and boiling point is approximately 495.15",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"benzoate ester\" .\n  ?Species os:hasChemicalClass/rdfs:label \"main group molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic aromatic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic aromatic compound\" .\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue > 495.15*0.9 && ?BoilingPointValue < 495.15*1.1 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-297",
        "domain": "ontocompchem",
        "question": "What's the SLUMO energy value of Eu when calculated using G3 level and specifying the basis set?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Eu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-160",
        "domain": "ontocompchem",
        "question": "Can you show me the energy level of Gd's second lowest unoccupied molecular orbital and the basis set for it?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Gd\" .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-43",
        "domain": "ontocompchem",
        "question": "What is the frequencies and energy of lowest unoccupied molecular orbital of Pr calculated at the CCSD(T) level of theory using the aug-cc-pVTZ basis set",
        "query": {
            "sparql": "SELECT ?Frequencies ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-638",
        "domain": "ontospecies",
        "question": "Can you find chemical species where the bond stereocenter count is more than -1 but under 1, the charge is exactly zero, and the XLOGP3 isn't over 0.44?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -1 && ?BondChiralDefCountValue < 1.0 )\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue = 0.0 )\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value <= 0.44000000000000006 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-446",
        "domain": "ontocompchem",
        "question": "Searching for the energy of the HOMO-2 of Pu.",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pu\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-699",
        "domain": "ontospecies",
        "question": "For 3,5-bis(chloranyl)phenol and CCOC(=O)C, what is their ChEBI ID",
        "query": {
            "sparql": "SELECT ?ChebiID WHERE {\n  VALUES ?Species { \"3,5-bis(chloranyl)phenol\" \"CCOC(=O)C\" }\n  ?Species os:hasChebiID ?ChebiID .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-2",
        "domain": "ontospecies",
        "question": "What is the atom chiral def count of the chemical species whose vapor density is = 1.0 and LogP is > 0 and hydrogen bond donor count is >= -1.0",
        "query": {
            "sparql": "SELECT ?AtomChiralDefCount WHERE {\n  ?Species os:hasVaporDensity/os:value ?VaporDensityValue .\n  FILTER ( ?VaporDensityValue = 1.0 )\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue > 0 )\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue >= -1.0 )\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-358",
        "domain": "ontospecies",
        "question": "Search for chemical species in the terpenoid class that have a molecular weight of at least 281.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue >= 281 )\n  ?Species os:hasChemicalClass/rdfs:label \"terpenoid\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-406",
        "domain": "ontocompchem",
        "question": "What is the ground state energy and energy of next-to-highest occupied molecular orbital of Hg calculated using the 4-31G or CC-pVDZ basis set, specifying the level of theory at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?HOMOMinus1Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Hg\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"4-31G\" \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-890",
        "domain": "ontospecies",
        "question": "Which chemical species are categorized under the organic thiophosphate class?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic thiophosphate\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-677",
        "domain": "ontospecies",
        "question": "Number of hydrogen bond donors in InChI=1S/C11H14O2/c1-4-5-9-6-7-10(12-2)11(8-9)13-3/h4,6-8H,1,5H2,2-3H3 and InChI=1S/C4H7NO/c6-4-2-1-3-5-4/h1-3H2,(H,5,6)?",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount WHERE {\n  VALUES ?Species { \"InChI=1S/C11H14O2/c1-4-5-9-6-7-10(12-2)11(8-9)13-3/h4,6-8H,1,5H2,2-3H3\" \"InChI=1S/C4H7NO/c6-4-2-1-3-5-4/h1-3H2,(H,5,6)\" }\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-475",
        "domain": "ontocompchem",
        "question": "What is the total Gibbs free energy of CIN calculated at the CCSD(T) level of theory",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CIN\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-15",
        "domain": "ontospecies",
        "question": "For 2-(2-hydroxyethylsulfanyl)ethanol, what is its molecular formula",
        "query": {
            "sparql": "SELECT ?MolecularFormula WHERE {\n  VALUES ?Species { \"2-(2-hydroxyethylsulfanyl)ethanol\" }\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-480",
        "domain": "ontocompchem",
        "question": "Determine the energy at the HOMO-1 level for Pt, created on the STO-3G basis set across all levels of theory.",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pt\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-352",
        "domain": "ontokin",
        "question": "Kinetic model for chemical reaction with PAOJ3*O going to C9OOH7-2C, what is it?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"PAOJ3*O\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C9OOH7-2C\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-158",
        "domain": "ontokin",
        "question": "Can you help me find the kinetic model for a chemical reaction involving MD9DMOOH2O2 as the reactant and resulting in products C12OOH3-2G and CY453J, as outlined in this study https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD9DMOOH2O2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C12OOH3-2G\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"CY453J\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-303",
        "domain": "ontocompchem",
        "question": "What is the energy of highest occupied molecular orbital of Pu calculated at the M06 level across all basis set",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-221",
        "domain": "ontocompchem",
        "question": "What is the HOMO energy of COS calculated at the UB3LYP level of theory using the aug-cc-pVTZ basis set",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"COS\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-929",
        "domain": "ontospecies",
        "question": "What's the empirical formula, vapor pressure, and bond chiral count for CCOC=O?",
        "query": {
            "sparql": "SELECT ?EmpiricalFormula ?VaporPressure ?BondChiralCount WHERE {\n  VALUES ?Species { \"CCOC=O\" }\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n  ?Species os:hasVaporPressure ?VaporPressure .\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-3",
        "domain": "ontokin",
        "question": "Can I find the kinetic model of a reaction using C7H13O2-6 and IC4H8O2H-I to create A2YXC10H7 in the mechanism provided by this link www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7H13O2-6\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"A2YXC10H7\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"IC4H8O2H-I\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-381",
        "domain": "ontokin",
        "question": "What chemical species is mentioned in the reaction mechanism of the research paper at https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-227",
        "domain": "ontospecies",
        "question": "What is the polar surface area of InChI=1S/C6H6O2/c7-5-2-1-3-6(8)4-5/h1-4,7-8H and C1=CC(=CC=C1N=C=O)Cl and InChI=1S/C3H4O/c1-2-3-4/h2-3H,1H2",
        "query": {
            "sparql": "SELECT ?PolarSurfaceArea WHERE {\n  VALUES ?Species { \"InChI=1S/C6H6O2/c7-5-2-1-3-6(8)4-5/h1-4,7-8H\" \"C1=CC(=CC=C1N=C=O)Cl\" \"InChI=1S/C3H4O/c1-2-3-4/h2-3H,1H2\" }\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-498",
        "domain": "ontocompchem",
        "question": "Can I find out the frequencies of H2O within all levels of theory?",
        "query": {
            "sparql": "SELECT ?Frequencies ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"I2\" .\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-417",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction O + O + M = O2 + M",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"O + O + M = O2 + M\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-260",
        "domain": "ontocompchem",
        "question": "What is the HOMO energy of Cu calculated using the cc-pVQZ basis set",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-646",
        "domain": "ontospecies",
        "question": "I need to find the molecular weight for a substance classified as both chlorine molecular entity and main group molecular entity, with its log S exceeding -4.840000000000001.",
        "query": {
            "sparql": "SELECT ?MolecularWeight WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"chlorine molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"main group molecular entity\" .\n  ?Species os:hasLogS/os:value ?LogSValue .\n  FILTER ( ?LogSValue > -4.840000000000001 )\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-490",
        "domain": "ontocompchem",
        "question": "I need to find the LUMO+2 energy of O2 as determined by the CCSD(T) level of theory with the CC-pVTZ or STO-4G basis set.",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"O2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-264",
        "domain": "ontokin",
        "question": "Can anyone help me find the kinetic model for chemical reaction - reactant is MD7OOH9O2 and product is MDCY89-10.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDCY89-10\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD7OOH9O2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-491",
        "domain": "ontospecies",
        "question": "What's the official IUPAC designation for C6H14O3?",
        "query": {
            "sparql": "SELECT ?IUPACName WHERE {\n  VALUES ?Species { \"C6H14O3\" }\n  ?Species os:hasIUPACName ?IUPACName .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-752",
        "domain": "ontospecies",
        "question": "Searching for the SMILES string of a compound called 2-furanylmethanol.",
        "query": {
            "sparql": "SELECT ?SMILES WHERE {\n  VALUES ?Species { \"2-furanylmethanol\" }\n  ?Species os:hasSMILES ?SMILES .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-61",
        "domain": "ontokin",
        "question": "For the chemical reaction that is involved in the mechanism found in https://doi.org/10.1002/kin.20026 and has reactant MD69D8J, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD69D8J\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-74",
        "domain": "ontokin",
        "question": "What is the chemical reaction that is involved in the mechanism found in https://doi.org/10.1002/kin.20026 and has reactant C12OOH6-9O2 and has product A2C2HBY and has reactant C7CY263",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C12OOH6-9O2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"A2C2HBY\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7CY263\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-12",
        "domain": "ontospecies",
        "question": "What's the chemical class of a compound that is an arene, has a solubility between 0.0043389 and 1, and approximately 0.0 defined bond stereocenters?",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"arene\" .\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue > 0.0043389 && ?SolubilityValue < 1 )\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -0.1 && ?BondChiralDefCountValue < 0.1 )\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-947",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species where the LogP is either below 1 or exceeds 2.3540000000000005.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue < 1 || ?LogPValue > 2.3540000000000005 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-418",
        "domain": "ontocompchem",
        "question": "What's the calculation of total, ground state, and SCF energy for Sb2 using the cc-pVQZ basis set at a specific theory level?",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?ZeroPointEnergy ?SCFEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Sb2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-678",
        "domain": "ontospecies",
        "question": "Chemical species with vapor pressure under 1.4665461800000001, rotatable bond count below 6.6000000000000005, atom chiral undef count not more than 1.0 and exact mass not within 182.703168 to 223.303872?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue < 1.4665461800000001 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue < 6.6000000000000005 )\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue <= 1.0 )\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue < 182.703168 || ?ExactMassValue > 223.30387200000004 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-86",
        "domain": "ontocompchem",
        "question": "Looking for the energy of the lowest unoccupied molecular orbital and ground state energy of AsY using all theoretical levels.",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LUMOEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"AsY\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-857",
        "domain": "ontospecies",
        "question": "Can I find the molecular formula, dissociation constants, and polar surface area for a carbon group molecular entity that is also classified as a polycyclic compound with around 0.0 polar surface area?",
        "query": {
            "sparql": "SELECT ?MolecularFormula ?DissociationConstants ?PolarSurfaceArea WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carbon group molecular entity\" .\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue > -0.1 && ?PolarSurfaceAreaValue < 0.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"polycyclic compound\" .\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-500",
        "domain": "ontokin",
        "question": "Can you tell me about the kinetic model involving the reactant CH3CY24PD in a chemical reaction?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CH3CY24PD\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    }
]