[
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-326",
        "domain": "ontocompchem",
        "question": "Need information on Ag's zero point and HOMO energy.",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ag\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-160",
        "domain": "ontokin",
        "question": "In the given link https://doi.org/10.1016/j.combustflame.2007.10.024, does it include an explanation about the kinetic model for the chemical reaction OH + OH (+ H2O) <=> H2O2 (+ H2O)?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"OH + OH (+ H2O) <=> H2O2 (+ H2O)\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-762",
        "domain": "ontospecies",
        "question": "What chemicals have about six heavy atoms and a boiling point in the range of 294 to 360?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 6.0*0.9 && ?HeavyAtomCountValue < 6.0*1.1 )\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue > 294 && ?BoilingPointValue < 360 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-392",
        "domain": "ontospecies",
        "question": "Can you help me find pnictogen molecular entities with a density between 1 and 2, hydrogen bond donors in the range of 0.9 to 1.1, an XLogP3 of -0.3, and an ionization potential less than or equal to 1?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue >= 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"pnictogen molecular entity\" .\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue > 0.9 && ?HydrogenBondDonorCountValue < 1.1 )\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value = -0.3 )\n  ?Species os:hasIonizationPotential/os:value ?IonizationPotentialValue .\n  FILTER ( ?IonizationPotentialValue <= 1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-969",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that are classified as molecule and have a charge greater than -1.0?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-82",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has product C12O1-2",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C12O1-2\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-423",
        "domain": "ontokin",
        "question": "I'm searching for the chemical reaction mechanism for OH + H2 <=> H + H2O, H + H2O2 = OH + H2O and H + O2 (+ AR) = HO2 (+ AR).",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"OH + H2 <=> H + H2O\" .\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H + H2O2 = OH + H2O\" .\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H + O2 (+ AR) = HO2 (+ AR)\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-366",
        "domain": "ontocompchem",
        "question": "Can you find the Gibbs free energy and rotational constants for Rn when calculated at the G3 level with the CC-pVDZ basis set?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Rn\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-111",
        "domain": "ontocompchem",
        "question": "Can you show me the energy level of LUMO+2 in Ne for all theoretical levels?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ne\" .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-823",
        "domain": "ontospecies",
        "question": "I'm looking for the number of acceptors for hydrogen bonds in 2,4-dinitro-6-sec-butyl-phenol, can you help?",
        "query": {
            "sparql": "SELECT ?HydrogenBondAcceptorCount WHERE {\n  VALUES ?Species { \"2,4-dinitro-6-sec-butyl-phenol\" }\n  ?Species os:hasHydrogenBondAcceptorCount ?HydrogenBondAcceptorCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-496",
        "domain": "ontocompchem",
        "question": "Can you provide HOMO-2, HOMO, and LUMO+1 energy determination of La using UB3LYP level and 4-31G basis set?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?HOMOEnergy ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"La\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"4-31G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-463",
        "domain": "ontokin",
        "question": "Can you give me the kinetic model for a chemical reaction that produces RIBALDGOO?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"RIBALDGOO\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-134",
        "domain": "ontospecies",
        "question": "What chemical species are classified as a combination of benzenoid aromatic compound, polyatomic entity and also an aromatic carboxylic acid?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"benzenoid aromatic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"aromatic carboxylic acid\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-384",
        "domain": "ontocompchem",
        "question": "Can I find out the HOMO-2, SLUMO and total Gibbs free energy values for Br- calculated using the PBE0 level? Also, which basis set was involved in the calculations?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?LUMOPlus1Energy ?TotalGibbsFreeEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Br-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-730",
        "domain": "ontospecies",
        "question": "What is the optical rotation of CCCN(CCC)C1=C(C=C(C=C1[N+](=O)[O-])C(F)(F)F)[N+](=O)[O-]",
        "query": {
            "sparql": "SELECT ?OpticalRotation WHERE {\n  VALUES ?Species { \"CCCN(CCC)C1=C(C=C(C=C1[N+](=O)[O-])C(F)(F)F)[N+](=O)[O-]\" }\n  ?Species os:hasOpticalRotation ?OpticalRotation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-782",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is monocarboxylic acid amide",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"monocarboxylic acid amide\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-583",
        "domain": "ontospecies",
        "question": "Can you find chemical species that have a rotatable bond count between 4 and 6 and are used as Cleaning agent?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue > 4 && ?RotatableBondCountValue < 6 )\n  ?Species os:hasUse/rdfs:label \"Cleaning agent\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-437",
        "domain": "ontokin",
        "question": "Looking for the kinetics of a reaction where C9H18O2-4-2 reacts to form TC4H9CHO and the mechanics can be found on www.osti.gov/servlets/purl/90098-26Ev73/webviewable/",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C9H18O2-4-2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"TC4H9CHO\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-118",
        "domain": "ontocompchem",
        "question": "I'm looking for the Br- HOMO-2 energy calculated based on M06 theory level through 6-311G set. Can you help?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Br-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-923",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that fall under the benzenoid aromatic compound category?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"benzenoid aromatic compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-940",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that have a charge higher than -1 and fall within the XLogP3 range of 0 to 1.2100000000000002.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -1 )\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value > 0 && ?XLogP3Value < 1.2100000000000002 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-843",
        "domain": "ontospecies",
        "question": "What is the vapor density of C19H20N2O2",
        "query": {
            "sparql": "SELECT ?VaporDensity WHERE {\n  VALUES ?Species { \"C19H20N2O2\" }\n  ?Species os:hasVaporDensity ?VaporDensity .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-453",
        "domain": "ontospecies",
        "question": "Need to know LogP for both InChI=1S/C8H10O/c9-7-6-8-4-2-1-3-5-8/h1-5,9H,6-7H2 and hexacyclo[10.10.2.0<SUP>2,7</SUP>.0<SUP>8,24</SUP>.0<SUP>15,23</SUP>.0<SUP>17,22</SUP>]tetracosa-1(23),2,4,6,8,10,12(24),13,15,17,19,21-dodecaene.",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  VALUES ?Species { \"InChI=1S/C8H10O/c9-7-6-8-4-2-1-3-5-8/h1-5,9H,6-7H2\" \"hexacyclo[10.10.2.0<SUP>2,7</SUP>.0<SUP>8,24</SUP>.0<SUP>15,23</SUP>.0<SUP>17,22</SUP>]tetracosa-1(23),2,4,6,8,10,12(24),13,15,17,19,21-dodecaene\" }\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-333",
        "domain": "ontokin",
        "question": "I'm looking for the kinetic model associated with the chemical reaction that uses CH2CHCCH as a reactant, as outlined in the link https://doi.org/10.1016/j.combustflame.2007.10.024. Can you help?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"CH2CHCCH\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-152",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has reactant S3XC7H15",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"S3XC7H15\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-113",
        "domain": "ontospecies",
        "question": "I'm looking for the count of undef chiral bonds in InChI=1S/C20H26N2O/c1-3-13-8-12-9-17-19-15(6-7-22(11-12)20(13)17)16-10-14(23-2)4-5-18(16)21-19/h4-5,10,12-13,17,20-21H,3,6-9,11H2,1-2H3/t12-,13+,17+,20+/m1/s1, can you help?",
        "query": {
            "sparql": "SELECT ?BondChiralUndefCount WHERE {\n  VALUES ?Species { \"InChI=1S/C20H26N2O/c1-3-13-8-12-9-17-19-15(6-7-22(11-12)20(13)17)16-10-14(23-2)4-5-18(16)21-19/h4-5,10,12-13,17,20-21H,3,6-9,11H2,1-2H3/t12-,13+,17+,20+/m1/s1\" }\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-491",
        "domain": "ontokin",
        "question": "What's the explanation of the kinetic model for the chemical reaction present in the mechanism of the research located at https://doi.org/10.1002/kin.20026?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-950",
        "domain": "ontospecies",
        "question": "Can you tell me the XLOGP3, surface tension, and undefined bond stereocenter count for C6Cl6?",
        "query": {
            "sparql": "SELECT ?XLogP3 ?SurfaceTension ?BondChiralUndefCount WHERE {\n  VALUES ?Species { \"C6Cl6\" }\n  ?Species os:hasXLogP3 ?XLogP3 .\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-126",
        "domain": "ontospecies",
        "question": "Can you find chemical species that are classified as heterocyclic compounds, have a molecular weight of about 72.11, function as processing aids not otherwise listed, and their defined atom stereocenter count is either less than -1 or greater than 1?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue < -1.0 || ?AtomChiralDefCountValue > 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"heterocyclic compound\" .\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue > 72.11*0.9 && ?MolecularWeightValue < 72.11*1.1 )\n  ?Species os:hasUse/rdfs:label \"Processing aids, not otherwise listed\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-48",
        "domain": "ontospecies",
        "question": "Heat of vaporization value for diazole class chemicals?",
        "query": {
            "sparql": "SELECT ?HeatOfVaporization WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"diazole\" .\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-76",
        "domain": "ontospecies",
        "question": "For C20H12, what is its IUPAC name and monoisotopic weight and flash point",
        "query": {
            "sparql": "SELECT ?IUPACName ?MonoIsotopicWeight ?FlashPoint WHERE {\n  VALUES ?Species { \"C20H12\" }\n  ?Species os:hasIUPACName ?IUPACName .\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n  ?Species os:hasFlashPoint ?FlashPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-109",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that fall under the polyatomic entity class and have a flash point less than 403.095?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue < 403.095 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-924",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is carbon group molecular entity and chemical class is Organophosphates, Other",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"carbon group molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"Organophosphates, Other\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-440",
        "domain": "ontocompchem",
        "question": "Can you find the ground state energy and LUMO+2 energy for HNO?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HNO\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-972",
        "domain": "ontospecies",
        "question": "What's the chemical structure, melting point, and heat of sublimation for formic acid and C6H10O3?",
        "query": {
            "sparql": "SELECT ?MolecularFormula ?MeltingPoint ?EnthalpyOfSublimation WHERE {\n  VALUES ?Species { \"formic acid\" \"C6H10O3\" }\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-212",
        "domain": "ontocompchem",
        "question": "Can you provide information on the calculation of the total energy, and also the energy for the lowest unoccupied molecular orbital (LUMO) of Kr at the G3 level utilizing the STO-6G basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Kr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-31",
        "domain": "ontocompchem",
        "question": "What is the optimized geometry of Sb2 calculated at the PM6 level, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Sb2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-59",
        "domain": "ontokin",
        "question": "What is the chemical process present in https://doi.org/10.1002/kin.20603 where C2-QOOH reacts to form SXC6H11?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"SXC6H11\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C2-QOOH\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-839",
        "domain": "ontospecies",
        "question": "Can you find the ionization potential for InChI=1S/C6H9N3/c7-3-1-5-9-6-2-4-8/h9H,1-2,5-6H2?",
        "query": {
            "sparql": "SELECT ?IonizationPotential WHERE {\n  VALUES ?Species { \"InChI=1S/C6H9N3/c7-3-1-5-9-6-2-4-8/h9H,1-2,5-6H2\" }\n  ?Species os:hasIonizationPotential ?IonizationPotential .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-399",
        "domain": "ontospecies",
        "question": "What is the molecular formula and Caco-2 permeability and isotope atom count of 1-methyl-4-propan-2-yl-benzene",
        "query": {
            "sparql": "SELECT ?MolecularFormula ?Caco2Permeability ?IsotopeAtomCount WHERE {\n  VALUES ?Species { \"1-methyl-4-propan-2-yl-benzene\" }\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-85",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that have a bond chiral def count greater than -1.0, density range from 0.9288000000000001 to 1.1352000000000002, fewer than 11 non-hydrogen atoms, are applied in Functional fluids (closed systems), and have a vapor pressure equal to 3.9996717.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -1.0 )\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue > 0.9288000000000001 && ?DensityValue < 1.1352000000000002 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue < 11 )\n  ?Species os:hasUse/rdfs:label \"Functional fluids (closed systems)\" .\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue = 3.9996717 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-360",
        "domain": "ontospecies",
        "question": "Need information on chemical species classified as both an organothiophosphate insecticide and a p-block molecular entity with complexity >= 154.8, used in landscaping or yard work (Landscaping/Yard), possessing less than one charge and also classified as a main group molecular entity.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organothiophosphate insecticide\" .\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue >= 154.8 )\n  ?Species os:hasUse/rdfs:label \"Landscaping/Yard\" .\n  ?Species os:hasChemicalClass/rdfs:label \"p-block molecular entity\" .\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue < 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"main group molecular entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-938",
        "domain": "ontospecies",
        "question": "Can you tell me the temperature at which 1-nitropropane automatically ignites?",
        "query": {
            "sparql": "SELECT ?AutoignitionTemperature WHERE {\n  VALUES ?Species { \"1-nitropropane\" }\n  ?Species os:hasAutoignitionTemperature ?AutoignitionTemperature .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-561",
        "domain": "ontospecies",
        "question": "I need to find the Chemical Entities of Biological Interest (ChEBI) identifier for 2,2-dimethylpropionic acid.",
        "query": {
            "sparql": "SELECT ?ChebiID WHERE {\n  VALUES ?Species { \"2,2-dimethylpropionic acid\" }\n  ?Species os:hasChebiID ?ChebiID .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-133",
        "domain": "ontocompchem",
        "question": "Can you help me find the Bk HOMO energy determined by the RB3LYP level of theory with use of either 6-311G or 6-311G basis sets?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Bk\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-298",
        "domain": "ontocompchem",
        "question": "Can you tell me the HOMO-2 energy level for Ar evaluated using B3LYP with either CC-pVDZ or 6-311G basis sets?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ar\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVDZ\" \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-536",
        "domain": "ontospecies",
        "question": "Looking for details about CCCCSP(=O)(SCCCC)SCCCC including its enthalpy of sublimation, uses, and number of defined bond stereocenters.",
        "query": {
            "sparql": "SELECT ?EnthalpyOfSublimation ?UseLabel ?BondChiralDefCount WHERE {\n  VALUES ?Species { \"CCCCSP(=O)(SCCCC)SCCCC\" }\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n  ?Species os:hasBondChiralDefCount ?BondChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-367",
        "domain": "ontospecies",
        "question": "Search for organochlorine insecticide chemicals with monoisotopic weights outside of the range from 286.158303 to 349.749037 and roughly have a boiling point of about 466.15 degrees.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue < 286.158303 || ?MonoIsotopicWeightValue > 349.749037 )\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue > 466.15*0.9 && ?BoilingPointValue < 466.15*1.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"organochlorine insecticide\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-854",
        "domain": "ontospecies",
        "question": "I'm looking for Solvents that have a minimum undefined atom stereocenter count of -1.0 and no chiral def atoms, can you help?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue >= -1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"Solvents\" .\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue = 0.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-754",
        "domain": "ontospecies",
        "question": "What is the heat of vaporization and collision cross section of CC[C@H]1[C@H](COC1=O)CC2=CN=CN2C and CCCN(CCC)C1=C(C=C(C=C1[N+](=O)[O-])S(=O)(=O)C)[N+](=O)[O-]",
        "query": {
            "sparql": "SELECT ?HeatOfVaporization ?CollisionCrossSection WHERE {\n  VALUES ?Species { \"CC[C@H]1[C@H](COC1=O)CC2=CN=CN2C\" \"CCCN(CCC)C1=C(C=C(C=C1[N+](=O)[O-])S(=O)(=O)C)[N+](=O)[O-]\" }\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n}"
        }
    }
]