[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-970",
        "domain": "ontospecies",
        "question": "Looking for information on the vapor density and number of heavy atoms in C9H18O and 2-[[(4R)-4-[(3R,5S,7R,8R,9S,10S,12S,13R,14S,17R)-10,13-dimethyl-3,7,12-tris(oxidanyl)-2,3,4,5,6,7,8,9,11,12,14,15,16,17-tetradecahydro-1H-cyclopenta[a]phenanthren-17-yl]pentanoyl]amino]ethanesulfonic acid.",
        "query": {
            "sparql": "SELECT ?VaporDensity ?HeavyAtomCount WHERE {\n  VALUES ?Species { \"C9H18O\" \"2-[[(4R)-4-[(3R,5S,7R,8R,9S,10S,12S,13R,14S,17R)-10,13-dimethyl-3,7,12-tris(oxidanyl)-2,3,4,5,6,7,8,9,11,12,14,15,16,17-tetradecahydro-1H-cyclopenta[a]phenanthren-17-yl]pentanoyl]amino]ethanesulfonic acid\" }\n  ?Species os:hasVaporDensity ?VaporDensity .\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-420",
        "domain": "ontokin",
        "question": "What does the kinetic model for the H + O2 = OH + O chemical reaction described in the link https://doi.org/10.1016/j.combustflame.2007.10.024 mean?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + O2 = OH + O\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-260",
        "domain": "ontokin",
        "question": "Can you give me information about the kinetic model for a chemical reaction that yields C8OOH4-OO3-2?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C8OOH4-OO3-2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-541",
        "domain": "ontospecies",
        "question": "What is the density of CNC[C@@H](C1=CC(=CC=C1)O)O",
        "query": {
            "sparql": "SELECT ?Density WHERE {\n  VALUES ?Species { \"CNC[C@@H](C1=CC(=CC=C1)O)O\" }\n  ?Species os:hasDensity ?Density .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-591",
        "domain": "ontospecies",
        "question": "What's C1=CC(=CC=C1N)Br's heat of vaporization?",
        "query": {
            "sparql": "SELECT ?HeatOfVaporization WHERE {\n  VALUES ?Species { \"C1=CC(=CC=C1N)Br\" }\n  ?Species os:hasHeatOfVaporization ?HeatOfVaporization .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-19",
        "domain": "ontocompchem",
        "question": "I'm looking for the rotational constants and least energy value of the lowest unoccupied molecular orbital in BrH, using the CCSD(T) method with different basis sets.",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?LUMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BrH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-128",
        "domain": "ontocompchem",
        "question": "What is the energy of lowest unoccupied molecular orbital and total Gibbs free energy and total energy of Bk",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?TotalGibbsFreeEnergy ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Bk\" .\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-767",
        "domain": "ontospecies",
        "question": "How many tautomers do C4H11N and CNC have?",
        "query": {
            "sparql": "SELECT ?TautomerCount WHERE {\n  VALUES ?Species { \"C4H11N\" \"CNC\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-344",
        "domain": "ontocompchem",
        "question": "Need details on the CC-pVQZ basis set used for calculating the NHOMO energy and geometry of Re at all levels of theory.",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?OptimizedGeometry ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Re\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-173",
        "domain": "ontocompchem",
        "question": "What is the SLUMO energy and HOMO energy of Np calculated at the CCSD(T) level across all basis set",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?HOMOEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Np\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-477",
        "domain": "ontospecies",
        "question": "Can you tell me the flash point for acetyl chloride?",
        "query": {
            "sparql": "SELECT ?FlashPoint WHERE {\n  VALUES ?Species { \"acetyl chloride\" }\n  ?Species os:hasFlashPoint ?FlashPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-764",
        "domain": "ontospecies",
        "question": "I need to find out the values for heat of combustion and melting points of C6H12O7, C6H8N2, and C10Cl10O.",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion ?MeltingPoint WHERE {\n  VALUES ?Species { \"C10Cl10O\" \"C6H8N2\" \"C6H12O7\" }\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-333",
        "domain": "ontocompchem",
        "question": "Can you give me the zero point energy values of F6S for every theoretical level?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F6S\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-413",
        "domain": "ontokin",
        "question": "What's the kinetic model of a chemical reaction producing NEOC5H10OOH?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"NEOC5H10OOH\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-514",
        "domain": "ontospecies",
        "question": "What is the defined bond stereocenter count and LogP of C4H9NO and CN1C(=O)CN=C(C2=C1C=CC(=C2)[N+](=O)[O-])C3=CC=CC=C3F",
        "query": {
            "sparql": "SELECT ?BondChiralDefCount ?LogP WHERE {\n  VALUES ?Species { \"C4H9NO\" \"CN1C(=O)CN=C(C2=C1C=CC(=C2)[N+](=O)[O-])C3=CC=CC=C3F\" }\n  ?Species os:hasBondChiralDefCount ?BondChiralDefCount .\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-132",
        "domain": "ontokin",
        "question": "Can you show me the kinetic model for a chemical reaction producing MN5OOH2J?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MN5OOH2J\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-822",
        "domain": "ontospecies",
        "question": "What is the monoisotopic mass of the chemical species whose vapor pressure is <= 12 and number of hydrogen bond donors is outside the range (-1.0, 1) and flash point is equal to 374.81668",
        "query": {
            "sparql": "SELECT ?MonoIsotopicWeight WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue <= 12 )\n  ?Species os:hasHydrogenBondDonorCount/os:value ?HydrogenBondDonorCountValue .\n  FILTER ( ?HydrogenBondDonorCountValue < -1.0 || ?HydrogenBondDonorCountValue > 1 )\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue = 374.81668 )\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-439",
        "domain": "ontospecies",
        "question": "I'm looking for the XLOGP3 and number of bond stereocenters in any chemical species that has a minimum Henry's law constant of 3164 and mono isotopic weight over 161.",
        "query": {
            "sparql": "SELECT ?XLogP3 ?BondChiralCount WHERE {\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue >= 3164 )\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 161 )\n  ?Species os:hasXLogP3 ?XLogP3 .\n  ?Species os:hasBondChiralCount ?BondChiralCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-918",
        "domain": "ontospecies",
        "question": "What is the standard enthalpy of formation and atom chiral def count of 2,4,5-trimethoxybenzaldehyde and 2,5-dichloroaniline",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation ?AtomChiralDefCount WHERE {\n  VALUES ?Species { \"2,4,5-trimethoxybenzaldehyde\" \"2,5-dichloroaniline\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-776",
        "domain": "ontospecies",
        "question": "What's the optical rotation of InChI=1S/C7H14O2/c1-2-3-4-8-5-7-6-9-7/h7H,2-6H2,1H3?",
        "query": {
            "sparql": "SELECT ?OpticalRotation WHERE {\n  VALUES ?Species { \"InChI=1S/C7H14O2/c1-2-3-4-8-5-7-6-9-7/h7H,2-6H2,1H3\" }\n  ?Species os:hasOpticalRotation ?OpticalRotation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-594",
        "domain": "ontospecies",
        "question": "For InChI=1S/C19H21N/c1-20-14-6-11-19-17-9-4-2-7-15(17)12-13-16-8-3-5-10-18(16)19/h2-5,7-11,20H,6,12-14H2,1H3, what is its charge",
        "query": {
            "sparql": "SELECT ?Charge WHERE {\n  VALUES ?Species { \"InChI=1S/C19H21N/c1-20-14-6-11-19-17-9-4-2-7-15(17)12-13-16-8-3-5-10-18(16)19/h2-5,7-11,20H,6,12-14H2,1H3\" }\n  ?Species os:hasCharge ?Charge .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-420",
        "domain": "ontocompchem",
        "question": "What's the value for Nd's HOMO energy when computed through the 6-311G basis set?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Nd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-122",
        "domain": "ontocompchem",
        "question": "Looking for the calculated Gibbs free energy and electronic energy of CO2 at the B3LYP level",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CO2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-805",
        "domain": "ontospecies",
        "question": "Searching for the count of non-hydrogen atoms in a chemical entity that has an isotopic weight over 37.8196173 and carries a charge more than -1.",
        "query": {
            "sparql": "SELECT ?HeavyAtomCount WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 37.8196173 )\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -1.0 )\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-405",
        "domain": "ontospecies",
        "question": "Show me the chemical species that function as Process regulators, have only one hydrogen bond acceptor, and their undefined bond stereocenter count falls within -1 to 1 range.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue = 1.0 )\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue > -1 && ?BondChiralUndefCountValue < 1.0 )\n  ?Species os:hasUse/rdfs:label \"Process regulators\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-357",
        "domain": "ontocompchem",
        "question": "Can you find the ground state energy for ClH via all theoretical levels with the 6-311G basis set?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-467",
        "domain": "ontocompchem",
        "question": "What's the energy of the HOMO-2 orbital in Cr?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cr\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-176",
        "domain": "ontocompchem",
        "question": "Looking for the Pa's rotational constants and need to know the theory level and basis set involved in computations.",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pa\" .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-67",
        "domain": "ontospecies",
        "question": "I'm looking for Other Uses class chemicals with exactly 2.0 rotatable bonds and a logP of 2.06.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"Other Uses\" .\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue = 2.0 )\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue = 2.06 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-59",
        "domain": "ontocompchem",
        "question": "What is the frequencies of Ar calculated at the PM6 level using the STO-4G basis set",
        "query": {
            "sparql": "SELECT ?Frequencies WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ar\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-141",
        "domain": "ontospecies",
        "question": "Search for chemicals in the Toxic Gases & Vapors category that have a bond stereocenter count of less than -1 or more than 1, and a bond chiral def count that's higher than -1 but lower than 1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue < -1 || ?BondChiralCountValue > 1 )\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -1 && ?BondChiralDefCountValue < 1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"Toxic Gases & Vapors\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-338",
        "domain": "ontocompchem",
        "question": "I need to know the RB3LYP-level calculated energy of the LUMO in Re.",
        "query": {
            "sparql": "SELECT ?LUMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Re\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-186",
        "domain": "ontospecies",
        "question": "I need to identify chemical species with these four classifications: polyatomic entity, carbonyl compound, chalcongen molecular entity andmolecular entitiy. These species should also have an undefined bond stereocenter count close to zero, and the number of their rotatable bonds must exceed -1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"carbonyl compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"chalcogen molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue > -0.1 && ?BondChiralUndefCountValue < 0.1 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue > -1.0 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-128",
        "domain": "ontokin",
        "question": "Can you tell me about the kinetic model for a chemical reaction where MDCY675O is the reactant and P-C5H11 is the product?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDCY675O\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"P-C5H11\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-483",
        "domain": "ontospecies",
        "question": "Find me chemical species classified as Solvents with a molecular mass close to 74.12, please.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue > 74.12*0.9 && ?MolecularWeightValue < 74.12*1.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"Solvents\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-231",
        "domain": "ontospecies",
        "question": "What is the tautomer count and atom chiral undef count of the chemical species whose chemical class is halogen molecular entity and bond stereocenter count is <= 1.0 and autoignition temperature is less than or equal to 730",
        "query": {
            "sparql": "SELECT ?TautomerCount ?AtomChiralUndefCount WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"halogen molecular entity\" .\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue <= 1.0 )\n  ?Species os:hasAutoignitionTemperature/os:value ?AutoignitionTemperatureValue .\n  FILTER ( ?AutoignitionTemperatureValue <= 730 )\n  ?Species os:hasTautomerCount ?TautomerCount .\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-860",
        "domain": "ontospecies",
        "question": "I need to know the autoignition temperatures for C3H4O2, CC(C(=O)OC)O and 1,3-bis(oxidanylidene)-2-benzofuran-5-carboxylic acid.",
        "query": {
            "sparql": "SELECT ?AutoignitionTemperature WHERE {\n  VALUES ?Species { \"C3H4O2\" \"CC(C(=O)OC)O\" \"1,3-bis(oxidanylidene)-2-benzofuran-5-carboxylic acid\" }\n  ?Species os:hasAutoignitionTemperature ?AutoignitionTemperature .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-151",
        "domain": "ontospecies",
        "question": "Which chemical species belong to the molecular entity classification?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"molecular entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-149",
        "domain": "ontospecies",
        "question": "Chemical species with a compound complexity of 19.2 in the chemical entity class?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue = 19.2 )\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-66",
        "domain": "ontokin",
        "question": "What is the reaction mechanism that invovles the reaction H + HO2 = OH + OH and invovles the reaction H2 + HE <=> HE + H + H",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H + HO2 = OH + OH\" .\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H2 + HE <=> HE + H + H\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-173",
        "domain": "ontokin",
        "question": "I need the kinetic model of this chemical reaction O + HE + O <=> HE + O2.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"O + HE + O <=> HE + O2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-322",
        "domain": "ontospecies",
        "question": "Can you find chemical species that act as a Corrosion inhibitor, are used as a xenobiotic metabolite, classified as both a chemical entity and a heteroatomic molecular entity, and have a flash point less than 388.46500000000003?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasUse/rdfs:label \"Corrosion inhibitor\" .\n  ?Species os:hasUse/rdfs:label \"xenobiotic metabolite\" .\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heteroatomic molecular entity\" .\n  ?Species os:hasFlashPoint/os:value ?FlashPointValue .\n  FILTER ( ?FlashPointValue < 388.46500000000003 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-63",
        "domain": "ontokin",
        "question": "What is the kinetic model of a chemical reaction involving NC10H21 as a reactant?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"NC10H21\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-459",
        "domain": "ontocompchem",
        "question": "What is the total enthalpy of CH4 calculated at the PBE0 level of theory, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CH4\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-374",
        "domain": "ontocompchem",
        "question": "Finding HOMO and HOMO-1 energy for CS2 using aug-cc-pVTZ basis set.",
        "query": {
            "sparql": "SELECT ?HOMOEnergy ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CS2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-310",
        "domain": "ontospecies",
        "question": "What are the chemical species whose molecular weight is not less than 191.061 and rotatable bond count is equal to 1.0 and boiling point is approximately 473.15 and chemical class is aromatic compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue >= 191.061 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue = 1.0 )\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue > 473.15*0.9 && ?BoilingPointValue < 473.15*1.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"aromatic compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-369",
        "domain": "ontospecies",
        "question": "What's the solubility level of an olefinic compound that uses Solvent?",
        "query": {
            "sparql": "SELECT ?Solubility WHERE {\n  ?Species os:hasUse/rdfs:label \"Solvent\" .\n  ?Species os:hasChemicalClass/rdfs:label \"olefinic compound\" .\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-448",
        "domain": "ontocompchem",
        "question": "How is the SLUMO energy calculated for water (Pa) using basis sets such as 6-311G and CC-pVDZ?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pa\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-46",
        "domain": "ontokin",
        "question": "For the chemical reaction that has product MD7OOH, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MD7OOH\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-404",
        "domain": "ontokin",
        "question": "Need info on chemical reaction: CH2CCH2OH reacts to form MDCY35MO",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CH2CCH2OH\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDCY35MO\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-814",
        "domain": "ontospecies",
        "question": "What's the level of Caco-2 permeability in 2-methylbutan-2-ol?",
        "query": {
            "sparql": "SELECT ?Caco2Permeability WHERE {\n  VALUES ?Species { \"2-methylbutan-2-ol\" }\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-296",
        "domain": "ontospecies",
        "question": "What's the logP value for InChI=1S/C12H17N2O4P/c1-14(2)7-6-9-8-13-10-4-3-5-11(12(9)10)18-19(15,16)17/h3-5,8,13H,6-7H2,1-2H3,(H2,15,16,17), C17H18N2O6, and C9H10O?",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  VALUES ?Species { \"InChI=1S/C12H17N2O4P/c1-14(2)7-6-9-8-13-10-4-3-5-11(12(9)10)18-19(15,16)17/h3-5,8,13H,6-7H2,1-2H3,(H2,15,16,17)\" \"C17H18N2O6\" \"C9H10O\" }\n  ?Species os:hasLogP ?LogP .\n}"
        }
    }
]