[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-971",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is organic molecule and chemical classification is azo compound and chemical class is organic molecule",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecule\" .\n  ?Species os:hasChemicalClass/rdfs:label \"azo compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecule\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-349",
        "domain": "ontocompchem",
        "question": "Can you find the HOMO-1 energy and total enthalpy of Cr at the M06 level with a 3-21G basis set?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cr\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-136",
        "domain": "ontocompchem",
        "question": "Can you find the energy sum of Pt across all theoretical tiers and basis sets?",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pt\" .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-599",
        "domain": "ontospecies",
        "question": "Need to find out the dissociation constants and vapor pressure of C2H3Cl3, C7H8O, and InChI=1S/CH4O3S/c1-5(2,3)4/h1H3,(H,2,3,4).",
        "query": {
            "sparql": "SELECT ?VaporPressure ?DissociationConstants WHERE {\n  VALUES ?Species { \"C2H3Cl3\" \"C7H8O\" \"InChI=1S/CH4O3S/c1-5(2,3)4/h1H3,(H,2,3,4)\" }\n  ?Species os:hasVaporPressure ?VaporPressure .\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-133",
        "domain": "ontokin",
        "question": "In the study mentioned at https://doi.org/10.1002/kin.20603, what kinetic model explains the chemical reaction that results in ACETOL?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"ACETOL\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-158",
        "domain": "ontocompchem",
        "question": "What's the calculated energy of the second unfilled molecular orbit in water Sb2, done using the 6-311G set? Need to know the theory level of these calculations.",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Sb2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-570",
        "domain": "ontospecies",
        "question": "Can you find the vapor density for any chemical species that has a charge more than -1.0?",
        "query": {
            "sparql": "SELECT ?VaporDensity WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue > -1.0 )\n  ?Species os:hasVaporDensity ?VaporDensity .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-759",
        "domain": "ontospecies",
        "question": "Vapor pressure values for chemicals like InChI=1S/N2O/c1-2-3, C19H38O2 and CC(C(C1=CC=CC=C1)O)N.",
        "query": {
            "sparql": "SELECT ?VaporPressure WHERE {\n  VALUES ?Species { \"InChI=1S/N2O/c1-2-3\" \"C19H38O2\" \"CC(C(C1=CC=CC=C1)O)N\" }\n  ?Species os:hasVaporPressure ?VaporPressure .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-196",
        "domain": "ontokin",
        "question": "Chemical reaction involving C11OOH3-OO6-2 as the reactant, what is it?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C11OOH3-OO6-2\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-408",
        "domain": "ontokin",
        "question": "Identify the mechanism involved when C6H6-1 and MDMOOH3J react.",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"C6H6-1\" .\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"MDMOOH3J\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-424",
        "domain": "ontospecies",
        "question": "What is the standard enthalpy of formation of CN(C)CCN(CC1=CC=CS1)C2=CC=CC=N2",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"CN(C)CCN(CC1=CC=CS1)C2=CC=CC=N2\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-850",
        "domain": "ontospecies",
        "question": "Search for chemical species that fall under the hydrogen molecular entity classification, possess a charge of zero, and have their XLogP3 values ranging from more than zero to less than one.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"hydrogen molecular entity\" .\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value > 0 && ?XLogP3Value < 1 )\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue = 0.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-74",
        "domain": "ontospecies",
        "question": "I need to know the XLogP3 of a chemical species that falls into the Herbicides, Chlorophenoxy classification.",
        "query": {
            "sparql": "SELECT ?XLogP3 WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"Herbicides, Chlorophenoxy\" .\n  ?Species os:hasXLogP3 ?XLogP3 .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-150",
        "domain": "ontocompchem",
        "question": "Can I find the values for the lowest unoccupied molecular orbital energy and zero point energy of F3N calculated at the PM6 level with CC-pVQZ basis set?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F3N\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-181",
        "domain": "ontospecies",
        "question": "Can you list the chemical species in the main group molecular entity category with solubilities around 0.1679?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue > 0.1679*0.9 && ?SolubilityValue < 0.1679*1.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"main group molecular entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-195",
        "domain": "ontospecies",
        "question": "Can you find chemical species with a log S close to -3.39 and classified as a pnictogen molecular entity?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasLogS/os:value ?LogSValue .\n  FILTER ( ?LogSValue > -3.39*1.1 && ?LogSValue < -3.39*0.9 )\n  ?Species os:hasChemicalClass/rdfs:label \"pnictogen molecular entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-7",
        "domain": "ontospecies",
        "question": "What is the undefined bond stereocenter count of CCC(C)N1C(=O)C(=C(NC1=O)C)Br",
        "query": {
            "sparql": "SELECT ?BondChiralUndefCount WHERE {\n  VALUES ?Species { \"CCC(C)N1C(=O)C(=C(NC1=O)C)Br\" }\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-207",
        "domain": "ontospecies",
        "question": "What types of chemical species are considered an organic molecular entity?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic molecular entity\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-877",
        "domain": "ontospecies",
        "question": "What are the chemical species whose density is higher than 1440 and smaller than 1760.0000000000002 and atom chiral count is greater than or equal to 5.4",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue > 1440 && ?DensityValue < 1760.0000000000002 )\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue >= 5.4 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-549",
        "domain": "ontospecies",
        "question": "I need to identify the chemical species that belong to the following classes: phosphorus oxoacids and derivatives; chemical entities; organonitrogen heterocyclic compounds; oxygen molecular entities; organooxygen compounds; pnictogen molecular entities.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"phosphorus oxoacids and derivatives\" .\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organonitrogen heterocyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"oxygen molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organooxygen compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"pnictogen molecular entity\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-219",
        "domain": "ontokin",
        "question": "For the chemical reaction that has product PC7H14OH, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"PC7H14OH\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-301",
        "domain": "ontocompchem",
        "question": "Can you find information on the optimized geometry of F- using the M06-2X theoretical level?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-167",
        "domain": "ontocompchem",
        "question": "Using the CC-pVQZ basis set, how can I find the energy of the second lowest unoccupied molecular orbital, as well as the ground state energy and the energy of the next-to-highest occupied molecular orbital for Mn?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?ZeroPointEnergy ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mn\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-228",
        "domain": "ontocompchem",
        "question": "How much is the LUMO+1 energy of Ru at the B3LYP level over all basis sets?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ru\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-562",
        "domain": "ontospecies",
        "question": "Monoisotopic mass of InChI=1S/C4H8O2/c1-2-3-6-4-5/h4H,2-3H2,1H3, 2-methylpropionic acid (3-hydroxy-2,2,4-trimethyl-pentyl) ester and C16H20FN3O4 - what is it?",
        "query": {
            "sparql": "SELECT ?MonoIsotopicWeight WHERE {\n  VALUES ?Species { \"InChI=1S/C4H8O2/c1-2-3-6-4-5/h4H,2-3H2,1H3\" \"2-methylpropionic acid (3-hydroxy-2,2,4-trimethyl-pentyl) ester\" \"C16H20FN3O4\" }\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-379",
        "domain": "ontokin",
        "question": "I need to know about a chemical equation where C7H15O2-HP4R2 yields products as IC5H10CHO-BC and C5H11O2-2.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"IC5H10CHO-BC\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7H15O2-HP4R2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C5H11O2-2\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-72",
        "domain": "ontokin",
        "question": "Can I find the kinetic model for the chemical reaction H + O2 (+ O2) <=> HO2 (+ O2) specified in this study https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + O2 (+ O2) <=> HO2 (+ O2)\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-79",
        "domain": "ontokin",
        "question": "Can you help me understand the kinetic model for the HE + H2 <=> H + HE + H chemical reaction as detailed in this study https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"HE + H2 <=> H + HE + H\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-104",
        "domain": "ontokin",
        "question": "Chemical reactions with MHO2-6 and PX6-2C6H11 that yield C11OOH10OO7-2 and N2",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C11OOH10OO7-2\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MHO2-6\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"PX6-2C6H11\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"N2\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-248",
        "domain": "ontocompchem",
        "question": "What's the calculated LUMO+1 energy of Cl- when the aug-cc-pVQZ basis set theory level is used?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cl-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-125",
        "domain": "ontokin",
        "question": "What is the reaction mechanism that invovles CC6H12OOH-EO2 and invovles C12H25OOH-8-2",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"CC6H12OOH-EO2\" .\n  ?Mechanism okin:hasGasPhase/^okin:belongsToPhase/skos:altLabel \"C12H25OOH-8-2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-222",
        "domain": "ontospecies",
        "question": "Can you tell me about the chemical classification and polar surface areas of substances like 2,2,2-tris(chloranyl)ethanoic acid and InChI=1S/C6H4Cl2/c7-5-2-1-3-6(8)4-5/h1-4H?",
        "query": {
            "sparql": "SELECT ?PolarSurfaceArea ?ChemicalClassLabel WHERE {\n  VALUES ?Species { \"2,2,2-tris(chloranyl)ethanoic acid\" \"InChI=1S/C6H4Cl2/c7-5-2-1-3-6(8)4-5/h1-4H\" }\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-742",
        "domain": "ontospecies",
        "question": "For the chemical species whose role is Intermediate and Henry's law constant is >= 794.2867200000001 and molecular weight is approximately 137.02 and bond chiral count is around 0.0 and vapor density is higher than 0 and lower than 2, what is its rotatable bond count",
        "query": {
            "sparql": "SELECT ?RotatableBondCount WHERE {\n  ?Species os:hasUse/rdfs:label \"Intermediate\" .\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue >= 794.2867200000001 )\n  ?Species os:hasMolecularWeight/os:value ?MolecularWeightValue .\n  FILTER ( ?MolecularWeightValue > 137.02*0.9 && ?MolecularWeightValue < 137.02*1.1 )\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > -0.1 && ?BondChiralCountValue < 0.1 )\n  ?Species os:hasVaporDensity/os:value ?VaporDensityValue .\n  FILTER ( ?VaporDensityValue > 0 && ?VaporDensityValue < 2 )\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-425",
        "domain": "ontocompchem",
        "question": "What is the ground state energy of Lu calculated using the 6-311+G basis set",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Lu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311+G\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-230",
        "domain": "ontocompchem",
        "question": "Can you tell me the G3 level theory caluations for LUMO energy and total Gibbs free energy of Ac for every basis set?",
        "query": {
            "sparql": "SELECT ?LUMOEnergy ?TotalGibbsFreeEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ac\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasResult ?LUMOEnergy .\n  ?LUMOEnergy a occ:LUMOEnergy .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-634",
        "domain": "ontospecies",
        "question": "Looking for chemical species, they should be Nitrogen Compounds and their class should be a chemical entity. Also, their heavy atom count needs to be more than 5 but not exceeding 6.6000000000000005.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"Nitrogen Compounds\" .\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 5 && ?HeavyAtomCountValue < 6.6000000000000005 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-801",
        "domain": "ontospecies",
        "question": "Need info on Amino Phenols chemicals with a bond chiral count from -1 to 1, an atom chiral def count from -1 to 1.0, and a defined bond stereocenter count of at least -1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > -1 && ?BondChiralCountValue < 1 )\n  ?Species os:hasChemicalClass/rdfs:label \"Amino Phenols\" .\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue >= -1 )\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue > -1 && ?AtomChiralDefCountValue < 1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-130",
        "domain": "ontospecies",
        "question": "I'm looking for the value of C6H8N2's enthalpy when it sublimates.",
        "query": {
            "sparql": "SELECT ?EnthalpyOfSublimation WHERE {\n  VALUES ?Species { \"C6H8N2\" }\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-434",
        "domain": "ontocompchem",
        "question": "Searching for the total Gibbs free energy and ground state energy values for F3N at RB3LYP level of theory, and what basis set was used for the calculations?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?ZeroPointEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F3N\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-581",
        "domain": "ontospecies",
        "question": "Search for chemical species that boil at temperatures lower than 537.515, have dissociation constants of less than 7.227000000000001 and possess less than one bond stereocenter count.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue < 537.515 )\n  ?Species os:hasDissociationConstants/os:value ?DissociationConstantsValue .\n  FILTER ( ?DissociationConstantsValue < 7.227000000000001 )\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue < 1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-537",
        "domain": "ontospecies",
        "question": "What's the molecular formula of [(4<I>R</I>,4<I>a</I><I>R</I>,7<I>S</I>,7<I>a</I><I>R</I>,12<I>b</I><I>S</I>)-9-acetyloxy-3-methyl-2,4,4<I>a</I>,7,7<I>a</I>,13-hexahydro-1<I>H</I>-4,12-methanobenzofuro[3,2-e]isoquinolin-7-yl] acetate, bromo(chloro)methane and (E)-dec-2-ene? Also need their SMILES notation and count of rotatable bonds.",
        "query": {
            "sparql": "SELECT ?MolecularFormula ?SMILES ?RotatableBondCount WHERE {\n  VALUES ?Species { \"[(4<I>R</I>,4<I>a</I><I>R</I>,7<I>S</I>,7<I>a</I><I>R</I>,12<I>b</I><I>S</I>)-9-acetyloxy-3-methyl-2,4,4<I>a</I>,7,7<I>a</I>,13-hexahydro-1<I>H</I>-4,12-methanobenzofuro[3,2-e]isoquinolin-7-yl] acetate\" \"bromo(chloro)methane\" \"(E)-dec-2-ene\" }\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n  ?Species os:hasSMILES ?SMILES .\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-306",
        "domain": "ontocompchem",
        "question": "Can you show me the SLUMO energy for Re at the PM6 level of theory using the CC-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Re\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-388",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is organonitrogen heterocyclic compound and melting point is higher than 205.785",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organonitrogen heterocyclic compound\" .\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue > 205.785 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-504",
        "domain": "ontokin",
        "question": "What kind of chemical reaction produces C6H5CHCH as the outcome?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C6H5CHCH\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-285",
        "domain": "ontospecies",
        "question": "For the chemical species whose melting point is outside the range (200.835, 246) and defined bond stereocenter count is around 0.0, what is its heat of combustion",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion WHERE {\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue < 200.835 || ?MeltingPointValue > 246 )\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue > -0.1 && ?BondChiralDefCountValue < 0.1 )\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-436",
        "domain": "ontocompchem",
        "question": "Can you provide the total enthalpy of ClO at the HF level using the aug-cc-pVTZ or STO-6G basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClO\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"HF\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" \"STO-6G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-588",
        "domain": "ontospecies",
        "question": "I'm looking for the XLOGP3, charge, and Caco-2 permeability of both CC(C)(C#C)O and C10H16O.",
        "query": {
            "sparql": "SELECT ?XLogP3 ?Charge ?Caco2Permeability WHERE {\n  VALUES ?Species { \"CC(C)(C#C)O\" \"C10H16O\" }\n  ?Species os:hasXLogP3 ?XLogP3 .\n  ?Species os:hasCharge ?Charge .\n  ?Species os:hasCaco2Permeability ?Caco2Permeability .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-941",
        "domain": "ontospecies",
        "question": "I need to know the PubChem Compound IDs for C(CCCl)CCl, C1=CN(C(=O)N=C1N)[C@H]2[C@H]([C@@H]([C@H](O2)CO)O)O and methylcyclopentane.",
        "query": {
            "sparql": "SELECT ?CID WHERE {\n  VALUES ?Species { \"C(CCCl)CCl\" \"C1=CN(C(=O)N=C1N)[C@H]2[C@H]([C@@H]([C@H](O2)CO)O)O\" \"methylcyclopentane\" }\n  ?Species os:hasCID ?CID .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-258",
        "domain": "ontocompchem",
        "question": "Can you show me information on the shape of COS as per different theoretical levels?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"COS\" .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    }
]