[
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-319",
        "domain": "ontokin",
        "question": "Can you show me a chemical reaction where O2C5H10OH-1 and BC6H11-E are the products?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"O2C5H10OH-1\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"BC6H11-E\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-312",
        "domain": "ontospecies",
        "question": "Can you tell me the viscosity of InChI=1S/H4N2/c1-2/h1-2H2 and InChI=1S/BrH/h1H?",
        "query": {
            "sparql": "SELECT ?Viscosity WHERE {\n  VALUES ?Species { \"InChI=1S/H4N2/c1-2/h1-2H2\" \"InChI=1S/BrH/h1H\" }\n  ?Species os:hasViscosity ?Viscosity .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-42",
        "domain": "ontocompchem",
        "question": "Total energy contained in La",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"La\" .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-414",
        "domain": "ontospecies",
        "question": "What's the number of chiral atoms in chemicals from the hydrides class that function as a plant metabolite?",
        "query": {
            "sparql": "SELECT ?AtomChiralDefCount WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"hydrides\" .\n  ?Species os:hasUse/rdfs:label \"plant metabolite\" .\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-116",
        "domain": "ontospecies",
        "question": "I need to know the ChEBI IDs for C12H12N2 and 8-chloro-1-methyl-6-phenyl-4<I>H</I>-[1,2,4]triazolo[4,3-a][1,4]benzodiazepine, can you help?",
        "query": {
            "sparql": "SELECT ?ChebiID WHERE {\n  VALUES ?Species { \"C12H12N2\" \"8-chloro-1-methyl-6-phenyl-4<I>H</I>-[1,2,4]triazolo[4,3-a][1,4]benzodiazepine\" }\n  ?Species os:hasChebiID ?ChebiID .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-53",
        "domain": "ontocompchem",
        "question": "Could you help me find the SLUMO energy value for I2 when determined at the PBE0 complexity level?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"I2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-463",
        "domain": "ontospecies",
        "question": "Can you help me find chemicals that have a maximum of 7 heavy atoms and an undefined bond stereocenter count that's not in the range of -1 to 1?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue <= 7 )\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue < -1 || ?BondChiralUndefCountValue > 1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-394",
        "domain": "ontospecies",
        "question": "Can you provide me with the solubility, isotope atom count, and density of CN(C)CCCC1(C2=C(CO1)C=C(C=C2)C#N)C3=CC=C(C=C3)F?",
        "query": {
            "sparql": "SELECT ?Solubility ?IsotopeAtomCount ?Density WHERE {\n  VALUES ?Species { \"CN(C)CCCC1(C2=C(CO1)C=C(C=C2)C#N)C3=CC=C(C=C3)F\" }\n  ?Species os:hasSolubility ?Solubility .\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n  ?Species os:hasDensity ?Density .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-657",
        "domain": "ontospecies",
        "question": "What are the chemical species whose defined atom stereocenter count is < 1.0 and atom stereocenter count is < 1.0",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue < 1.0 )\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue < 1.0 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-480",
        "domain": "ontospecies",
        "question": "Can you find chemical species that have a charge less than 1.0 and a solubility close to 0.0618?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue < 1.0 )\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue > 0.0618*0.9 && ?SolubilityValue < 0.0618*1.1 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-154",
        "domain": "ontokin",
        "question": "Thermodynamic model of IC8H17COCH2 in all reaction mechanisms, looking for specifics.",
        "query": {
            "sparql": "SELECT ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"IC8H17COCH2\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-738",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species that have a viscosity of zero or more, fall under the classification of p-block molecular entity, and are also part of the polyatomic entity and organochlorine compound classes.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasViscosity/os:value ?ViscosityValue .\n  FILTER ( ?ViscosityValue >= 0 )\n  ?Species os:hasChemicalClass/rdfs:label \"p-block molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"polyatomic entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organochlorine compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-288",
        "domain": "ontospecies",
        "question": "Can you list the various properties of C4H6O6?",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"C4H6O6\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-360",
        "domain": "ontocompchem",
        "question": "I need to know the 4-31G basis set's calculation of energy and rotational constants for O3.",
        "query": {
            "sparql": "SELECT ?SCFEnergy ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"O3\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"4-31G\" }\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-101",
        "domain": "ontospecies",
        "question": "What are the details of C6H6S's bond chiral undef count, surface tension, and applications?",
        "query": {
            "sparql": "SELECT ?BondChiralUndefCount ?SurfaceTension ?UseLabel WHERE {\n  VALUES ?Species { \"C6H6S\" }\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-331",
        "domain": "ontospecies",
        "question": "What is the surface tension of the chemical species whose chemical class is organic aromatic compound",
        "query": {
            "sparql": "SELECT ?SurfaceTension WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic aromatic compound\" .\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-723",
        "domain": "ontospecies",
        "question": "For CNS(=O)(=O)CC1=CC2=C(C=C1)NC=C2CCN(C)C, what is its polar surface area",
        "query": {
            "sparql": "SELECT ?PolarSurfaceArea WHERE {\n  VALUES ?Species { \"CNS(=O)(=O)CC1=CC2=C(C=C1)NC=C2CCN(C)C\" }\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-146",
        "domain": "ontospecies",
        "question": "Can you tell me the density of 2-[4-(2-methylpropyl)phenyl]propanoic acid?",
        "query": {
            "sparql": "SELECT ?Density WHERE {\n  VALUES ?Species { \"2-[4-(2-methylpropyl)phenyl]propanoic acid\" }\n  ?Species os:hasDensity ?Density .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-904",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is chemical entity and chemical classification is organophosphorus insecticide and chemical classification is organochalcogen compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"chemical entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organophosphorus insecticide\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organochalcogen compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-169",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species with an undefined atom stereocenter count that's greater than -1 but below 1, an undefined bond stereocenter count within (-1, 1), and an isotope atom count over -1 yet under 1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue > -1 && ?AtomChiralUndefCountValue < 1.0 )\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue > -1 && ?BondChiralUndefCountValue < 1 )\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue > -1.0 && ?IsotopeAtomCountValue < 1 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-64",
        "domain": "ontokin",
        "question": "I'm searching for the kinetic model of the chemical reaction HO2 + H = OH + OH that's a part of a mechanism presented in https://doi.org/10.1002/kin.20026. Could you help?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"HO2 + H = OH + OH\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-22",
        "domain": "ontocompchem",
        "question": "What's the FH molecule's ground state energy using the CCSD(T) level of theory and 3-21G basis set?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"FH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-349",
        "domain": "ontospecies",
        "question": "Can you tell me the surface tension for both C[Si]1(O[Si](O[Si](O[Si](O[Si](O1)(C)C)(C)C)(C)C)(C)C)C and CC(C)C1=CC=CC=C1?",
        "query": {
            "sparql": "SELECT ?SurfaceTension WHERE {\n  VALUES ?Species { \"C[Si]1(O[Si](O[Si](O[Si](O[Si](O1)(C)C)(C)C)(C)C)(C)C)C\" \"CC(C)C1=CC=CC=C1\" }\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-415",
        "domain": "ontospecies",
        "question": "Can you tell me the viscosity, density, and mono isotopic weight of 1-chloro-2-(1-chloropropan-2-yloxy)propane and C9H10O2?",
        "query": {
            "sparql": "SELECT ?Viscosity ?Density ?MonoIsotopicWeight WHERE {\n  VALUES ?Species { \"1-chloro-2-(1-chloropropan-2-yloxy)propane\" \"C9H10O2\" }\n  ?Species os:hasViscosity ?Viscosity .\n  ?Species os:hasDensity ?Density .\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-95",
        "domain": "ontocompchem",
        "question": "Can you find the total energy, optimized geometry, and total enthalpy of CO using a CC-pVDZ basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?OptimizedGeometry ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CO\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-252",
        "domain": "ontocompchem",
        "question": "What is the total energy and optimized geometry of BrH calculated at the CCSD(T) level of theory using the STO-3G basis set",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BrH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"CCSD(T)\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-3G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-685",
        "domain": "ontospecies",
        "question": "What is the role of InChI=1S/C3H7NO2/c1-3(2)4(5)6/h3H,1-2H3",
        "query": {
            "sparql": "SELECT ?UseLabel WHERE {\n  VALUES ?Species { \"InChI=1S/C3H7NO2/c1-3(2)4(5)6/h3H,1-2H3\" }\n  ?Species os:hasUse/rdfs:label ?UseLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-310",
        "domain": "ontokin",
        "question": "What's the specific chemical process in this source https://doi.org/10.1002/kin.20603 where C14H13OO gets transformed into C11OOH9-2H?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C11OOH9-2H\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C14H13OO\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-444",
        "domain": "ontospecies",
        "question": "I'm looking for information on the collision cross section between InChI=1S/C4H10N2O/c1-3-6(4-2)5-7/h3-4H2,1-2H3 and CN1C=NC2=C1C(=O)NC(=O)N2C.",
        "query": {
            "sparql": "SELECT ?CollisionCrossSection WHERE {\n  VALUES ?Species { \"InChI=1S/C4H10N2O/c1-3-6(4-2)5-7/h3-4H2,1-2H3\" \"CN1C=NC2=C1C(=O)NC(=O)N2C\" }\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-288",
        "domain": "ontokin",
        "question": "Can you find the specifics about the chemical reaction used in the method discussed in https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-497",
        "domain": "ontokin",
        "question": "Please clarify the reactions O2 + H (+ N2) <=> HO2 (+ N2), H + H + H2 = H2 + H2 and O + H2O2 = HO2 + OH, what is the coordination mechanism among these?",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"O2 + H (+ N2) <=> HO2 (+ N2)\" .\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H + H + H2 = H2 + H2\" .\n  ?Mechanism okin:hasReaction/okin:hasEquation \"O + H2O2 = HO2 + OH\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-190",
        "domain": "ontokin",
        "question": "Need to understand the kinetic model for this equation: H2O2 + OH = H2O + HO2. It's from a mechanism mentioned here https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2O2 + OH = H2O + HO2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-448",
        "domain": "ontospecies",
        "question": "What's the Henry's law constant for a chemical species that is a p-block molecular entity, heterocyclic compound, and an organic polycyclic compound?",
        "query": {
            "sparql": "SELECT ?HenrysLawConstant WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"p-block molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heterocyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"organic polycyclic compound\" .\n  ?Species os:hasHenrysLawConstant ?HenrysLawConstant .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-10",
        "domain": "ontokin",
        "question": "Kinetic model for a chemical reaction where MDCY358O turns into MDCY24MOXO?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDCY358O\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDCY24MOXO\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-257",
        "domain": "ontocompchem",
        "question": "Can I find the total Gibbs free energy for W using all theoretical levels and basis sets?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"W\" .\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-371",
        "domain": "ontospecies",
        "question": "I need to find out the boiling point for C6H3Cl2NO2, can you help?",
        "query": {
            "sparql": "SELECT ?BoilingPoint WHERE {\n  VALUES ?Species { \"C6H3Cl2NO2\" }\n  ?Species os:hasBoilingPoint ?BoilingPoint .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-152",
        "domain": "ontocompchem",
        "question": "What is the total enthalpy of BH3 calculated at the UB3LYP level of theory using the 3-21G basis set",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BH3\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"3-21G\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-194",
        "domain": "ontokin",
        "question": "Can you show me a chemical reaction where C12O4-6 is the result?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C12O4-6\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-103",
        "domain": "ontokin",
        "question": "What's the count of chemical reactions in the mechanism found in this study https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-365",
        "domain": "ontospecies",
        "question": "What's the density, bond stereocenter count, and bond chiral undef count for a chemical species with an autoignition temperature of about 463.15 and Log S equals -0.72?",
        "query": {
            "sparql": "SELECT ?Density ?BondChiralDefCount ?BondChiralUndefCount WHERE {\n  ?Species os:hasAutoignitionTemperature/os:value ?AutoignitionTemperatureValue .\n  FILTER ( ?AutoignitionTemperatureValue > 463.15*0.9 && ?AutoignitionTemperatureValue < 463.15*1.1 )\n  ?Species os:hasLogS/os:value ?LogSValue .\n  FILTER ( ?LogSValue = -0.72 )\n  ?Species os:hasDensity ?Density .\n  ?Species os:hasBondChiralDefCount ?BondChiralDefCount .\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-143",
        "domain": "ontokin",
        "question": "Searching for a chemical reaction that produces C10KET5-8.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C10KET5-8\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-737",
        "domain": "ontospecies",
        "question": "What are the chemical species whose isotope atom count is greater than -1.0 and chemical class is organic aromatic compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasIsotopeAtomCount/os:value ?IsotopeAtomCountValue .\n  FILTER ( ?IsotopeAtomCountValue > -1.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic aromatic compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-807",
        "domain": "ontospecies",
        "question": "Can you find chemicals that have a rotatable bond count of exactly 2, an XLogP3 close to 2.7, and the number of covalent units within the range of (0.9, 1.1)?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue = 2.0 )\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value > 2.7*0.9 && ?XLogP3Value < 2.7*1.1 )\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue > 0.9 && ?CovalentUnitCountValue < 1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-613",
        "domain": "ontospecies",
        "question": "What type of chemical species are classified as Plastics & Rubber?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"Plastics & Rubber\" .\n  ?Species os:hasChemicalClass/rdfs:label \"Plastics & Rubber\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-476",
        "domain": "ontocompchem",
        "question": "How do I find the frequencies of Sc using M06 theory and what basis set do I use in the calculations?",
        "query": {
            "sparql": "SELECT ?Frequencies ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Sc\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?Frequencies .\n  ?Frequencies a occ:Frequencies .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-370",
        "domain": "ontospecies",
        "question": "I need to find out the counts of rotatable bonds, defined atom stereocenters, and bond stereocenters for a chemical that boils at approximately 503.15 degrees, falls under the classifications of both silicon molecular entity and p-block molecular entity, and is applied in the field of Personal Care.",
        "query": {
            "sparql": "SELECT ?RotatableBondCount ?AtomChiralDefCount ?BondChiralDefCount WHERE {\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue > 503.15*0.9 && ?BoilingPointValue < 503.15*1.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"silicon molecular entity\" .\n  ?Species os:hasUse/rdfs:label \"Personal Care\" .\n  ?Species os:hasChemicalClass/rdfs:label \"p-block molecular entity\" .\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n  ?Species os:hasBondChiralDefCount ?BondChiralDefCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-21",
        "domain": "ontokin",
        "question": "I'm trying to understand the kinetic model for the chemical reaction that results in product C7H14OOH3-2 from the article at https://doi.org/10.1016/j.combustflame.2007.10.024. What is it?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C7H14OOH3-2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-489",
        "domain": "ontokin",
        "question": "What's the specific chemical reaction for the mechanism discussed on www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-247",
        "domain": "ontokin",
        "question": "What is the chemical reaction that is involved in the mechanism found in https://doi.org/10.1002/kin.20026 and has reactant C7H15O2H4 and has product MO8OXO4J and has reactant C7H14OOH4-2O2",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7H15O2H4\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MO8OXO4J\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7H14OOH4-2O2\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-235",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction H + HO2 = OH + OH",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + HO2 = OH + OH\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-25",
        "domain": "ontocompchem",
        "question": "What is the SCF energy of Xe",
        "query": {
            "sparql": "SELECT ?SCFEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Xe\" .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-368",
        "domain": "ontospecies",
        "question": "Can you tell me the standard enthalpy of formation for these substances: C7H7NO2, CS(=O)C, C(CCN)C[C@@H](C(=O)O)N?",
        "query": {
            "sparql": "SELECT ?StandardEnthalpyOfFormation WHERE {\n  VALUES ?Species { \"C7H7NO2\" \"CS(=O)C\" \"C(CCN)C[C@@H](C(=O)O)N\" }\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-256",
        "domain": "ontokin",
        "question": "What is the kinetic model of the chemical reaction H2O + O = OH + OH involved in the mechanism found in https://doi.org/10.1002/kin.20026",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2O + O = OH + OH\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-627",
        "domain": "ontospecies",
        "question": "What's the InChI and its hashed version for (2S,3S)-2-azanyl-3-methyl-pentanoic acid?",
        "query": {
            "sparql": "SELECT ?InChI ?InChIKey WHERE {\n  VALUES ?Species { \"(2S,3S)-2-azanyl-3-methyl-pentanoic acid\" }\n  ?Species os:hasInChI ?InChI .\n  ?Species os:hasInChIKey ?InChIKey .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-404",
        "domain": "ontospecies",
        "question": "How many covalent units are there in 4-amino-N-pyrimidin-2-ylbenzenesulfonamide, 1-pentene, and C6H2ClN3O6?",
        "query": {
            "sparql": "SELECT ?CovalentUnitCount WHERE {\n  VALUES ?Species { \"4-amino-N-pyrimidin-2-ylbenzenesulfonamide\" \"1-pentene\" \"C6H2ClN3O6\" }\n  ?Species os:hasCovalentUnitCount ?CovalentUnitCount .\n}"
        }
    }
]