[
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-197",
        "domain": "ontokin",
        "question": "I'm looking up the kinetic model of a chemical reaction. It involves MD9DOH9 reacting to form YC7H14O-XO2H. Any ideas on what that might be?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD9DOH9\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"YC7H14O-XO2H\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-18",
        "domain": "ontocompchem",
        "question": "Can you tell me the total enthalpy, LUMO+2 energy, and geometry of Pt according to the PBE0 level of theory, using the 6-311+G, aug-cc-pVTZ or CC-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy ?LUMOPlus2Energy ?OptimizedGeometry WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Pt\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311+G\" \"aug-cc-pVTZ\" \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-769",
        "domain": "ontospecies",
        "question": "Can you tell me the count of hydrogen bond donors in CC(C)(C)C(CCC1=CC=C(C=C1)Cl)(CN2C=NC=N2)O?",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount WHERE {\n  VALUES ?Species { \"CC(C)(C)C(CCC1=CC=C(C=C1)Cl)(CN2C=NC=N2)O\" }\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-1001",
        "domain": "ontospecies",
        "question": "I need to find out about the chemical species with a collision cross section of at least 0.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCollisionCrossSection/os:value ?CollisionCrossSectionValue .\n  FILTER ( ?CollisionCrossSectionValue >= 0 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-369",
        "domain": "ontocompchem",
        "question": "What is the ground state energy of COS across all basis set",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"COS\" .\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-85",
        "domain": "ontocompchem",
        "question": "What are the rotational constants for I2, taking into account the theory level used in the calculations?",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"I2\" .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-440",
        "domain": "ontospecies",
        "question": "What are the chemical species whose bond stereocenter count is around 0.0 and vapor pressure is less than or equal to 8.79927774 and atom chiral def count is approximately 3.0 and covalent unit count is inside the range (0.9, 2)",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > -0.1 && ?BondChiralCountValue < 0.1 )\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue <= 8.79927774 )\n  ?Species os:hasAtomChiralDefCount/os:value ?AtomChiralDefCountValue .\n  FILTER ( ?AtomChiralDefCountValue > 3.0*0.9 && ?AtomChiralDefCountValue < 3.0*1.1 )\n  ?Species os:hasCovalentUnitCount/os:value ?CovalentUnitCountValue .\n  FILTER ( ?CovalentUnitCountValue > 0.9 && ?CovalentUnitCountValue < 2 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-301",
        "domain": "ontospecies",
        "question": "What is the tautomer count of phenyl dihydrogen phosphate",
        "query": {
            "sparql": "SELECT ?TautomerCount WHERE {\n  VALUES ?Species { \"phenyl dihydrogen phosphate\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-34",
        "domain": "ontokin",
        "question": "Looking for kinetic model of a reaction where C7OOH2-OO6-2 reacts to produce MOKET43 and C12KET2-6 as mentioned in this resource https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7OOH2-OO6-2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MOKET43\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C12KET2-6\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-26",
        "domain": "ontocompchem",
        "question": "How much total energy does H2O2 have when calculated on the RB3LYP level with the CC-pVTZ basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F6S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-187",
        "domain": "ontocompchem",
        "question": "Can you provide the total Gibbs free energy of HO2 calculated with either the 6-311G or 4-31G basis set, noting the theory level used for calculations?",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HO2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311G\" \"4-31G\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-560",
        "domain": "ontospecies",
        "question": "Need info on atom chiral undef counts and dissociation constants for any oxygen molecular entity with vapor pressure > 0.03911679 and less than or equal to one bond chiral count.",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount ?DissociationConstants WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue > 0.03911679 )\n  ?Species os:hasChemicalClass/rdfs:label \"oxygen molecular entity\" .\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue <= 1 )\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-221",
        "domain": "ontospecies",
        "question": "For InChI=1S/C8H11N/c1-6-3-4-8(9)7(2)5-6/h3-5H,9H2,1-2H3, what is its number of hydrogen bond donors and bond chiral def count and IUPAC name",
        "query": {
            "sparql": "SELECT ?HydrogenBondDonorCount ?BondChiralDefCount ?IUPACName WHERE {\n  VALUES ?Species { \"InChI=1S/C8H11N/c1-6-3-4-8(9)7(2)5-6/h3-5H,9H2,1-2H3\" }\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n  ?Species os:hasBondChiralDefCount ?BondChiralDefCount .\n  ?Species os:hasIUPACName ?IUPACName .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-207",
        "domain": "ontocompchem",
        "question": "Using all basis set, what are the NHOMO energy, total energy, and the best geometry for Ce when calculated at the PM6 level?",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?HOMOMinus1Energy ?TotalEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ce\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-315",
        "domain": "ontocompchem",
        "question": "What is the optimized geometry of CIN calculated using the STO-5G basis set, specifying the level of theory at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CIN\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-5G\" }\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-312",
        "domain": "ontocompchem",
        "question": "What is the rotational constants and NHOMO energy of ClH calculated at the PM6 level across all basis set",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?HOMOMinus1Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"ClH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-55",
        "domain": "ontocompchem",
        "question": "I'm searching for the calculation of HOMO energy for FH using the STO-2G or aug-cc-pVQZ basis sets, any results?",
        "query": {
            "sparql": "SELECT ?HOMOEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"FH\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-2G\" \"aug-cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOEnergy .\n  ?HOMOEnergy a occ:HOMOEnergy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-78",
        "domain": "ontocompchem",
        "question": "I need info on Mn's LUMO+2 energy according to the UB3LYP theoretical framework with aug-cc-pVDZ or CC-pVTZ basis sets.",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mn\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVDZ\" \"CC-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-377",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is organothiophosphorus compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organothiophosphorus compound\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-429",
        "domain": "ontokin",
        "question": "I'm looking for the process involved in the kinetic model of a reaction that transforms MP2D3J into NC5H11CHO, as written up in this research https://doi.org/10.1002/kin.20603.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MP2D3J\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"NC5H11CHO\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-494",
        "domain": "ontocompchem",
        "question": "What is the rotational constants and energy of Hg calculated at the RB3LYP level across all basis set",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?SCFEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Hg\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasResult ?SCFEnergy .\n  ?SCFEnergy a occ:SCFEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-494",
        "domain": "ontospecies",
        "question": "Can you tell me the isoelectric point for C20H24N2O2?",
        "query": {
            "sparql": "SELECT ?IsoelectricPoint WHERE {\n  VALUES ?Species { \"C20H24N2O2\" }\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-297",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical classification is tricyclic hydrocarbon and chemical class is ortho-fused polycyclic arene",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"tricyclic hydrocarbon\" .\n  ?Species os:hasChemicalClass/rdfs:label \"ortho-fused polycyclic arene\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-346",
        "domain": "ontospecies",
        "question": "Can you list the different properties of (2-fluorophenyl)amine?",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"(2-fluorophenyl)amine\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-52",
        "domain": "ontokin",
        "question": "Can you help me understand the kinetic modeling of this reaction: OH + HO2 = H2O + O2?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"OH + HO2 = H2O + O2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-290",
        "domain": "ontospecies",
        "question": "Can you tell me the atom chiral count and flash point for any chemical species that have a polar surface area more than 33.21?",
        "query": {
            "sparql": "SELECT ?FlashPoint ?AtomChiralCount WHERE {\n  ?Species os:hasPolarSurfaceArea/os:value ?PolarSurfaceAreaValue .\n  FILTER ( ?PolarSurfaceAreaValue > 33.21 )\n  ?Species os:hasFlashPoint ?FlashPoint .\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-184",
        "domain": "ontokin",
        "question": "Can you tell me what chemical species are mentioned in the reaction mechanism detailed in this study https://doi.org/10.1002/kin.20603?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-520",
        "domain": "ontospecies",
        "question": "Can you tell me the number of rotatable bonds present in the chemical structure of C8H9NO2?",
        "query": {
            "sparql": "SELECT ?RotatableBondCount WHERE {\n  VALUES ?Species { \"C8H9NO2\" }\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-151",
        "domain": "ontocompchem",
        "question": "What is the total Gibbs free energy of HO- calculated using the cc-pVDZ or 4-31G basis set",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HO-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVDZ\" \"4-31G\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-327",
        "domain": "ontokin",
        "question": "Can you show me the count of chemical reactions where MDCY234OXO is a reactant, according to the study found at https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDCY234OXO\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-81",
        "domain": "ontocompchem",
        "question": "What is the SLUMO energy and total energy of AsY calculated at the RB3LYP level of theory using the aug-cc-pVTZ or 6-311G basis set",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"AsY\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"aug-cc-pVTZ\" \"6-311G\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-407",
        "domain": "ontokin",
        "question": "I'm looking for a simplified explanation of the kinetic reaction model for O2 + H (+ N2) = HO2 (+ N2) as provided on www.osti.gov/servlets/purl/90098-26Ev73/webviewable/.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"O2 + H (+ N2) = HO2 (+ N2)\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-199",
        "domain": "ontokin",
        "question": "I'm looking for the specific chemical reaction with MSKET3MO as a reactant and MOKET36O as the resulting product.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MOKET36O\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MSKET3MO\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-372",
        "domain": "ontospecies",
        "question": "Can you list the chemical species that have a monoisotopic weight from 91.808334 to 113, are used in Auto Products, and have an XLOGP3 less than or equal to 1.87?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 91.808334 && ?MonoIsotopicWeightValue < 113 )\n  ?Species os:hasUse/rdfs:label \"Auto Products\" .\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value <= 1.87 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-1008",
        "domain": "ontospecies",
        "question": "What are the chemical species whose monoisotopic mass is lower than 149 and bond chiral def count is not greater than 1.0 and compound complexity is less than 100",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue < 149 )\n  ?Species os:hasBondChiralDefCount/os:value ?BondChiralDefCountValue .\n  FILTER ( ?BondChiralDefCountValue <= 1.0 )\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue < 100 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-325",
        "domain": "ontokin",
        "question": "I need information on the transport and thermodynamic model of the chemical species in the reaction mechanism from https://doi.org/10.1002/kin.20603. Where can I find it?",
        "query": {
            "sparql": "SELECT ?TransportModel ?ThermoModel WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-432",
        "domain": "ontospecies",
        "question": "For the chemical species whose undefined atom stereocenter count is = 0.0, what is its density",
        "query": {
            "sparql": "SELECT ?Density WHERE {\n  ?Species os:hasAtomChiralUndefCount/os:value ?AtomChiralUndefCountValue .\n  FILTER ( ?AtomChiralUndefCountValue = 0.0 )\n  ?Species os:hasDensity ?Density .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-408",
        "domain": "ontospecies",
        "question": "Need to find out about the chemical species having classifications as both haloalkane and molecule and also aschloroethanes, with their hydrogen bond acceptor count being greater than -1.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"haloalkane\" .\n  ?Species os:hasChemicalClass/rdfs:label \"molecule\" .\n  ?Species os:hasChemicalClass/rdfs:label \"chloroethanes\" .\n  ?Species os:hasHydrogenBondAcceptorCount/os:value ?HydrogenBondAcceptorCountValue .\n  FILTER ( ?HydrogenBondAcceptorCountValue > -1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-526",
        "domain": "ontospecies",
        "question": "Need info on the vapor pressure values of 2,5-dimethylfuran and C1=CC(=CC=C1C(C2=CC=C(C=C2)Cl)(C(Cl)(Cl)Cl)O)Cl.",
        "query": {
            "sparql": "SELECT ?VaporPressure WHERE {\n  VALUES ?Species { \"2,5-dimethylfuran\" \"C1=CC(=CC=C1C(C2=CC=C(C=C2)Cl)(C(Cl)(Cl)Cl)O)Cl\" }\n  ?Species os:hasVaporPressure ?VaporPressure .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-305",
        "domain": "ontospecies",
        "question": "Need info on the number of undefined atom stereocenters in C20H18ClNO6 and also its isoelectric point.",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount ?IsoelectricPoint WHERE {\n  VALUES ?Species { \"C20H18ClNO6\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-4",
        "domain": "ontocompchem",
        "question": "What is the LUMO+1 energy and NHOMO energy and rotational constants of No calculated at the B3LYP level of theory",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy ?HOMOMinus1Energy ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"No\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-92",
        "domain": "ontospecies",
        "question": "Can you tell me the empirical and molecular formula for ethyl 4-hydroxybenzoate?",
        "query": {
            "sparql": "SELECT ?MolecularFormula ?EmpiricalFormula WHERE {\n  VALUES ?Species { \"ethyl 4-hydroxybenzoate\" }\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-789",
        "domain": "ontospecies",
        "question": "How many undefined atom stereocenters does 4-fluoroaniline have?",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount WHERE {\n  VALUES ?Species { \"4-fluoroaniline\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-135",
        "domain": "ontospecies",
        "question": "What are the differentiating features of these alcohols: InChI=1S/C8H10O3/c9-7-5-3-1-2-4-6(5)8(10)11-7/h5-6H,1-4H2, ClNO and C1C(=O)NC2=C(C=C(C=C2)[N+](=O)[O-])C(=N1)C3=CC=CC=C3Cl?",
        "query": {
            "sparql": "SELECT ?PropertyName WHERE {\n  VALUES ?Species { \"InChI=1S/C8H10O3/c9-7-5-3-1-2-4-6(5)8(10)11-7/h5-6H,1-4H2\" \"ClNO\" \"C1C(=O)NC2=C(C=C(C=C2)[N+](=O)[O-])C(=N1)C3=CC=CC=C3Cl\" }\n  ?Species ?hasPropertyName ?PropertyName .\n  ?PropertyName a/rdfs:subClassOf os:Property .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-245",
        "domain": "ontocompchem",
        "question": "Can you find the total Gibbs free energy of Cu with the 6-311+G, aug-cc-pVQZ, or STO-4G basis sets? Include the level of theory used in the calculations.",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"6-311+G\" \"aug-cc-pVQZ\" \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-89",
        "domain": "ontospecies",
        "question": "Can you find chemical species with a monoisotopic mass greater than 119.74748400000001 but less than 147?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 119.74748400000001 && ?MonoIsotopicWeightValue < 147 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-5",
        "domain": "ontocompchem",
        "question": "What is the HOMO-2 energy of Rn calculated at the UB3LYP level of theory",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Rn\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-247",
        "domain": "ontospecies",
        "question": "Can you list all the chemical species classified as halide?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"halide\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-218",
        "domain": "ontokin",
        "question": "Can you help me find the kinetic model of the N2 + H + H <=> H2 + N2 chemical reaction discussed in this study https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"N2 + H + H <=> H2 + N2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    }
]