[
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-669",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is organic cyclic compound and chemical classification is carboxylic acid",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic cyclic compound\" .\n  ?Species os:hasChemicalClass/rdfs:label \"carboxylic acid\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-54",
        "domain": "ontospecies",
        "question": "Need details on InChI=1S/C8H19O2PS3/c1-4-9-11(12,10-5-2)14-8-7-13-6-3/h4-8H2,1-3H3's collision cross section, its XLOGP3 value and what its empirical formula is.",
        "query": {
            "sparql": "SELECT ?CollisionCrossSection ?XLogP3 ?EmpiricalFormula WHERE {\n  VALUES ?Species { \"InChI=1S/C8H19O2PS3/c1-4-9-11(12,10-5-2)14-8-7-13-6-3/h4-8H2,1-3H3\" }\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n  ?Species os:hasXLogP3 ?XLogP3 .\n  ?Species os:hasEmpiricalFormula ?EmpiricalFormula .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-545",
        "domain": "ontospecies",
        "question": "I'm looking for the count of chiral atoms in a CCCCCCCCCCCC molecule.",
        "query": {
            "sparql": "SELECT ?AtomChiralCount WHERE {\n  VALUES ?Species { \"CCCCCCCCCCCC\" }\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-102",
        "domain": "ontospecies",
        "question": "I'm looking for the flash point of a chemical with boiling point above or equal to 388, and its bond chiral undef count is between -1.0 and 1.0.",
        "query": {
            "sparql": "SELECT ?FlashPoint WHERE {\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue >= 388 )\n  ?Species os:hasBondChiralUndefCount/os:value ?BondChiralUndefCountValue .\n  FILTER ( ?BondChiralUndefCountValue > -1.0 && ?BondChiralUndefCountValue < 1.0 )\n  ?Species os:hasFlashPoint ?FlashPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-328",
        "domain": "ontospecies",
        "question": "I need to find out the enthalpy change when CCCCC sublimates.",
        "query": {
            "sparql": "SELECT ?EnthalpyOfSublimation WHERE {\n  VALUES ?Species { \"CCCCC\" }\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-211",
        "domain": "ontospecies",
        "question": "Can you list the chemical species with a density lower than 1.7160000000000002?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue < 1.7160000000000002 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-98",
        "domain": "ontospecies",
        "question": "Can you find chemical compounds with a LogP value close to 3.82 and a bond chiral count between 0 and 2?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue > 3.82*0.9 && ?LogPValue < 3.82*1.1 )\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > 0 && ?BondChiralCountValue < 2 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-303",
        "domain": "ontokin",
        "question": "www.osti.gov/servlets/purl/90098-26Ev73/webviewable/ has a particular mechanism. Can you tell me how many chemical reactions are there where MD6OOH4J is transformed into MDCY693O?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MD6OOH4J\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDCY693O\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-343",
        "domain": "ontospecies",
        "question": "Can you tell me the count of bond chiral undef and isotope atom in InChI=1S/Cl2O2S/c1-5(2,3)4?",
        "query": {
            "sparql": "SELECT ?BondChiralUndefCount ?IsotopeAtomCount WHERE {\n  VALUES ?Species { \"InChI=1S/Cl2O2S/c1-5(2,3)4\" }\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-276",
        "domain": "ontocompchem",
        "question": "I need to know the molecular structure for Os across every basis set.",
        "query": {
            "sparql": "SELECT ?OptimizedGeometry ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Os\" .\n  ?MolecularComputation occ:hasResult ?OptimizedGeometry .\n  ?OptimizedGeometry a occ:OptimizedGeometry .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-490",
        "domain": "ontokin",
        "question": "I'm looking for the kinetic model of a chemical reaction involving MN4OOH8O2 as a reactant and C8OOH2-2A and OC7H14OOH-QO2 as products, as explained in this source https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MN4OOH8O2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C8OOH2-2A\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"OC7H14OOH-QO2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-508",
        "domain": "ontokin",
        "question": "Show me the chemical reaction where C11H22O4-7-2 reacts and C10OOH1-OO5-2 and C11KET4-6-2 are produced.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C10OOH1-OO5-2\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C11H22O4-7-2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C11KET4-6-2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-467",
        "domain": "ontospecies",
        "question": "How can I find the log P, hydrogen bond donor count, and complexity of the compound B(F)(F)F?",
        "query": {
            "sparql": "SELECT ?LogP ?HydrogenBondDonorCount ?CompoundComplexity WHERE {\n  VALUES ?Species { \"B(F)(F)F\" }\n  ?Species os:hasLogP ?LogP .\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n  ?Species os:hasCompoundComplexity ?CompoundComplexity .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-409",
        "domain": "ontospecies",
        "question": "Can you tell me the temperature at which CC(C)NC1=NC(=NC(=N1)Cl)NC(C)C melts?",
        "query": {
            "sparql": "SELECT ?MeltingPoint WHERE {\n  VALUES ?Species { \"CC(C)NC1=NC(=NC(=N1)Cl)NC(C)C\" }\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-276",
        "domain": "ontokin",
        "question": "I'm looking for details on the kinetic modeling of a chemical reaction resulting in C7H15O2H-2 as mentioned in https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C7H15O2H-2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-876",
        "domain": "ontospecies",
        "question": "What's the chemical class, complexity of compounds, and count of non-hydrogen atoms in 2-methylfuran and C10H14N2?",
        "query": {
            "sparql": "SELECT ?ChemicalClassLabel ?CompoundComplexity ?HeavyAtomCount WHERE {\n  VALUES ?Species { \"2-methylfuran\" \"C10H14N2\" }\n  ?Species os:hasChemicalClass/rdfs:label ?ChemicalClassLabel .\n  ?Species os:hasCompoundComplexity ?CompoundComplexity .\n  ?Species os:hasHeavyAtomCount ?HeavyAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-793",
        "domain": "ontospecies",
        "question": "Looking for chemical species with vapor pressure less than 11, heavy atom count between 10 and 11, and classified as Toxic Gases & Vapors",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue < 11 )\n  ?Species os:hasHeavyAtomCount/os:value ?HeavyAtomCountValue .\n  FILTER ( ?HeavyAtomCountValue > 9 && ?HeavyAtomCountValue < 11.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"Toxic Gases & Vapors\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-146",
        "domain": "ontocompchem",
        "question": "I need to find out Br-'s LUMO+2 energy according to the RB3LYP level of theory.",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Br-\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"RB3LYP\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-443",
        "domain": "ontospecies",
        "question": "Can you find the molecular weight of InChI=1S/C7H5N3O6/c1-4-6(9(13)14)2-5(8(11)12)3-7(4)10(15)16/h2-3H,1H3 for me?",
        "query": {
            "sparql": "SELECT ?MolecularWeight WHERE {\n  VALUES ?Species { \"InChI=1S/C7H5N3O6/c1-4-6(9(13)14)2-5(8(11)12)3-7(4)10(15)16/h2-3H,1H3\" }\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-61",
        "domain": "ontocompchem",
        "question": "What will Ta's LUMO+2 energy results be if I calculate them using either the STO-2G or aug-cc-pVTZ basis set and underpin my calculations with specific theory levels?",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ta\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-2G\" \"aug-cc-pVTZ\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-507",
        "domain": "ontokin",
        "question": "For the chemical species that appears in the reaction mechanism found in https://doi.org/10.1016/j.combustflame.2007.10.024, what is its transport model and thermodynamic model",
        "query": {
            "sparql": "SELECT ?TransportModel ?ThermoModel WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-466",
        "domain": "ontospecies",
        "question": "What are the chemical species whose bond stereocenter count is greater than 2.7 and melting point is approximately 255.15",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue > 2.7 )\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue > 255.15*0.9 && ?MeltingPointValue < 255.15*1.1 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-332",
        "domain": "ontokin",
        "question": "What's the kinetic model for a chemical reaction with C5H5O(1,3) and MDCY707O as reactants?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C5H5O(1,3)\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"MDCY707O\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-161",
        "domain": "ontospecies",
        "question": "What is the SMILES string of InChI=1S/C4H10O2/c1-5-3-4-6-2/h3-4H2,1-2H3 and 4-methoxy-6-prop-2-enyl-1,3-benzodioxole",
        "query": {
            "sparql": "SELECT ?SMILES WHERE {\n  VALUES ?Species { \"InChI=1S/C4H10O2/c1-5-3-4-6-2/h3-4H2,1-2H3\" \"4-methoxy-6-prop-2-enyl-1,3-benzodioxole\" }\n  ?Species os:hasSMILES ?SMILES .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-249",
        "domain": "ontokin",
        "question": "In the article https://doi.org/10.1016/j.combustflame.2007.10.024, what is the count of chemical reactions resulting in the compounds C12KET4-6-2 and C2H5NO2?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C12KET4-6-2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C2H5NO2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-19",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has reactant RDECALIN and has product C11KET3-7 and has reactant C10KET5-1",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"RDECALIN\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C11KET3-7\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C10KET5-1\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-262",
        "domain": "ontospecies",
        "question": "Looking for the value of CC(=O)OCC1=C(N2C(C(C2=O)NC(=O)CC3=CC=CS3)SC1)C(=O)O's enthalpy when it sublimates.",
        "query": {
            "sparql": "SELECT ?EnthalpyOfSublimation WHERE {\n  VALUES ?Species { \"CC(=O)OCC1=C(N2C(C(C2=O)NC(=O)CC3=CC=CS3)SC1)C(=O)O\" }\n  ?Species os:hasEnthalpyOfSublimation ?EnthalpyOfSublimation .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-431",
        "domain": "ontocompchem",
        "question": "What's the HOMO-1 energy level of W when determined using the G3 level and CC-pVQZ basis set?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"W\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-62",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species with a boiling point of 492.15 and vapor pressure lower than 0.0026397831600000004 or higher than 1, belonging to both organic hydroxy compound and hydrogen molecular entity classes.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic hydroxy compound\" .\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue = 492.15 )\n  ?Species os:hasChemicalClass/rdfs:label \"hydrogen molecular entity\" .\n  ?Species os:hasVaporPressure/os:value ?VaporPressureValue .\n  FILTER ( ?VaporPressureValue < 0.0026397831600000004 || ?VaporPressureValue > 1 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-57",
        "domain": "ontokin",
        "question": "For the chemical reaction AR + O + O <=> O2 + AR, what is its kinetic model",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"AR + O + O <=> O2 + AR\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-374",
        "domain": "ontospecies",
        "question": "What's the hashed InChI corresponding to (2R)-2-[4-(4-cyano-2-fluorophenoxy)phenoxy]propanoic acid butyl ester?",
        "query": {
            "sparql": "SELECT ?InChIKey WHERE {\n  VALUES ?Species { \"(2R)-2-[4-(4-cyano-2-fluorophenoxy)phenoxy]propanoic acid butyl ester\" }\n  ?Species os:hasInChIKey ?InChIKey .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-429",
        "domain": "ontocompchem",
        "question": "Calculated rotational constants for BH3 using M06 level of theory and STO-4G basis set, what are they?",
        "query": {
            "sparql": "SELECT ?RotationalConstants WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"BH3\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"STO-4G\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-920",
        "domain": "ontospecies",
        "question": "What are the properties (LogS, surface tension and molecular mass) of a chemical species if its Henry's law constant is below 3010?",
        "query": {
            "sparql": "SELECT ?LogS ?SurfaceTension ?MolecularWeight WHERE {\n  ?Species os:hasHenrysLawConstant/os:value ?HenrysLawConstantValue .\n  FILTER ( ?HenrysLawConstantValue < 3010 )\n  ?Species os:hasLogS ?LogS .\n  ?Species os:hasSurfaceTension ?SurfaceTension .\n  ?Species os:hasMolecularWeight ?MolecularWeight .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-275",
        "domain": "ontospecies",
        "question": "Can you find me the chemical species with an approximate exact mass of 186.19836?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 186.19836*0.9 && ?ExactMassValue < 186.19836*1.1 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-163",
        "domain": "ontokin",
        "question": "I need some information on the transport model for MD8DMJ in all its reaction mechanisms.",
        "query": {
            "sparql": "SELECT ?TransportModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"MD8DMJ\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-139",
        "domain": "ontospecies",
        "question": "Chemical species with boiling point less than 414, more than 506.165 or exactly 460.15",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasBoilingPoint/os:value ?BoilingPointValue .\n  FILTER ( ?BoilingPointValue = 460.15 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-121",
        "domain": "ontospecies",
        "question": "What are the different names for C6H5ClO, InChI=1S/C7H9N/c1-6-3-2-4-7(8)5-6/h2-5H,8H2,1H3 and C4H6O3?",
        "query": {
            "sparql": "SELECT ?IdentifierName WHERE {\n  VALUES ?Species { \"C6H5ClO\" \"InChI=1S/C7H9N/c1-6-3-2-4-7(8)5-6/h2-5H,8H2,1H3\" \"C4H6O3\" }\n  ?Species ?hasIdentifierName ?IdentifierName .\n  ?IdentifierName a/rdfs:subClassOf os:Identifier .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-302",
        "domain": "ontokin",
        "question": "Can you find how many chemical reactions with reactants MBOM-3 and C8H14-17 that produce IC3H6CHO are mentioned in this study https://doi.org/10.1016/j.combustflame.2007.10.024?",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"MBOM-3\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C8H14-17\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"IC3H6CHO\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-449",
        "domain": "ontocompchem",
        "question": "Looking for information on Mn's rotational constants and total energy according to definite level of theory.",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?TotalEnergy ?LevelOfTheoryLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Mn\" .\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-891",
        "domain": "ontospecies",
        "question": "What are the chemical species whose chemical class is Ethers (<C12)",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"Ethers (<C12)\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-274",
        "domain": "ontospecies",
        "question": "Could you find the LogP for a heteroorganic entity that has an XLogP3 value that doesn't fall between 0.09000000000000001 and 0.11000000000000001?",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  ?Species os:hasXLogP3/os:value ?XLogP3Value .\n  FILTER ( ?XLogP3Value < 0.09000000000000001 || ?XLogP3Value > 0.11000000000000001 )\n  ?Species os:hasChemicalClass/rdfs:label \"heteroorganic entity\" .\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-91",
        "domain": "ontokin",
        "question": "Find kinetic model of a reaction that results in CY485JB.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"CY485JB\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-611",
        "domain": "ontospecies",
        "question": "What's the melting point for InChI=1S/C23H25N5O5/c1-30-18-11-14-15(12-19(18)31-2)25-23(26-21(14)24)28-9-7-27(8-10-28)22(29)20-13-32-16-5-3-4-6-17(16)33-20/h3-6,11-12,20H,7-10,13H2,1-2H3,(H2,24,25,26)?",
        "query": {
            "sparql": "SELECT ?MeltingPoint WHERE {\n  VALUES ?Species { \"InChI=1S/C23H25N5O5/c1-30-18-11-14-15(12-19(18)31-2)25-23(26-21(14)24)28-9-7-27(8-10-28)22(29)20-13-32-16-5-3-4-6-17(16)33-20/h3-6,11-12,20H,7-10,13H2,1-2H3,(H2,24,25,26)\" }\n  ?Species os:hasMeltingPoint ?MeltingPoint .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-469",
        "domain": "ontospecies",
        "question": "Search for chemical species with a near-zero atom chiral count, classified as Aromatic Hydrocarbons, and are part of the carbocyclic compound class.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue > -0.1 && ?AtomChiralCountValue < 0.1 )\n  ?Species os:hasChemicalClass/rdfs:label \"Aromatic Hydrocarbons\" .\n  ?Species os:hasChemicalClass/rdfs:label \"carbocyclic compound\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-412",
        "domain": "ontokin",
        "question": "https://doi.org/10.1002/kin.20603 identifies a certain chemical species in a reaction, what is it?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-75",
        "domain": "ontocompchem",
        "question": "Using the UB3LYP method, what's the energy for the next-to-top occupied molecular orbital of Ru?",
        "query": {
            "sparql": "SELECT ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Ru\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"UB3LYP\" }\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-17",
        "domain": "ontocompchem",
        "question": "B3LYP calculated zero point energy for Tm? What's the result?",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Tm\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-576",
        "domain": "ontospecies",
        "question": "Can you list the chemical species with a compound complexity of 99 or higher?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue >= 99 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-717",
        "domain": "ontospecies",
        "question": "Can you tell me the collision cross section for C8H16O3?",
        "query": {
            "sparql": "SELECT ?CollisionCrossSection WHERE {\n  VALUES ?Species { \"C8H16O3\" }\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-523",
        "domain": "ontospecies",
        "question": "What's the correct SMILES code for a compound called C7H14?",
        "query": {
            "sparql": "SELECT ?SMILES WHERE {\n  VALUES ?Species { \"C7H14\" }\n  ?Species os:hasSMILES ?SMILES .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-402",
        "domain": "ontospecies",
        "question": "Need to find out about the number of hydrogen bond donors and combustion heat for InChI=1S/C15H23NO2/c1-4-7-13-8-5-6-9-15(13)18-11-14(17)10-16-12(2)3/h4-6,8-9,12,14,16-17H,1,7,10-11H2,2-3H3.",
        "query": {
            "sparql": "SELECT ?HeatOfCombustion ?HydrogenBondDonorCount WHERE {\n  VALUES ?Species { \"InChI=1S/C15H23NO2/c1-4-7-13-8-5-6-9-15(13)18-11-14(17)10-16-12(2)3/h4-6,8-9,12,14,16-17H,1,7,10-11H2,2-3H3\" }\n  ?Species os:hasHeatOfCombustion ?HeatOfCombustion .\n  ?Species os:hasHydrogenBondDonorCount ?HydrogenBondDonorCount .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-439",
        "domain": "ontocompchem",
        "question": "Can you help me find the HOMO-2 energy level for Cl2 considering a certain basis set for calculations?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cl2\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-329",
        "domain": "ontospecies",
        "question": "For C6H5Cl2N, what is its atom chiral count and polar surface area and defined atom stereocenter count",
        "query": {
            "sparql": "SELECT ?AtomChiralCount ?PolarSurfaceArea ?AtomChiralDefCount WHERE {\n  VALUES ?Species { \"C6H5Cl2N\" }\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n  ?Species os:hasPolarSurfaceArea ?PolarSurfaceArea .\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-636",
        "domain": "ontospecies",
        "question": "Isotope atom count in InChI=1S/C6H15O3PS2/c1-4-11-5-6-12-10(7,8-2)9-3/h4-6H2,1-3H3, InChI=1S/C14H19Cl2NO2/c15-8-10-17(11-9-16)13-6-4-12(5-7-13)2-1-3-14(18)19/h4-7H,1-3,8-11H2,(H,18,19) and CC(=O)OCCOC?",
        "query": {
            "sparql": "SELECT ?IsotopeAtomCount WHERE {\n  VALUES ?Species { \"InChI=1S/C6H15O3PS2/c1-4-11-5-6-12-10(7,8-2)9-3/h4-6H2,1-3H3\" \"InChI=1S/C14H19Cl2NO2/c15-8-10-17(11-9-16)13-6-4-12(5-7-13)2-1-3-14(18)19/h4-7H,1-3,8-11H2,(H,18,19)\" \"CC(=O)OCCOC\" }\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-493",
        "domain": "ontospecies",
        "question": "I'm looking for the undefined values for CC(C)(C)C's atom stereocenter count, its isoelectric point, and its compound complexity.",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount ?IsoelectricPoint ?CompoundComplexity WHERE {\n  VALUES ?Species { \"CC(C)(C)C\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n  ?Species os:hasIsoelectricPoint ?IsoelectricPoint .\n  ?Species os:hasCompoundComplexity ?CompoundComplexity .\n}"
        }
    }
]