[
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-122",
        "domain": "ontokin",
        "question": "What is the kinetic model for a chemical reaction with O2 as a reactant, as described on this site: www.osti.gov/servlets/purl/90098-26Ev73/webviewable/?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"NC7H13OOH\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-624",
        "domain": "ontospecies",
        "question": "Can you tell me the collision cross section for 2,2,2-tris(chloranyl)ethanenitrile?",
        "query": {
            "sparql": "SELECT ?CollisionCrossSection WHERE {\n  VALUES ?Species { \"2,2,2-tris(chloranyl)ethanenitrile\" }\n  ?Species os:hasCollisionCrossSection ?CollisionCrossSection .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-24",
        "domain": "ontospecies",
        "question": "What are some examples of isoprenoid class chemicals where the LogP is either below 3 or exceeds 4.29?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"isoprenoid\" .\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue < 3 || ?LogPValue > 4.29 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-486",
        "domain": "ontospecies",
        "question": "For C2H4O2S, what is its charge and dissociation constants and molecular formula",
        "query": {
            "sparql": "SELECT ?Charge ?DissociationConstants ?MolecularFormula WHERE {\n  VALUES ?Species { \"C2H4O2S\" }\n  ?Species os:hasCharge ?Charge .\n  ?Species os:hasDissociationConstants ?DissociationConstants .\n  ?Species os:hasMolecularFormula ?MolecularFormula .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-97",
        "domain": "ontokin",
        "question": "Show me the thermodynamic and transport models of NC6KET32O for all the reactions it contributes to.",
        "query": {
            "sparql": "SELECT ?TransportModel ?ThermoModel ?Mechanism WHERE {\n  ?Species skos:altLabel \"NC6KET32O\" .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-927",
        "domain": "ontospecies",
        "question": "What is the undefined atom stereocenter count of COP(=S)(OC)OC1=CC=C(C=C1)[N+](=O)[O-]",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount WHERE {\n  VALUES ?Species { \"COP(=S)(OC)OC1=CC=C(C=C1)[N+](=O)[O-]\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-607",
        "domain": "ontospecies",
        "question": "Can you find chemical substances with a melting point around 318.15?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue > 318.15*0.9 && ?MeltingPointValue < 318.15*1.1 )\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-973",
        "domain": "ontospecies",
        "question": "What are the chemical species whose melting point is = 397.15 and chemical classification is organohalogen compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMeltingPoint/os:value ?MeltingPointValue .\n  FILTER ( ?MeltingPointValue = 397.15 )\n  ?Species os:hasChemicalClass/rdfs:label \"organohalogen compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-652",
        "domain": "ontospecies",
        "question": "Which chemical species have a compound complexity that doesn't fall between the values of 34.11 and 42?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasCompoundComplexity/os:value ?CompoundComplexityValue .\n  FILTER ( ?CompoundComplexityValue < 34.11 || ?CompoundComplexityValue > 42 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-140",
        "domain": "ontokin",
        "question": "I need to know the count of chemical reactions with C11H23OO-3-2 as a reactant, according to the mechanism detailed at www.osti.gov/servlets/purl/90098-26Ev73/webviewable/.",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C11H23OO-3-2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"www.osti.gov/servlets/purl/90098-26Ev73/webviewable/\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-515",
        "domain": "ontospecies",
        "question": "Can you find chemical species that are soluble around 0.26, used as fumigant insecticide, classified as heteroatomic molecular entity, have a mono isotopic weight over 30, an exact mass near 33.99724, and a rotatable bond count between -1 and 1?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue > 0.26*0.9 && ?SolubilityValue < 0.26*1.1 )\n  ?Species os:hasUse/rdfs:label \"fumigant insecticide\" .\n  ?Species os:hasChemicalClass/rdfs:label \"heteroatomic molecular entity\" .\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 30 )\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue > 33.99724*0.9 && ?ExactMassValue < 33.99724*1.1 )\n  ?Species os:hasRotatableBondCount/os:value ?RotatableBondCountValue .\n  FILTER ( ?RotatableBondCountValue > -1.0 && ?RotatableBondCountValue < 1 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-487",
        "domain": "ontokin",
        "question": "I need information on the kinetic model of the H + H2 + H <=> H2 + H2 chemical reaction from the study at this link https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + H2 + H <=> H2 + H2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-168",
        "domain": "ontocompchem",
        "question": "Can you tell me about the SLUMO energy for HO-?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"HO-\" .\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-712",
        "domain": "ontospecies",
        "question": "Can you find the count of undefined atom stereocenters and the standard enthalpy of formation for CCCCC(CC)CN1CC(CN(C1)CC(CC)CCCC)(C)N and C(C#N)C(=O)O? Also, I need their hashed InChI.",
        "query": {
            "sparql": "SELECT ?AtomChiralUndefCount ?StandardEnthalpyOfFormation ?InChIKey WHERE {\n  VALUES ?Species { \"CCCCC(CC)CN1CC(CN(C1)CC(CC)CCCC)(C)N\" \"C(C#N)C(=O)O\" }\n  ?Species os:hasAtomChiralUndefCount ?AtomChiralUndefCount .\n  ?Species os:hasStandardEnthalpyOfFormation ?StandardEnthalpyOfFormation .\n  ?Species os:hasInChIKey ?InChIKey .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-214",
        "domain": "ontocompchem",
        "question": "Can you give me the total enthalpy for CHN using the PBE0 method with the CC-pVDZ basis set?",
        "query": {
            "sparql": "SELECT ?TotalEnthalpy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"CHN\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"CC-pVDZ\" }\n  ?MolecularComputation occ:hasResult ?TotalEnthalpy .\n  ?TotalEnthalpy a occ:TotalEnthalpy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-127",
        "domain": "ontokin",
        "question": "For the chemical species that appears in the reaction mechanism found in https://doi.org/10.1002/kin.20603, what is its thermodynamic model and transport model",
        "query": {
            "sparql": "SELECT ?ThermoModel ?TransportModel WHERE {\n  ?Species okin:belongsToPhase/^okin:hasGasPhase ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Species okin:hasThermoModel ?ThermoModel .\n  ?ThermoModel okin:definedIn ?Mechanism .\n  ?Species okin:hasTransportModel ?TransportModel .\n  ?TransportModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-398",
        "domain": "ontokin",
        "question": "What is the chemical reaction that has product NC8KET35O and has reactant C7H15OOH-1-2 and is involved in the mechanism found in https://doi.org/10.1002/kin.20603 and has product H2O",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"NC8KET35O\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"C7H15OOH-1-2\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20603\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"H2O\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-697",
        "domain": "ontospecies",
        "question": "What are the chemical species whose surface tension is outside the range (0, 0.0495) and chemical class is mancude organic heterocyclic parent and chemical class is ortho-fused compound",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasSurfaceTension/os:value ?SurfaceTensionValue .\n  FILTER ( ?SurfaceTensionValue < 0 || ?SurfaceTensionValue > 0.0495 )\n  ?Species os:hasChemicalClass/rdfs:label \"mancude organic heterocyclic parent\" .\n  ?Species os:hasChemicalClass/rdfs:label \"ortho-fused compound\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-228",
        "domain": "ontospecies",
        "question": "What's the Log P value for InChI=1S/C13H17NO4/c1-3-7-17-12(15)10-5-6-11(14-9-10)13(16)18-8-4-2/h5-6,9H,3-4,7-8H2,1-2H3 and COC(=O)/C=C/C(=O)OC?",
        "query": {
            "sparql": "SELECT ?LogP WHERE {\n  VALUES ?Species { \"InChI=1S/C13H17NO4/c1-3-7-17-12(15)10-5-6-11(14-9-10)13(16)18-8-4-2/h5-6,9H,3-4,7-8H2,1-2H3\" \"COC(=O)/C=C/C(=O)OC\" }\n  ?Species os:hasLogP ?LogP .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-266",
        "domain": "ontocompchem",
        "question": "Can you tell me the total energy of H2O2 as calculated using the RB3LYP theory level method?",
        "query": {
            "sparql": "SELECT ?TotalEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cd\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"B3LYP\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-952",
        "domain": "ontospecies",
        "question": "Can you list the chemical species with a monoisotopic mass over 115.23370500000001 and an autoignition temperature of exactly 853.15?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue > 115.23370500000001 )\n  ?Species os:hasAutoignitionTemperature/os:value ?AutoignitionTemperatureValue .\n  FILTER ( ?AutoignitionTemperatureValue = 853.15 )\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-141",
        "domain": "ontocompchem",
        "question": "What is the total energy of I2 calculated at the M06 level of theory, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?TotalEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"I2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?TotalEnergy .\n  ?TotalEnergy a occ:TotalEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-623",
        "domain": "ontospecies",
        "question": "What's the atom chiral def count and optical rotation for a chemical species classified as an organic cyclic compound?",
        "query": {
            "sparql": "SELECT ?OpticalRotation ?AtomChiralDefCount WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organic cyclic compound\" .\n  ?Species os:hasOpticalRotation ?OpticalRotation .\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-364",
        "domain": "ontospecies",
        "question": "I'm looking for chemical species where the atom's chiral count is approximately zero.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasAtomChiralCount/os:value ?AtomChiralCountValue .\n  FILTER ( ?AtomChiralCountValue > -0.1 && ?AtomChiralCountValue < 0.1 )\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-25",
        "domain": "ontokin",
        "question": "Kinetic model for chemical reactions with MDCY794O as a product?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDCY794O\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-175",
        "domain": "ontokin",
        "question": "I need info on the kinetics of H + OH + M <=> H2O + M reaction as given in the document at this URL https://doi.org/10.1002/kin.20026.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H + OH + M <=> H2O + M\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1002/kin.20026\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n  ?KineticModel okin:definedIn ?Mechanism .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-214",
        "domain": "ontokin",
        "question": "Looking for the kinetic model for a reaction where C6H12OOH3-2 is the product.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C6H12OOH3-2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-602",
        "domain": "ontospecies",
        "question": "What is the undefined bond stereocenter count of tris(chloranyl)-fluoranyl-methane",
        "query": {
            "sparql": "SELECT ?BondChiralUndefCount WHERE {\n  VALUES ?Species { \"tris(chloranyl)-fluoranyl-methane\" }\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-778",
        "domain": "ontospecies",
        "question": "Search for chemical species in the organic hydride category that have positive density but no charge.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasDensity/os:value ?DensityValue .\n  FILTER ( ?DensityValue > 0 )\n  ?Species os:hasCharge/os:value ?ChargeValue .\n  FILTER ( ?ChargeValue = 0.0 )\n  ?Species os:hasChemicalClass/rdfs:label \"organic hydride\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-113",
        "domain": "ontokin",
        "question": "I'm looking for the kinetic model of a chemical reaction that results in the product MDCY689O. Can you help?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MDCY689O\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-431",
        "domain": "ontospecies",
        "question": "What are the names of hydroxy steroid compounds with a monoisotopic mass lower than 393.99580000000003?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasMonoIsotopicWeight/os:value ?MonoIsotopicWeightValue .\n  FILTER ( ?MonoIsotopicWeightValue < 393.99580000000003 )\n  ?Species os:hasChemicalClass/rdfs:label \"hydroxy steroid\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-8",
        "domain": "ontospecies",
        "question": "Undefined stereocenter count in InChI=1S/C4H7Cl/c1-4(2)3-5/h1,3H2,2H3",
        "query": {
            "sparql": "SELECT ?BondChiralUndefCount WHERE {\n  VALUES ?Species { \"InChI=1S/C4H7Cl/c1-4(2)3-5/h1,3H2,2H3\" }\n  ?Species os:hasBondChiralUndefCount ?BondChiralUndefCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-477",
        "domain": "ontokin",
        "question": "I'm searching for a chemical reaction in which C5H10OOH2-5 participates as a reactant.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"C5H10OOH2-5\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-73",
        "domain": "ontocompchem",
        "question": "Can you help me find the HOMO-2 energy of Br- according to the level of theory and basis set used in the calculations?",
        "query": {
            "sparql": "SELECT ?HOMOMinus2Energy ?LevelOfTheoryLabel ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Br-\" .\n  ?MolecularComputation occ:hasResult ?HOMOMinus2Energy .\n  ?HOMOMinus2Energy a occ:HOMOMinus2Energy .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-50",
        "domain": "ontospecies",
        "question": "I'm looking for the rotatable bond count of any plant metabolite that possesses a solubility of at least 10.107000000000001, can you help?",
        "query": {
            "sparql": "SELECT ?RotatableBondCount WHERE {\n  ?Species os:hasSolubility/os:value ?SolubilityValue .\n  FILTER ( ?SolubilityValue >= 10.107000000000001 )\n  ?Species os:hasUse/rdfs:label \"plant metabolite\" .\n  ?Species os:hasRotatableBondCount ?RotatableBondCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-287",
        "domain": "ontospecies",
        "question": "Can you tell me the count of tautomers for C5FeO5?",
        "query": {
            "sparql": "SELECT ?TautomerCount WHERE {\n  VALUES ?Species { \"C5FeO5\" }\n  ?Species os:hasTautomerCount ?TautomerCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-204",
        "domain": "ontospecies",
        "question": "Can you tell me the number of stereocenters in both C6H10 and C7H9NO2S?",
        "query": {
            "sparql": "SELECT ?AtomChiralCount WHERE {\n  VALUES ?Species { \"C6H10\" \"C7H9NO2S\" }\n  ?Species os:hasAtomChiralCount ?AtomChiralCount .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-111",
        "domain": "ontokin",
        "question": "Can you explain the kinetic model of H2O + M = H + OH + M reaction?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2O + M = H + OH + M\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-76",
        "domain": "ontokin",
        "question": "I'm looking for the kinetic model of a chemical process converting CH3-3-C4H4-13-1 to QMSTEAOOH.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CH3-3-C4H4-13-1\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"QMSTEAOOH\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-290",
        "domain": "ontokin",
        "question": "I'm looking for a chemical reaction where CY692JA is a reactant.",
        "query": {
            "sparql": "SELECT ?Reaction WHERE {\n  ?Reaction ocape:hasReactant/skos:altLabel \"CY692JA\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-323",
        "domain": "ontocompchem",
        "question": "What's the energy and rotational constants of the next-to-highest occupied molecular orbital for Cl2 calculated with PBE0 theory level using cc-pVQZ basis set?",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Cl2\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PBE0\" }\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n  VALUES ?BasisSetLabel { \"cc-pVQZ\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-264",
        "domain": "ontocompchem",
        "question": "Using the M06-2X level of theory, what's the computed value for SLUMO energy of F6S?",
        "query": {
            "sparql": "SELECT ?LUMOPlus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F6S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus1Energy .\n  ?LUMOPlus1Energy a occ:LUMOPlus1Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-316",
        "domain": "ontocompchem",
        "question": "Need to know the PM6 method calculation for the LUMO+2 energy and energy of the next-to-highest occupied molecular orbital of F6S.",
        "query": {
            "sparql": "SELECT ?LUMOPlus2Energy ?HOMOMinus1Energy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"F6S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"PM6\" }\n  ?MolecularComputation occ:hasResult ?LUMOPlus2Energy .\n  ?LUMOPlus2Energy a occ:LUMOPlus2Energy .\n  ?MolecularComputation occ:hasResult ?HOMOMinus1Energy .\n  ?HOMOMinus1Energy a occ:HOMOMinus1Energy .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-435",
        "domain": "ontocompchem",
        "question": "What is the total Gibbs free energy of H2S calculated at the M06-2X level of theory, specifying the basis set at which the calculations are performed",
        "query": {
            "sparql": "SELECT ?TotalGibbsFreeEnergy ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"H2S\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06-2X\" }\n  ?MolecularComputation occ:hasResult ?TotalGibbsFreeEnergy .\n  ?TotalGibbsFreeEnergy a occ:TotalGibbsFreeEnergy .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-67",
        "domain": "ontokin",
        "question": "Searching for the kinetic model for a reaction which results in products C4H8CHO4-2 along with C10H21OOH-2-2.",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"C4H8CHO4-2\" .\n  ?Reaction ocape:hasProduct/skos:altLabel \"C10H21OOH-2-2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-81",
        "domain": "ontokin",
        "question": "Can you show me how the reaction H2O2 + OH <=> H2O + HO2 works?",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"H2O2 + OH <=> H2O + HO2\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-746",
        "domain": "ontospecies",
        "question": "Need info on the defined atom stereocenter count, monoisotopic mass and vapor density of propiolic acid, CC(CCC=C(C)C)CCO & InChI=1S/C6H10O3/c1(5-3-8-5)7-2-6-4-9-6/h5-6H,1-4H2.",
        "query": {
            "sparql": "SELECT ?MonoIsotopicWeight ?VaporDensity ?AtomChiralDefCount WHERE {\n  VALUES ?Species { \"propiolic acid\" \"CC(CCC=C(C)C)CCO\" \"InChI=1S/C6H10O3/c1(5-3-8-5)7-2-6-4-9-6/h5-6H,1-4H2\" }\n  ?Species os:hasMonoIsotopicWeight ?MonoIsotopicWeight .\n  ?Species os:hasVaporDensity ?VaporDensity .\n  ?Species os:hasAtomChiralDefCount ?AtomChiralDefCount .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-578",
        "domain": "ontospecies",
        "question": "I need information on chemical species that belong to both the oxygen molecular entity and Inorganic Oxidizing Agents classes with a maximum bond stereocenter count of 1, minimum logP of 0.5850000000000001 and maximum exact mass of 35.188813 which are also used as a food packaging gas.",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"oxygen molecular entity\" .\n  ?Species os:hasChemicalClass/rdfs:label \"Inorganic Oxidizing Agents\" .\n  ?Species os:hasBondChiralCount/os:value ?BondChiralCountValue .\n  FILTER ( ?BondChiralCountValue <= 1 )\n  ?Species os:hasLogP/os:value ?LogPValue .\n  FILTER ( ?LogPValue >= 0.5850000000000001 )\n  ?Species os:hasExactMass/os:value ?ExactMassValue .\n  FILTER ( ?ExactMassValue <= 35.188813 )\n  ?Species os:hasUse/rdfs:label \"food packaging gas\" .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-655",
        "domain": "ontospecies",
        "question": "Can you tell me about the number of isotope atoms and solubility characteristics of acetic acid 2-(2-ethoxyethoxy)ethyl ester?",
        "query": {
            "sparql": "SELECT ?IsotopeAtomCount ?Solubility WHERE {\n  VALUES ?Species { \"acetic acid 2-(2-ethoxyethoxy)ethyl ester\" }\n  ?Species os:hasIsotopeAtomCount ?IsotopeAtomCount .\n  ?Species os:hasSolubility ?Solubility .\n}"
        }
    },
    {
        "id": "ontospecies_2023-11-09_15.17.52_train_ID-869",
        "domain": "ontospecies",
        "question": "Can you list some chemical species classified as organosulfur compound?",
        "query": {
            "sparql": "SELECT ?Species WHERE {\n  ?Species os:hasChemicalClass/rdfs:label \"organosulfur compound\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-377",
        "domain": "ontocompchem",
        "question": "What is the ground state energy of Lu calculated at the G3 level",
        "query": {
            "sparql": "SELECT ?ZeroPointEnergy WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Lu\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"G3\" }\n  ?MolecularComputation occ:hasResult ?ZeroPointEnergy .\n  ?ZeroPointEnergy a occ:ZeroPointEnergy .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-353",
        "domain": "ontokin",
        "question": "How does the O + HO2 <=> O2 + OH chemical reaction work?",
        "query": {
            "sparql": "SELECT ?Mechanism WHERE {\n  ?Mechanism okin:hasReaction/okin:hasEquation \"O + HO2 <=> O2 + OH\" .\n}"
        }
    },
    {
        "id": "ontocompchem_2023-11-29_09.40.43_train_regrounded_ID-87",
        "domain": "ontocompchem",
        "question": "Can you provide the rotational constants for Xe determined at the M06 level in various basis sets?",
        "query": {
            "sparql": "SELECT ?RotationalConstants ?BasisSetLabel WHERE {\n  ?MolecularComputation occ:hasSpeciesModel/occ:hasSpecies/rdfs:label \"Xe\" .\n  ?MolecularComputation occ:hasMethodology/occ:hasLevelOfTheory/rdfs:label ?LevelOfTheoryLabel .\n  VALUES ?LevelOfTheoryLabel { \"M06\" }\n  ?MolecularComputation occ:hasResult ?RotationalConstants .\n  ?RotationalConstants a occ:RotationalConstants .\n  ?MolecularComputation occ:hasMethodology/occ:hasBasisSet/rdfs:label ?BasisSetLabel .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-474",
        "domain": "ontokin",
        "question": "Details of all chemical reactions having MO5OOH2J as a product and CC6H10 as a reactant, as documented in https://doi.org/10.1016/j.combustflame.2007.10.024.",
        "query": {
            "sparql": "SELECT (COUNT(?Reaction) AS ?ReactionCount) WHERE {\n  ?Reaction ocape:hasProduct/skos:altLabel \"MO5OOH2J\" .\n  ?Reaction ocape:hasReactant/skos:altLabel \"CC6H10\" .\n  ?Reaction ^okin:hasReaction ?Mechanism .\n  ?Mechanism okin:hasProvenance/oprvn:hasDOI \"https://doi.org/10.1016/j.combustflame.2007.10.024\" .\n}"
        }
    },
    {
        "id": "ontokin_2023-11-29_10.08.01_train_regrounded_ID-373",
        "domain": "ontokin",
        "question": "Can you show me the kinetic model for the chemical reaction H2 + H + H <=> H2 + H2?",
        "query": {
            "sparql": "SELECT ?KineticModel WHERE {\n  ?Reaction okin:hasEquation \"H2 + H + H <=> H2 + H2\" .\n  ?Reaction okin:hasKineticModel ?KineticModel .\n}"
        }
    }
]